{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 3953\nPatch which partially addresses the above issues",
            "date": "20021126T14:55:48",
            "id": 0
        },
        {
            "author": null,
            "body": "Patch applied.\n\nI notice that redeployMode is not on by default; should we?\n\nAlso, does this patch fixes the problems in the bug report?  If so, please\nupdate bugzilla.  If not, what are the problems that was not addressed?",
            "date": "20021202T22:31:29",
            "id": 1
        },
        {
            "author": null,
            "body": "There have been some changes in this area of the code, and since I haven't heard\nfrom you, I assume that it has been fixed.  Reopen if that's not the case.",
            "date": "20030418T18:04:46",
            "id": 2
        }
    ],
    "component": "Jasper",
    "description": "There are two separate but related problems:\n\nWhen Jasper loads .tld files from the tag library jar files, it does not close \nthe jar files. Because of this, the file can not be deleted/overwritten on \nWindows, which causes pain when developing the application (and frequent \nchanges are desirable).\n\nWhen using Jasper inside Catalina, then a workaround is to stop the application \nusing the manager application (or stop the server, but that does not help the \nspeed of the development cycle). However, when Jasper is used outside the \nserver as a standalone embedded application, then there is no workaround. \n\nThe second problem is that Jasper uses the caches in JarURLConnection, which \nmeans that one .tld can not be redeployed from the same jar. A simple fix is to \ncall connection.setUseCaches(false), which now in JDK 1.4 finally works.\n\nAnother minor issue in class TldLocationsCache is the fact that it does not \nalways close the .tld file stream, which seems strange. I don't see any reason \nwhy not to close the stream.\n\nThe following patch may not be a complete solution to all these problems, but \nit goes in that direction. Please consider applying it. \n\nThanks. Petr",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "14854",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "P3 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Allow redeploying tag libraries from the same jar, do not lock the jar files on Windows",
    "systemSpecification": false,
    "version": "Nightly Build"
}