{
    "comments": [
        {
            "author": null,
            "body": "This should work off CATALINA_BASE by default again now. You may also configure \nthe CL using conf/catalina.properties (so don't complain).",
            "date": "20030115T08:28:06",
            "id": 0
        },
        {
            "author": null,
            "body": "Thanks Remy,\n\nNo complaints here.  I had no idea it was setable in catalina.propeties as that\ndidn't exist in Tomcat-4.x.x.  Without default behavior being the same as\nTomcat-4.1.x, though, I think that would be an issue for those counting on the\nbehavior and not having the proper info on how to get the desired behavior. \nThis just makes the default config of Tomcat-5 simpler.  Again, thanks for\nmaking the change and pointing out where I can change it myself.\n\nJake",
            "date": "20030115T18:13:36",
            "id": 1
        },
        {
            "author": null,
            "body": "Actually, the classloading scheme may undergo a radical change by the time\nTomcat 5 gets released.",
            "date": "20030115T20:00:54",
            "id": 2
        }
    ],
    "component": "Catalina",
    "description": "Using Tomcat-4.1.x, I can have separate instances of Tomcat running which access\ntheir own shared/lib folder.  In Tomcat-5.0 latest nightly build, that doesn't\nseem to be the case.  In fact, Tomcat5 only ever sees CATALINA_HOME/shared/lib\nwhere Tomcat4.1.x only ever sees CATALINA_BASE/shared/lib and only when\nCATALINA_BASE happens to be the same as CATALINA_HOME does Tomcat4.1.x see\nCATALINA_HOME/shared/lib.\n\nFor instance, using Tomcat-4.1.18, if I have some jars in\nCATALINA_HOME/shared/lib and I start up a new tomcat instance with CATALINA_BASE\nset as something other than CATALINA_HOME, the jars in CATALINA_HOME/shared/lib\nwill *not* be loaded.  Instead, jars will be loaded from\nCATALINA_BASE/shared/lib (if it exists).  This is the behavior I expect and love!\n\nHowever, using Tomcat-5.0, if I set things up the same way, jars in\nCATALNIA_HOME/shared/lib *will* be loaded and jars in CATALNIA_BASE/shared/lib\nare completely ignored. This is behavior that I don't expect and don't like.\n\nFor a concrete example...\nI use the capability of running separate instances of Tomcat to run apps which\nrequire different versions of xerces.  I put xerces-1.4.4.jar in\nCATALINA_HOME/shared/lib for apps which I use most often.  However, I have other\napps that need either slightly modified version of xerces-1.4.4 or require\nxerces-2.x.x.  For those cases, I run separate instances of Tomcat (running on\ndifferent ports, of course), each with a distinct CATALNIA_BASE and a local\nCATALINA_BASE/shared/lib with the appropriately versioned jars that I need for a\nparticular set of apps.  Everyone is happy because everyone gets to use their\nown shared set of libraries without stepping on each other.\n\nSo, obviously, this is a great feature in Tomcat-4.1.x (and, I assume,\nTomcat-4.0.x) but it seems to be broken in Tomcat-5.0.  \n\nIs this new behavior in Tomcat-5.0 a bug or was it intentional?  If it was\nintentional, can someone please explain the reasons for the change in behavior\nto that of Tomcat-4.1.x?\n\nJake",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "15774",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P3 major",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "tomcat5 shared/lib behavior different than that of tomcat4.1.x",
    "systemSpecification": true,
    "version": "Nightly Build"
}