{
    "comments": [
        {
            "author": null,
            "body": "I do not agree with that. Setting the content-language header is delayed, and\nwill be set right before the response is committed. I don't see any problem with\ndoing that.",
            "date": "20030322T21:26:44",
            "id": 0
        },
        {
            "author": null,
            "body": "Basically, in this case, the specification attempts to force how things are\nimplemented, although the servlet cannot access the headers. Delaying setting\nthem will not change anything, so the specification exact wording WILL NOT be\nimplemented. I am -1 for fixing this, as the container should use special\nhandling for all special HTTP headers, and restrict access to them.\n\nSome part of the bug seems valid, though (although it should be noted that the\nspec is too complex; as usual, why have three ways of doing the same thing ?).",
            "date": "20030322T21:33:36",
            "id": 1
        },
        {
            "author": null,
            "body": "Spec complexity concerns should be addressed to the JSR-154 EG. Even though I\nagree that the implementation doesn't necessarily have to be changed as I\nindicated, the fact is that calling setLocale() after calling setContentType()\n(without charset), doesn't work as defined by the spec in TC 5.0.1. \n\nDelaying setting the headers should be fine, as long as the end result is what's\ndefined by the extract from the spec I included.",
            "date": "20030322T22:10:27",
            "id": 2
        },
        {
            "author": null,
            "body": "This has been fixed. The spec is too complex, though.",
            "date": "20030501T20:56:21",
            "id": 3
        }
    ],
    "component": "Connector:HTTP",
    "description": "The setLocale() method in org.apache.coyote.tomcat5.CoyoteResponse is not spec\ncompliant: it doesn't respect a locale setting after setContentType() has been\ncalled, even if the provided content type doesn't specify a charset.\n\nThe Javadocs for setLocale() in Servlet 2.4 PDF2 says:\n\n  Sets the locale of the response, setting the Content-Language header, \n  if the response has not been committed yet. It also sets the response's \n  character encoding appropriately for the locale, if the character encoding\n  has not been explicitly set using setContentType(String) or \n  setCharacterEncoding(String) , getWriter hasn’t been called yet, and the \n  response hasn’t been committed yet. ...\n\nCoyoteResponse breaks two of these rules:\n1) It doesn't set the Content-Language header (by calling Response.setLocale())\n   if setContentType() or setCharacterEncoding() has been called. It should\n   make this call in all cases, as long as the response has not been committed.\n2) It doesn't set the charset attribute of the Content-Type header (by calling\n   Response.setCharacterEncoding()) if setContentType() has been called. It\n   should make this call even if setContentType() has been called, as long\n   as the specified content type doesn't include a charset attribute.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "18251",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "ServletResponse.setLocale() is not implemented as described in the spec",
    "systemSpecification": true,
    "version": "5.0.1"
}