{
    "comments": [
        {
            "author": null,
            "body": "It seems like the tomcat5 CoyoteServerSocketFactory allows configurable \nkeystore file, keystore password, and doesn't have the \"tomcat\" user hard \ncoded.  Am I looking at the wrong place?  Is this bug still relevant?",
            "date": "20030626T00:54:50",
            "id": 0
        },
        {
            "author": null,
            "body": "Added \"keyAlias\" property on CoyoteConnector, which allows specifying the\nparticular keypair and supporting cert chain to be used by the connector when it\nauthenticates itself to SSL clients.\n\nNotice that JSSE currently does not support assigning different passwords to\nindividual keys via its standard APIs. I was told this is being planned for a\nfuture release.\n",
            "date": "20030811T22:31:51",
            "id": 1
        }
    ],
    "component": "Catalina",
    "description": "Similar to bug 1400 in Tomcat 4.0 bug database...  I strongly disagree with\nthe \"WONT FIX\" reason.\n\nI and many others strongly need tomcat to use keystores like they were suppose \nto be used, i.e. have support for keyaliases and a different keypass for each \nkey then the password for the actual keystore.   Porting a J2EE web app from \nWeblogic 8 to TomCat/JBoss isn't clean at all... because I have to end up \ncreating TWO keystores... one for Tomcat to use to get the SSL\nkeys... and one for my application to use.\n\nTomcat should be able to support a keystore with more than one key each key \ndifferentiated by a keyalias and a seperate keypassword.  Right now, you can \nonly have one key... and the alias must be 'tomcat' and the password must be \nthe same as the keystore itself.  That is simply not right!\n\nAgain refer to bug 1400 for more details",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "19610",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Tomcat does not support a keystore with multiple keys with different passwords for each key",
    "systemSpecification": true,
    "version": "5.0.0"
}