{
    "comments": [
        {
            "author": null,
            "body": "Fixed.",
            "date": "20030626T00:06:41",
            "id": 0
        }
    ],
    "component": "Catalina",
    "description": "Misc grammar cleanup.\n\nIndex: RELEASE-NOTES\n===================================================================\nRCS file: /home/cvspublic/jakarta-tomcat-5/RELEASE-NOTES,v\nretrieving revision 1.2\ndiff -u -r1.2 RELEASE-NOTES\n--- RELEASE-NOTES\t4 Feb 2003 23:41:01 -0000\t1.2\n+++ RELEASE-NOTES\t15 May 2003 02:52:21 -0000\n@@ -69,7 +69,7 @@\n putting unpacked classes into a \"classes\" directory (not created by default),\n or by placing them in JAR files in the \"lib\" directory.\n \n-Tomcat 5.0 also makes available Xerces 2 to web applications.\n+Tomcat 5.0 also makes Xerces 2 available to web applications.\n \n \n --------------------------\n@@ -90,12 +90,12 @@\n Some shared libraries (many are part of the JDK) keep references to objects\n instantiated by the web application. To avoid class loading related problems\n (ClassCastExceptions, messages indicating that the classloader \n-is stopped, ...), the shared libraries state should be reinitialized.\n+is stopped, etc.), the shared libraries state should be reinitialized.\n \n-Something which could help is to avoid putting classes which would be \n+Something which might help is to avoid putting classes which would be \n referenced by a shared static field in the web application classloader, \n-and put them in the shared classloader instead (the JARs should be put in the \n-\"lib\" folder, and classes should be put in the \"classes\" folder).\n+and putting them in the shared classloader instead (JARs should be put\n+in the \"lib\" folder, and classes should be put in the \"classes\" folder).\n \n \n --------------------\n@@ -114,13 +114,13 @@\n Linux and Sun JDK 1.2.x - 1.3.x:\n -------------------------------\n \n-Virtual machine crashes can be experienced when using certain combinations of\n+Virtual machine crashes may be experienced when using certain combinations of\n kernel / glibc under Linux with Sun Hotspot 1.2 to 1.3. The crashes were \n reported to occur mostly on startup. Sun JDK 1.4 does not exhibit the problems,\n and neither does IBM JDK for Linux.\n \n-The problems can be fixed by reducing the default stack size. At bash shell, \n-do \"ulimit -s 2048\"; use \"limit stacksize 2048\" for tcsh.\n+The problems can be fixed by reducing the default stack size. From a bash shell,\n+use \"ulimit -s 2048\"; use \"limit stacksize 2048\" for tcsh.\n \n GLIBC 2.2 / Linux 2.4 users should also define an environment variable:\n export LD_ASSUME_KERNEL=2.2.5\n@@ -136,24 +136,24 @@\n disabled by default, as our goal is to provide a fully secure default \n configuration. However, CGI and SSI remain available.\n \n-On Windows:\n+To enable CGI and SSI on Windows:\n * rename the file %CATALINA_HOME%\\server\\lib\\servlets-cgi.renametojar to\n   %CATALINA_HOME%\\server\\lib\\servlets-cgi.jar.\n * rename the file %CATALINA_HOME%\\server\\lib\\servlets-ssi.renametojar to\n   %CATALINA_HOME%\\server\\lib\\servlets-ssi.jar.\n * in %CATALINA_HOME%\\conf\\web.xml, uncomment the servlet declarations starting\n-  line 165 and 213, as well as the associated servlet mappings \n-  line 265 and 274. Alternately, these servlet declarations and mappings can\n+  on lines 165 and 213, as well as the associated servlet mappings on\n+  lines 265 and 274. Alternately, these servlet declarations and mappings can\n   be added to your web application deployment descriptor.\n \n-On Unix:\n+To enable CGI and SSI on Unix:\n * rename the file $CATALINA_HOME/server/lib/servlets-cgi.renametojar to\n   $CATALINA_HOME/server/lib/servlets-cgi.jar.\n * rename the file $CATALINA_HOME/server/lib/servlets-ssi.renametojar to\n   $CATALINA_HOME/server/lib/servlets-ssi.jar.\n * in $CATALINA_HOME/conf/web.xml, uncomment the servlet declarations starting\n-  line 165 and 213, as well as the associated servlet mappings \n-  line 265 and 274. Alternately, these servlet declarations and mappings can\n+  on lines 165 and 213, as well as the associated servlet mappings\n+  on lines 265 and 274. Alternately, these servlet declarations and mappings can\n   be added to your web application deployment descriptor.\n \n \n@@ -162,7 +162,7 @@\n ---------------------\n \n The URLs to be used in the policy file to grant permissions to JARs located\n-inside the web application repositories have changed in Tomcat 5.0.\n+inside the web application repositories have changed as of Tomcat 4.1.\n \n In Tomcat 4.0, codeBase URLs for JARs loaded from web application \n repositories were:\n@@ -176,8 +176,8 @@\n Symlinking static resources:\n ---------------------------\n \n-Unix symlinks will not work when used in a web application to link resources \n-located outside the web application root directory.\n+By default, Unix symlinks will not work when used in a web application to\n+link resources located outside the web application root directory.\n \n This behavior is optional, and the \"allowLinking\" flag may be used to disable\n the check.\n@@ -188,7 +188,7 @@\n ------------------------\n \n Starting with Tomcat 4.1.12, the invoker servlet is no longer available by \n-default in all webapp. Enabling it for all webapps is possible by editing\n+default in all webapps. Enabling it for all webapps is possible by editing\n $CATALINA_HOME/conf/web.xml to uncomment the \"/servlet/*\" servlet-mapping\n definition.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "19939",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P3 minor",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Cleanup for jakarta-tomcat-5/RELEASE-NOTES",
    "systemSpecification": false,
    "version": "5.0.2"
}