{
    "comments": [
        {
            "author": null,
            "body": "The second line of the SMAP contains path information on Windows machines \nbecause SmapUtil.java's generateSmap() method calls unqualify() to remove the \npath information, and unqualify() only works on pathname strings with \"/\" as \nthe name-separator character.  I fixed this by rewriting unqualify().\n\nThe leading slash in the source path in the \"*F\" section originates deep \nwithin Tomcat (for instance, in a call to HttpServletRequest.getServletPath() \nwhen the request is first touched), so I chose to remove the leading slash \njust before writing the source path to the SMAP.\n\nI will attach a patch containing these fixes.",
            "date": "20030722T08:40:24",
            "id": 0
        },
        {
            "author": null,
            "body": "Created attachment 7441\nProposed patch",
            "date": "20030722T08:41:29",
            "id": 1
        },
        {
            "author": null,
            "body": "Applied patch with slight modification:\n\nInstead of (as suggested in the patch):\n\n  private static String unqualify(String path) {\n    File f = new File(path);\n    return f.getName();\n  }\n\nthe impl now does this:\n\n  private static String unqualify(String path) {\n    return path.substring(path.lastIndexOf(File.separator) + 1);\n  }\n\nwhich avoids generation of a File object.\n\n",
            "date": "20030805T01:17:54",
            "id": 2
        }
    ],
    "component": "Jasper",
    "description": "One of the new features of Jasper in Tomcat 5 is that it attaches a \"Source\nMap\" attribute to class files to describe the file name and line number\nmapping from a JSP source file to the generated Java source file.\n\nThe SMAP that I see in the class files generated by Jasper (5.0.3 alpha)\nhas a couple of small problems:\n\n1. The second line of the SMAP, according to JSR-45, is the name of the\n   generated source file.  This name should be without path information,\n   but path information appears in the version generated by Jasper.\n\n2. In the \"*F\" section, there's a pair of lines that defines the JSP file.\n   The second line is the source path for the JSP file.  The path created\n   by Jasper contains a leading slash, making it an absolute path.  It\n   should be relative; the leading slash should not appear.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "21168",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Incorrect paths in generated SMAP file entries",
    "systemSpecification": false,
    "version": "5.0.3"
}