{
    "comments": [
        {
            "author": null,
            "body": "Ok, I can reproduce that. I find it odd that the shutdown hook of the VM isn't\ngetting invoked. Maybe the process is abruptly killed at some point.\n\nThere are alternative ways to start Tomcat if you need a workaround for now\n(including the Java launcher from the Commons, and the plain old .bat scripts).\nI hope you like the new .exe wrapper (assuming the bugs are fixed, of course).",
            "date": "20030702T15:23:51",
            "id": 0
        },
        {
            "author": null,
            "body": "Proc runner now comes with the Java Option -Xrs preconfigured (as of TC 5.0.3). \nHowever, leaving the option out doesn't make a difference.\n\nI do like the new .exe wrapper. It's a very handy tool. ",
            "date": "20030702T15:38:13",
            "id": 1
        },
        {
            "author": null,
            "body": "Some more observation - hope it helps to pin down the problem:\nIf I start TC via proc runner and stop TC via shutdown.bat the method \ncontextDestroyed() is properly called.\n\nWindows Task-Manager:\nStopping TC via proc runner gives a peak CPU utilization of approx. 6%, the \nextra CPU utilization lasts for approx. 5 seconds.\nStopping TC via shutdown.bat gives a peak CPU utilization of 100%, the extra \nCPU utilization lasts from 15 to 35 seconds.",
            "date": "20030703T10:12:34",
            "id": 2
        },
        {
            "author": null,
            "body": "I have added some logging to org.apache.catalina.startup.Bootstrap: main() is \nnever reached on shutdown via procrun. Looks like procrun just kills the JVM. \nWhat strikes me here is that no shutdown hook gets activated. If I shutdown TC \nvia telnet (port 8005) SessionListener and ContextListener are properly \nnotified. I have no tools available to actually look what procrun does on \nshutdown. Any help is much appreciated.",
            "date": "20030801T16:50:52",
            "id": 3
        },
        {
            "author": null,
            "body": "Fixed now in the CVS, and should appear in 5.0.7.",
            "date": "20030809T02:35:36",
            "id": 4
        }
    ],
    "component": "Native:Packaging",
    "description": "The sample listener (provided with servlet-examples and jsp-examples) are not \nnotified on shutdown if TC has been started via proc runner. Starting and \nstopping via startup.bat and shutdown.bat works as expected.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "21279",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Proc Runner: No Listener Notification on Shutdown",
    "systemSpecification": true,
    "version": "5.0.5"
}