{
    "comments": [
        {
            "author": null,
            "body": "No, you shouldn't assume anything, the JNDI resource are handled fine. The\nContextConfig was resetting the application parameters, which was wrong.",
            "date": "20030719T16:17:13",
            "id": 0
        },
        {
            "author": null,
            "body": "Hi Remy,\n\nWas the fix done for just Tomcat-5 or was it also applied to the Tomcat-4.1.xx\ncodebase?  Just wondering if I can expect future versions of Tomcat-4.1.xx to\nwork properly.\n\nthanks,\n\nJake",
            "date": "20030719T18:22:12",
            "id": 1
        },
        {
            "author": null,
            "body": "The fix is currently only in Tomcat 5.\nNote: I didn't actually test the fix (but the flaw in the code was evident, and\nsimilar to previous flaws in JNDI resources handling).\n\nIf you'd like to experiment with Tomcat development, now would be the right time\nto get the sources and test the fix :)",
            "date": "20030719T18:30:30",
            "id": 2
        },
        {
            "author": null,
            "body": "I tested the fix.  It seems to work great!  I'd suggest that this fix also be\nadded to the next release of Tomcat-4.1.xx since people will be using that as\nthe stable release of Tomcat for quite a while...especially while Tomcat-5 is\nstill in alpha state (pre-servlet 2.4 release).\n\nJake",
            "date": "20030721T15:43:56",
            "id": 3
        }
    ],
    "component": "Catalina",
    "description": "I believe this was true with Tomcat-4.1.xx, but I'm posting this as a 5.x.x bug\nsince I doubt the behavior will be changed for 4.x.xx...\n\nIf one sets <Parameter> elements in a context configuration file (ccf), they\nwill be read upon webapp startup, but as soon as one stops/starts or reloads the\nwebapp via the Tomcat manager app, the prevously configured <Parameter>'s are\nnot taken into account.\n\nFor example, I have the following in my ccf...\n\n<Parameter name=\"log4j-log-home\" value=\"C:\\\" override=\"true\"/>\n<Parameter name=\"log4j-sysprop-name\" value=\"MyWebapp.log.home\" override=\"true\"/>\n\nUpon first startup, my webapp obtains this configuration information and reports...\n\nSetting system property [ MyWebapp.log.home ] to [ C:\\ ]\n\n\nwhen I reload the webapp via the Tomcat manager app, I get the following...\n\nNo System property name provided. Please set the \"log4j-sysprop-name\" context\nparameter.\n\n\nI imagine this issue also applies to setting <Environment> and other elements\nsupported by ccf's as well.\n\nIs this expected behavior?  I can't imagine it is.  I sure didn't expect it and\nit makes it difficult to configure webapps and trust that they will continue to\nstay configured througout the entirety of their deployment whether they are\nreloaded or not.\n\nJake",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "21600",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "<Parameter>'s lost after manager stop/start or reload",
    "systemSpecification": true,
    "version": "5.0.4"
}