{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 7391\nPatch to fix some Bugs at tester",
            "date": "20030719T16:29:05",
            "id": 0
        },
        {
            "author": null,
            "body": "Created attachment 7392\nBugReport",
            "date": "20030719T16:29:32",
            "id": 1
        },
        {
            "author": null,
            "body": "Created attachment 7393\nSimple Example with HttpClient to access and simulate HttpUrlConnection failure",
            "date": "20030719T16:31:16",
            "id": 2
        },
        {
            "author": null,
            "body": "Created attachment 7394\ntester build.properties for tomcat5",
            "date": "20030719T16:31:59",
            "id": 3
        },
        {
            "author": null,
            "body": "Created attachment 7395\ntester/bin/build.properties (example)",
            "date": "20030719T16:32:38",
            "id": 4
        },
        {
            "author": null,
            "body": "Ok, thanks, that's useful.\n\nThere are mistakes in the patch: the failures in the lifecycle test are real\n(but very minor) failures. I believe the JMX registration doesn't happen if the\ninit of a servlet fails, and so the new mapper (which uses JMX to update itself)\ndoesn't map the request to the servlet, which gives the 404.\nAbout the include failure: it fails because of the invoker servlet.",
            "date": "20030719T16:41:48",
            "id": 5
        },
        {
            "author": null,
            "body": "I'm in the process of applying your patches. Feel free to contribute more to the\ntester: switch to HttpClient, new tests, etc.\n\nNote: There's a socket mode in the current tester to fix the failures with 500\nand error pages (use the protocol attribute of the tester task).",
            "date": "20030719T20:02:19",
            "id": 6
        },
        {
            "author": null,
            "body": "I start to evaluate anteater with success! I now start to look deeper inside \nTestClient to migrate or getting it working.\n\nOK: I start working at the Tester Module.\n     Anteater can produce a XML Report and better Status mail\n     I want start to have a active TestSuite with CruiseControl.\n\n---\n\nAnalyse Lifecycle again and I see this at \n\n org.apache.catalina.core.StandardWrapperFacade\n  L.195\n            } else if (available == Long.MAX_VALUE) {\n                hres.sendError(HttpServletResponse.SC_NOT_FOUND,\n                           sm.getString(\"standardWrapper.notFound\",\n                                        wrapper.getName()));\nHups! It look like that all permanent Unavailable Servlets send Status 404 !\n\n",
            "date": "20030720T06:58:16",
            "id": 7
        },
        {
            "author": null,
            "body": "I'm not in favor of using yet another external tool for the tester, as it\ncurrently doesn't justify it in terms of size or complexity (in socket mode, it\nworks ok). Now if you plan to contribute a lot to it to expand it, then it's\ndifferent (as lon as the tool has an appropriate license).\n\nAs for the unavailable, I think the 404 is right if it's permanent. It seems\nlogical. I'll have to check, but I remember there was a subtelty like that\nintroduced.",
            "date": "20030720T07:40:02",
            "id": 8
        },
        {
            "author": null,
            "body": "Let us write more tests and than we look around to other tools.\n\nCan I help you to wrote more tests ?",
            "date": "20030720T13:04:50",
            "id": 9
        },
        {
            "author": null,
            "body": "Yes, sure. That kind of work could get you a committer account very fast :)\n\nI fixed the remaining failures (except one, which is JSP related), so I'm\nclosing this bug.",
            "date": "20030720T15:10:57",
            "id": 10
        }
    ],
    "component": "Tester",
    "description": "I found some bugs at tester modul at current tomcat 5 cvs 19.07.2003 state.\n\nTwo are not found:\n\nInclude Bug with RequestDesipatcher\nTesterClient based on HttpUrlConnection can't read input with Status 500 \nResponse.\n    Check with HttpClient 2.0.0 and it works in a simple env.\n\nS. Dteail Patch and Report (attached)",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "21731",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Found some bugs at tester (FIX with patch)",
    "systemSpecification": true,
    "version": "Nightly Build"
}