{
    "comments": [
        {
            "author": null,
            "body": "Confirmed. This is also an issue with TC5.\n\nThe problem is that the space character is used to delimit parameters passed \nto the perl interpreter. If the path to the perl script includes a space then \nthe interpreter assumes the path is shorter than it really is.\n\nI have posted proposed patches for TC4 and TC5 that work with Windows XP and \nshould work with NT and 2000 to the tomcat-dev list.",
            "date": "20030902T21:16:54",
            "id": 0
        },
        {
            "author": null,
            "body": "The patch has been applied to CVS for TC4 and TC5. It will be available in the \nnext release.",
            "date": "20030903T17:26:09",
            "id": 1
        }
    ],
    "component": "Servlets:CGI",
    "description": "If the Tomcat default install directory is used on Windows (NT/W2k/XP) the \ndefault name causes CGI scripts not to function. \nThe default install name for Tomcat is:\n<drive>:\\Program Files\\Apache Tomcat 4.0\\\nIn our case the install name is:\n<drive>:\\soft\\AR2\\Apache Tomcat 4.0\\\n\nIf a CGI script that uses Perl is used within this installation the result from \nthe CGI is output on the web page. The result on the web page is:\nCan't open perl script \"<drive>:\\soft\\AR2\\Apache\": No such file or directory\n\nThe message contains the installation directory name for Tomcat up to the first \nblank character. \nThe CGI path name once evaluated by Tomcat is:\n<drive>:\\soft\\AR2\\Apache Tomcat 4.0\\webapps\\adaptive\\WEB-INF\\Cgi\\exp.cgi\n\nThere does not seem to be a way to change this behaviour in the standard Tomcat \nproduct.\n\nOther information is available on request. I have the CGI script and all the \nlog files.\n\nThank you",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "22857",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Spaces in Tomcat install directory name causes CGI failure",
    "systemSpecification": true,
    "version": "Nightly Build"
}