{
    "comments": [
        {
            "author": null,
            "body": "JspC has been modified to rethrow any exception raised during compilation, so\nthat should address your problem.  Please try the nightly build for Tomcat 5 to\nsee if that's good enough for you.",
            "date": "20031211T19:08:43",
            "id": 0
        }
    ],
    "component": "Jasper",
    "description": "When using Tomcat 5.0.16's org.apache.jasper.JspC class as a taskdef Ant tag, if\nthere is a failure in compiling a JSP file into a Java file, Ant does not know\nabout it.  Ant will continue the rest of the build regardless of any JSP compile\nfailures.  It might even report success depending on the rest of the build.\n\nI would think that a failed JSP compile should halt the build similar to a\nfailed Java compile.  (Or at least have a failOnError option.)  What I see\ninstead is that any JSPs that fail to compile will cause JspC to write an error\nmessage to the logging API and write out a zero-length Java file.  Ant, however,\njust continues building after the JspC task is done.\n\nI've seen JSPs not compile for the following reasons: bug #25488, a taglib or\nJSP action tag is unbalanced, or because an include directive tries to include a\nfile that does not exist.  There are probably many other reasons a JSP would\nfail to be parsed.\n\nWorkarounds include having a human check the log output of the JspC tag for\nerror messages or do a \"find . -empty\" to find zero-length Java files.\n\nTo solve this issue I recommend having JspC.execute() throw an\norg.apache.tools.ant.BuildException on build errors.  This will work for both\nthe Ant build and when running from the commandline.  When running from the\ncommand line the main() method can catch and handle the exception appropriately.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "25452",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "JSP compile failure does not stop Ant build",
    "systemSpecification": true,
    "version": "5.0.16"
}