{
    "comments": [
        {
            "author": null,
            "body": "Further testing reveals that Tomcat will always use the JVM referenced in the\nWindows registry, regardless of the choice made during installation.  In my\ncase, this was C:\\Program Files\\Java\\j2re1.4.2_02 -- it was installed along with\nthe Java 1.4.2 SDK.  If this JVM instance does not exist on the Windows\nfilesystem, the installer will still act like everything is okay -- asking if\nyou want Tomcat to use the JDK referenced by your JAVA_HOME environment variable\n-- but when installation is complete, Tomcat *will not run*.  Tomcat needs to\nactually use the JDK that the user specifies during or after installation, and\nit needs to be able to run even if the silly JRE is not installed under\nC:\\Program Files.",
            "date": "20031217T20:25:42",
            "id": 0
        },
        {
            "author": null,
            "body": "This is fixed now in the CVS, and will appear in 5.0.17.",
            "date": "20040101T01:50:05",
            "id": 1
        }
    ],
    "component": "Native:Integration",
    "description": "I'm running Tomcat 5 on a Windows XP system with at least 6 different JDKs.  I\nhave my JAVA_HOME environment variable set to reference the default instance,\nthe one I use most often.  During the initial installation, the Tomcat installer\nasked me to point to the location of the JDK I wanted Tomcat to use, and it\npre-populated the field with the value of the JAVA_HOME variable.  This was\nfine, so I left the value alone and continued the installation.  When I checked\nthe values in the Configure Tomcat tool, I saw that the Java VM option read\nsimply \"java\" rather than the value I had seen during installation.  If I try to\nchange this value, and point to a specific Java executable from a specific JDK\nversion, Tomcat will not start up.  The process dies almost as soon as I run it,\nand it will not come back until I go into the Windows Registry and return the\nJava VM value to just \"java\".   I can find no other way to specify which Java\nversion Tomcat uses after installation, and I can't verify that it is using the\none I selected during installation.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "25599",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Cannot change the Java VM option in the Configure Tomcat utility",
    "systemSpecification": true,
    "version": "5.0.16"
}