{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 10082\nPatch for proposed enhancement",
            "date": "20040125T13:23:49",
            "id": 0
        },
        {
            "author": null,
            "body": "I think I'm ok with your patch. However I have a question: did you try to add\nthe needed resource for the transaction in a DefaultContext ?",
            "date": "20040125T13:27:56",
            "id": 1
        },
        {
            "author": null,
            "body": "No, I didn't, since in my case I have the webapps sharing the transactionmanager\ndeployed in separate services. \n\nBTW I'll attach a patch for the wrong Exception type thrown in\norg.apache.naming.NamingContext implementation. Then my other patch will not\ncreate a warning anymore.\n\n ",
            "date": "20040125T15:03:36",
            "id": 2
        },
        {
            "author": null,
            "body": "Created attachment 10083\nFixes Exception thrown when bind fails because the name is already bound",
            "date": "20040125T15:05:00",
            "id": 3
        },
        {
            "author": null,
            "body": "Fixed, thanks.",
            "date": "20040127T12:02:08",
            "id": 4
        }
    ],
    "component": "Catalina",
    "description": "currently it is not possible to use ResourceLinks to bind a UserTransaction in\nthe java:comp context of a web application because the way it is implemented\nResourceLinks are always bound in the java:comp/env context. I stumbled across\nthis because I thought it would make sense to configure my transaction manager\nonly in one place and have all my webapps access it via ResourceLinks instead of\ncopying the configuration for each webapp but that did not work. The current\nbehaviour is a little hard to understand and IMHO it doesn't hurt to treat\nResourceLinks pointing to a UserTransaction differently. I have attached a patch\nthat does this. Testing the patch I found that the Context implementation does\nnot seem to throw NameAlreadyBoundException when a name already exists and a\nbind fails (therefore after applying the patch you get a warning whenever a\nUserTransaction is bound via a ResourceLink). Shall I file this as a separate\nreport?\n\nThanks in advance",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "26414",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "P5 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "UserTransaction bound in comp/env Context when using ResourceLink",
    "systemSpecification": false,
    "version": "5.0.18"
}