{
    "comments": [
        {
            "author": null,
            "body": "I think the \"problem\" is that the servlet obsfucates lock tokens, which it has\nevery right to do (this is from memory).\nAnyway, the servlet supports WebDAV level 1, which doesn't include locking\n(which is very complex to implement completely, so is only partially implemented).\nI'll let Mark resolve this report.",
            "date": "20040220T10:23:08",
            "id": 0
        },
        {
            "author": null,
            "body": "A couple of suggestions based on the recent comment.  \n\n- If only Level 1 is supported, and locking is not supported fully, then \nperhaps a configuration option would be warranted that:\n  - Keeps the servlet from reporting that it supports: level 2 and lock \nmethods.\n  - Makes lock operations a no-op for clients that still try to lock no matter \nwhat.",
            "date": "20040220T15:23:30",
            "id": 1
        },
        {
            "author": null,
            "body": "Having had a good look through the spec I don't think that it does allow the \nlock token to be obsfucated. I am basing this opinion on the following quotes:\n- 6.3 <quote>Anyone can find out anyone else's lock token by performing lock \ndiscovery.</quote>\n- 17.3 Security through Obscurity\n<quote>\n   WebDAV provides, through the PROPFIND method, a mechanism for listing\n   the member resources of a collection.  This greatly diminishes the\n   effectiveness of security or privacy techniques that rely only on the\n   difficulty of discovering the names of network resources.  Users of\n   WebDAV servers are encouraged to use access control techniques to\n   prevent unwanted access to resources, rather than depending on the\n   relative obscurity of their resource names.\n</quote>\n\nI have just committed a patch to CVS that removes the lock obsfucation \nfunctionality. This will be included in the next release.\nIt has also been ported to TC4.",
            "date": "20040222T22:36:21",
            "id": 2
        },
        {
            "author": null,
            "body": "*** Bug 10539 has been marked as a duplicate of this bug. ***",
            "date": "20040618T23:54:07",
            "id": 3
        }
    ],
    "component": "Servlets:WebDAV",
    "description": "Tested WebDAV servlet with Dreamweaver MX and DAVExplorer.  \n\nProblem: After either client obtains a lock, they are unable to perform any \nother operations on the locked resource.  All further operations on a locked \nresource return the SC_LOCKED status.  \n\nThis is particularly troublesome for Dreamweaver because it only works by \nacquiring locks -- i.e. there is no way to use Dreamweaver + webdav without \nlocking.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "27100",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "WebDAV locking implementation incompatible with some clients.",
    "systemSpecification": true,
    "version": "5.0.19"
}