{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 10674\nTranslated source",
            "date": "20040305T10:29:37",
            "id": 0
        },
        {
            "author": null,
            "body": "Created attachment 10675\nWeb app",
            "date": "20040305T10:30:02",
            "id": 1
        },
        {
            "author": null,
            "body": "Arrgh!  The orginal JSR45 support implementation in Jasper never include inner\nclass!  :-(\n\nNote that in general, Jasper does not know about what's inside scriptlets, so it\ndoes not know about any inner classes that are defined in them.  This is likely\na WONTFIX for providing smaps for inner classes in scriptlets.  Glad you agree\nthis is not a big problem in practice.\n\nJasper does know about the inner classes it generates.  I'll see if smaps can be\nprovided for them.  Stay tuned.",
            "date": "20040305T21:22:14",
            "id": 2
        },
        {
            "author": null,
            "body": "This fixed for jasper generated class files, but not for user defined inner classes.",
            "date": "20040308T21:32:15",
            "id": 3
        }
    ],
    "component": "Jasper",
    "description": "See attached application and attached translated class files. There's an inner\nclass defined in the JSP - it's class file does not contain the\nSourceDebugExtension attribute. The mappings are defined in the outer class\nfile, but it's not correct and cannot be used through JDI - it's not possible to\nretrieve the mappings for the inner class in this case.\nI wouldn't consider this a very big problem for JSPs at all, but it is a problem\nfor tag files that do generate some inner classes and it's not possible to debug\ntag files at all on JSP level.\n\nI'm enclosing a snippet of email discussion with Robert Field (I actually\nconsidered this to be a JDK bug at first):\n\n\"Someone should verify that there is no SourceDebugExtension on the inner class\nfirst.  If there is and we aren't using it that would be our problem.\"\n\n\"If there is no JSP stratum (no SourceDebugExtension in the class file) that\nsounds like a JSP bug.\"\n\n-Robert",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "27469",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "P3 major",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "SourceDebugExtension attribute not present in inner-class classfile",
    "systemSpecification": true,
    "version": "5.0.19"
}