{
    "comments": [
        {
            "author": null,
            "body": "I don't agree with that interpretation.",
            "date": "20040308T15:24:58",
            "id": 0
        },
        {
            "author": null,
            "body": "What do you exectly think?",
            "date": "20040308T15:33:11",
            "id": 1
        },
        {
            "author": null,
            "body": "There is part of the specification:\n\nJSP.4.1\n...\nFor JSP pages in standard syntax, the page character encoding is determined from\nthe following sources:\n-A JSP configuration element page-encoding value whose URL pattern matches the page.\n-The pageEncoding attribute of the page directive of the page. It is a\ntranslation- time error to name different encodings in the pageEncoding\nattribute of the page directive of a JSP page and in a JSP configuration element\nwhose URL pattern matches the page.\n- The charset value of the contentType attribute of the page directive. This is\nused to determine the page character encoding if neither a JSP configuration\nelement page-encoding nor the pageEncoding attribute are provided.\n- If none of the above is provided, ISO-8859-1 is used as the default character\nencoding.\n\n\n\n\nAppendix JSP.D\nPage Encoding Detection\n....\n\n3. If the file is a JSP page in standard syntax, use these steps. \n\na. Check whether there is a JSP configuration element <page-encoding> whose URL\npattern matches this file. \n\nb. Read the file using the initial encoding and search for a pageEncoding\nattribute in a page declaration. The specification requires the attribute to be\nfound only if it is not preceded by non-ASCII characters, so simplified\nimplementations are allowed. \n\nc. Report an error if there are a <page-encoding> configuration element whose\nURL pattern matches this file and a pageEncoding attribute, and the two name\ndifferent encodings. \n\nd. If there is a <page-encoding> configuration element whose URL pattern matches\nthis file, the page character encoding is the one named in this element. \n\ne. Otherwise, if there is a pageEncoding attribute, the page character encoding\nis the one named in this attribute. \n\nf. Otherwise, read the file using the initial encoding and search for a charset\nvalue within a contentType attribute in a page declaration. If it exists, the\npage character encoding is the one named in this charset value. The\nspecification requires the attribute to be found only if it is not preceded by\nnon-ASCII characters, so simplified implementations are allowed. \n\ng. Otherwise, the page character encoding is ISO-8859-1.",
            "date": "20040308T15:42:25",
            "id": 2
        },
        {
            "author": null,
            "body": "I think that:\n- you have way too much time on your hands\n- charset and pageEncoding define the same thing, so this is at best an issue of\npriority",
            "date": "20040308T16:05:02",
            "id": 3
        },
        {
            "author": null,
            "body": "I don't think so, that pageEncoding and charset define the same thing.\n\nAccording to chapter \"JSP.4.1 Page Character Encoding\" the pageEncoding is for\nencoding the page file itself. And according to chapter \"JSP.4.2 Response\nCharacter Encoding\" the charset encoding is used for responds. When both\nencoding are defined, then they are used for different things.",
            "date": "20040308T17:19:40",
            "id": 4
        },
        {
            "author": null,
            "body": "Yes, of course. We have a disagreement then (sec 1.10.1). If nobody fixes this\nhorrible \"bug\" for a while, then I will resolve it appropriately.",
            "date": "20040308T17:39:05",
            "id": 5
        },
        {
            "author": null,
            "body": "Hi Petr,\n\nyou're right, this is a bug. I'll commit a patch shortly.\n\nFor the time being, as a workaround, you may want to collapse the 2 page\ndirectives into a single page directive, like this:\n\n<%@page contentType=\"text/html;charset=ISO-8859-2\" pageEncoding=\"UTF-8\"%>\n\nJan",
            "date": "20040308T17:55:29",
            "id": 6
        },
        {
            "author": null,
            "body": "Hi Jan,\n\nyes, it's workaround, but people can have some problems during saving or opening\njsp files in the jsp editor in NetBeans IDE. We use jasper-compiler.jar for\nobtaining information about a jsp and the encoding is one of them. I'm\nappreciate the  promiss of  fixing it.\n\nthanks\n\nPetr ",
            "date": "20040308T18:27:10",
            "id": 7
        },
        {
            "author": null,
            "body": "Thanks for the quick fix. \n",
            "date": "20040309T10:26:50",
            "id": 8
        },
        {
            "author": null,
            "body": "*** Bug 29342 has been marked as a duplicate of this bug. ***",
            "date": "20040603T16:43:14",
            "id": 9
        }
    ],
    "component": "Catalina",
    "description": "When you have jsp page saved in encoding UTF-8:\n\n<%@page contentType=\"text/html;charset=ISO-8859-2\"%>\n<%@page pageEncoding=\"UTF-8\"%>\n<html>\n<head><title>JSP Page</title></head>\n<body>\něššěřčžřžřýýáýžýí\n<br><hr>\n</body>\n</html>\n\nthen the jsp file is read with ISO-8859-2 encoding. There are wrong Czech\ncharacters in the generated servlet.  But according to the JSP 2.0 specification\nthe file should be read with encoding from pageEncodintg (UTF-8 in my case) and\nthe responds has to be in charset value encoding ( ISO-8859-2).\n\nWe used the jasper-compiler.jar as jsp parser in NetBeans and we use the result\nof the parsing for saving and loading jsp files into the editor, where the wrong\nvalue of encoding causes problems.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "27517",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P3 minor",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "The pageEncoding attribute is not used, when charset value is set.",
    "systemSpecification": true,
    "version": "5.0.19"
}