{
    "comments": [
        {
            "author": null,
            "body": "You can achieve it the other (simpler, imho) way round. Provided that you have\nthe table containing user data (username, password) as well as its status (say\nlocked), All you have to do is to create a view selecting only unlocked account\ntable rows and make your DataSourceRealm use this view instead of the table. \n\nI see no point in bloating DSR with user-specific/app-specific functionality.",
            "date": "20040518T08:04:56",
            "id": 0
        },
        {
            "author": null,
            "body": "As you say, providing a view will provide some of the required function without\ncode modification. The problem is that if the users fails authentication the\ncounter must be increased, if the users passes authentication the counter is\nzeroed. That may be possible in a view but I can't see how to do it.\n\nThis is not a request for user-specific code to be placed in DSR. It is simply\nan enhancement request to change method visibility from private to protected.\nThis will not 'bloat' the code space.\n\nClasses are often used in ways the original designer did not cater for. In\nattempting to reuse the functionality of DSR through subclassing, problems were\nencountered. Because methods such as open, close & credentials were private they\nhad to be re-implemented in the subclass even though they were direct copies of\nthe superclass implementations. The authenticate(x2 params) method had to be\ncopied because it relied on the private authenticate(x3 params).\n\nChanging the visibility will mean that app-specific subclasses can simply\noverride authenticate(x3). Surely this level of reuse is desirable?",
            "date": "20040518T10:57:39",
            "id": 1
        },
        {
            "author": null,
            "body": "I like this request, and we do want to encourage such extension, especially for \nsuch a good use-case.  Please send a diff patch against the class with your \ndesired changes.",
            "date": "20040526T19:52:19",
            "id": 2
        },
        {
            "author": null,
            "body": "Made authenticate, open, and close methods protected instead of private.",
            "date": "20040604T13:52:34",
            "id": 3
        }
    ],
    "component": "Catalina",
    "description": "My problem is this. I need to modify the DataSourceRealm so that failed login \nattempts are recorded and an account gets locked after a certain number of \nlogin failures.\n\nI want to subclass the DataSourceRealm but unfortunately some of the key \nmethods, authenticate(x3 params), open and close are declared private. The app \nis to be deployed at a commercial ISP so changing the DatSourceRealm class \ndirectly isn't a possibility. I intend to copy the class and make the \nappropriate changes as a sibling but it would have been preferable to just \noverride these methods.\n\nI would request that the permissions on useful methods in the \norg.apache.catalina.realm.DataSourceRealm be modified from private to protected \nto make future changes easier. I am more than happy to do these changes myself \nand send the modified class to you.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "29048",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "RFE",
    "priority": "P3 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Request changes to java permissions in DataSourceRealm",
    "systemSpecification": true,
    "version": "5.0.19"
}