{
    "comments": [
        {
            "author": null,
            "body": "and now, even that I have deployOnStartup=\"false\" unpackWARs=\"false\"\nautoDeploy=\"false\" liveDeploy=\"false\"\nfor each Host element, it still seems to deploy on startup.sh .\nI assume the reason for this is that in the web.xml, I use the tag\n\"load-on-startup\" . If this is correct, I assume this should be mentioned as well!",
            "date": "20040524T12:34:01",
            "id": 0
        },
        {
            "author": null,
            "body": "I think the documentation is good enough (and I really hate whines ...).",
            "date": "20040524T21:26:50",
            "id": 1
        },
        {
            "author": null,
            "body": "Since there is no DTD for the server.xml as per the faq\nhttp://jakarta.apache.org/tomcat/faq/misc.html#dtd i.e. is there a way other\nthan going through the source code where I can see whether the \"liveDeploy\" is\nstill valid and what it would do under tomcat 5?\n\nhttp://www.onjava.com/pub/a/onjava/2004/01/28/tomcat5.html?page=last appears to\nsuggest that liveDeploy no longer exists, but then I would expect a stackdump\ncomplaining about this when doing bin/startup.sh",
            "date": "20040525T04:47:30",
            "id": 2
        },
        {
            "author": null,
            "body": "You should adjust your expectations regarding the stack dump or complaints \nabout unknown elements when it comes to parsing tomcat's server.xml.  You won't \nget any such stack dumps or warning messages, because:\n- There's no DTD/schema to validate server.xml, as you noted, and\n- We use Digester to scan for predefined patterns and attributes only, so \nunknown ones are simply ignored\n\nIf you find the documentation insufficient, please provide patches that are \nactual diff files, rather than general complaints.  We will gladly evaluate and \napply them as needed.\n\nThe source code is easy to download, and you can grep it for \"liveDeploy\" \nor \"autoDeploy\" to see exactly what the relevant code does.  If something is in \nthe code, then it's in the docs.  If it's not in the docs, it's irrelevant in \nthe code.\n",
            "date": "20040526T17:23:42",
            "id": 3
        },
        {
            "author": null,
            "body": "I'm closing this issue based on personal communication with Mr. Hauser.  \n\nMy invitation to submit documentation enhancements, and my promise to review \nand commit them quickly into our repository and web site, still stands.  Your \ncontributions would be very welcome and highly appreciated.\n",
            "date": "20040601T13:31:07",
            "id": 4
        }
    ],
    "component": "Catalina",
    "description": "coming from 4.1.27, my server.xml had a 3 host tags with each an\nunpackWARs=\"false\" autoDeploy=\"false\" liveDeploy=\"false\" setting and each a .war\nfile. All war files in the same directory.\nWith 5.0.24, it started to deploy 3*3, i.e. 9 times instead of only 3 like before.\n\nIt appears that liveDeploy is not longer used and now called autoDeploy?\nIf so, shouldn't the server.xml parser complain about this unknown attribute?\n\nSimilarly, autoDeploy appears now to be deployOnStartup? If so, it might be\nuseful to add a note in this respect in the description box for each of the two!",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "29174",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "complain about liveDeploy tags and enhance documentation of deployOnStartup",
    "systemSpecification": true,
    "version": "5.0.24"
}