{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 12014\ntest app with instructions to reproduce the bug",
            "date": "20040702T15:00:53",
            "id": 0
        },
        {
            "author": null,
            "body": "I'm adding a patch that works around the problem by not allowing the recursive\ndependency to be added to the page. This is rather dealing with the symptoms\nthan a good solution but it solves and might help to illustrate my current problem.",
            "date": "20040706T10:21:44",
            "id": 1
        },
        {
            "author": null,
            "body": "I don't see any patch.  Anyway, not allowing recursive dependencies to be added\nto the page actually works, and is the simplest solution.  Fixed in CVS.\n\nThanks for reporting this bug.",
            "date": "20040713T22:53:15",
            "id": 2
        },
        {
            "author": null,
            "body": "Oops, obviously forgot to upload the patch. Your fix makes absolute sense.\nThanks for yet another quick reaction!",
            "date": "20040716T11:36:52",
            "id": 3
        },
        {
            "author": null,
            "body": "*** Bug 31382 has been marked as a duplicate of this bug. ***",
            "date": "20041014T17:16:39",
            "id": 4
        },
        {
            "author": null,
            "body": "There is still a problem with recompiling recursive tag file, but not with\nArgen's test case from 31382.  The problem occurs only for indiret recursive tag\nfiles (t.tag uses t2.tag which use t.tag), and it occurs not during dependency\nchecking, but in the JSP compilation itself.\n\nThis is now fixed in CVS.  Thanks for being persistent. :)",
            "date": "20041014T23:58:47",
            "id": 5
        }
    ],
    "component": "Jasper",
    "description": "Recursive Tag files modification check causes StackOverflowError presumably\nbecause a tag file making use of itself is added to the list of its dependents,\ncausing the modification check to loop infinitely. See attached test case.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "29887",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P3 minor",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Recursive Tag files modification check causes StackOverflowError",
    "systemSpecification": false,
    "version": "5.0.25"
}