{
    "comments": [
        {
            "author": null,
            "body": "OK, added compilerTargetVM option to JspServlet and JspC.",
            "date": "20040902T16:10:07",
            "id": 0
        },
        {
            "author": null,
            "body": "Based on mu recent experience, javac params source and target are interrelated.\nFor example, the default source version for the 5.0 RC b63 is 1.5 which implies\n1.5 as a target. For example using ant 1.6.2 on j2sdk1.5 (hell, cannot get used\nto switching to 5.0, either can Sun, I suppose ;) the following\n\n<javac target=\"1.4\" ... /> \n\nresults in:\n\n [javac] javac: target release 1.4 conflicts with default source release 1.5\n\nProviding source attribute to ant's javac task forces compiler to downgrade to\n1.4 sources.\n\n<javac target=\"1.4\" source=\"1.4\" ... /> \n\nI'd be more than delighted if you could also provide the source parameter in the\nsame manner as you have done with the compilerTargetVM. BTW, I have no idea if\nthis also affects JDT. ",
            "date": "20040903T10:36:13",
            "id": 1
        },
        {
            "author": null,
            "body": "We're waiting for your patches :)",
            "date": "20040903T11:04:24",
            "id": 2
        },
        {
            "author": null,
            "body": "Yes, this also affects JDT.  And please do NOT reopen one issue to ask for \nsomething else to be done, even if it's related.",
            "date": "20040903T17:55:13",
            "id": 3
        },
        {
            "author": null,
            "body": "The reason why I reopened was the fact that the solution you provided\n*partially* works. What I wanted to point out is the fact that the \"target\"\nparameter alone seems not to be sufficient. Sorry for reopening but I still\nconsider adding \"source\" parameter is essential for this very enhancement to be\nfully functional. My bad I haven't indicated it in my initial submission. ",
            "date": "20040904T07:21:14",
            "id": 4
        }
    ],
    "component": "Jasper",
    "description": "I installed Tomcat 5.0.28 on W2K box. During installation I provided path to\nj2sdk 5.0 beta 3 build 60, therefore tools.jar has been taken from this\nparticular distro. After that I had been forced to switch JVM to IBM's 1.4.1\n(WebSphere 5.1 AppClient). Tomcat starts with no problem, however, Jasper\ncompiles JSP with javac from tools.jar (jvm 5.0 compliant) and makes compiled\nclasses unusable for the 1.4.1 jvm. \n\nThe simplest workaround is to overwrite tools.jar with the one that comes with\nthe jdk that tomcat is run on.  However, the simple solution is to provide the\n\"target\" parameter to JspServlet and pass it along to ant javac compiler. \n\n...Yes, I know we're going to get rid of ant compiler... ;) BTW, I wonder which\nversion of classes JDT will produce. Maybe this also should be up to the user to\ndecide?",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "30984",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "P3 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Add an ability to compile JSPs to specified target JVM",
    "systemSpecification": true,
    "version": "5.0.28"
}