{
    "comments": [
        {
            "author": null,
            "body": "Turn off autoDeploy and this won't happen.  It's not a Tomcat bug, merely a \nconfiguration issue.",
            "date": "20040917T15:27:37",
            "id": 0
        },
        {
            "author": null,
            "body": "I did have the flag autoDeploy set to false but your comment pointed me in the \nright direction. The flag that needs turning off is in fact deployOnStartup. So \nthe host element needs to be:\n<Host name=\"localhost\" debug=\"0\" appBase=\"webapps\" unpackWARs=\"false\" \nautoDeploy=\"false\" deployOnStartup=\"false\">\n\nI think there is still an issue around the documentation. The help on Automatic \nApplication Deployment is misleading (http://jakarta.apache.org/tomcat/tomcat-\n5.0-doc/config/host.html#Automatic%20Application%20Deployment).\n\n1. I think the first action happens even when deployOnStartup is false - I \ndidn't try this attribute because I thought it would stop things deploying on \nstartup but it doesn't. Actually it solves the problem I was having by only \ndeploying things from context files in \n$CATALINA_HOME/conf/[engine_name]/[host_name], but doesn't deploy things from \nappBase.\n2. Should the second action read \"Any web application archive file <ins>within \nthe application base directory</ins> that does not have a corresponding \ndirectory of the same name...\"\n3. The paragraph starting \"In addition to the automatic deployment\" doesn't \nmention the attribute \"autoDeploy\" but I think this is what it is referring to.\n4. The last paragraph starting \"When using automatic deployment,\" doesn't \nreflect the fact that if you upload a war file, the docBase attribute is \nignored and the file goes in the appBase directory. Hence you get double \ndeployment on restart unless you disable deployOnStartup\n\nI accept that this was in fact a configuration issue but hopefully the \ndocumentation can be made clearer.\n\nThanks",
            "date": "20040920T09:38:52",
            "id": 1
        },
        {
            "author": null,
            "body": "OK, doc clarified (for 5.0.29 and 5.5.3).",
            "date": "20040920T18:31:13",
            "id": 2
        }
    ],
    "component": "Webapps:Documentation",
    "description": "If you upload a war file using the HTML manager interface it places the war \nfile in the webapps directory. It also extracts the context.xml file and places \nthis in conf/Catalina/localhost using the war file to generate the new \nfilename. So if the war file is called MyApp.war, the context file is \nMyApp.xml. So far, so good.\n\nIf the context file declares the path to be \"/myapp\" the application is \ndeployed in the context /myapp.\n\nNow, if you restart the server you get two instances of your application. One \nbecause of the MyApp.war file in webapps - this is deployed as /MyApp. The \nsecond is due to the context file (MyApp.xml) but this deploys as /myapp.\n\nI don't know what the correct behaviour should be but the restriction is that \nyour path must be the same as the war filename.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "31277",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Applciation deployed twice after restart if path doesn't match war filename",
    "systemSpecification": true,
    "version": "5.0.28"
}