{
    "comments": [
        {
            "author": null,
            "body": "The reason for the seemly extra character in out.write() is that the java file\nJasper generated is defaulted to utf8 encoding (0xa9 is 0xc2a9 in utf8). \nHowever, you cannot just set the Jasper option javaEncoding to ISO-5589-1,\nbecause you'll then also need to set a javac option to use the same encoding,\nand  currently you cannot change the javac source encoding.\n\nLooks like the only way for this to work is to use urt8 for both the page and\nthe response.  :(",
            "date": "20041002T01:36:20",
            "id": 0
        },
        {
            "author": null,
            "body": "On second thought, what I said wasn't entirely correct.  :(\n\nJasper is still correct to output the bytes 0xc2a9 because of the difference in\nencoding.  However, druing javac compilation, these bytes should be translated\nback to the original 0xa9, and everything should be OK.  The problem seems to be\nin the JDT compiler, or its setup codes.\n\nAs a work around, use ant compilation to use JDK 1.4 javac. ",
            "date": "20041004T19:14:35",
            "id": 1
        },
        {
            "author": null,
            "body": "I have a fix for this that I will commit very shortly. I came across whilst \nlooking at another bug.",
            "date": "20041004T19:35:52",
            "id": 2
        },
        {
            "author": null,
            "body": "Patch committed and verified.",
            "date": "20041004T19:48:35",
            "id": 3
        }
    ],
    "component": "Jasper",
    "description": "I have the following text in a JSP with no encoding declared:\n\nCopyright © 2003 by \n\nThe copyright symbol does not come out correctly. I checked the file and the \nstored character code is 0xA9 which is correct for ISO-8859-1. I checked the \nJSP 2.0 spec and the default encoding is still supposed to be ISO-8859-1. Yet \nthe result is\n\nCopyright Â© 2003 by\n\nThis can be easily reproduced by creating an empty web application and putting \njust Copyright © 2003 by into a jsp file.\n\nLooking at the generated Java file I see\n\n      out.write(\"Copyright Â© 2003 by\\r\\n\");",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "31465",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "JSP encoding is wrong",
    "systemSpecification": true,
    "version": "5.5.2"
}