{
    "comments": [
        {
            "author": null,
            "body": "You are welcome to submit pacthes ;-). But it's celarly a user errors, so\nchaning this to an Enhancement.\n\n-- Jeanfrancois",
            "date": "20041012T15:17:17",
            "id": 0
        },
        {
            "author": null,
            "body": "Agreed - using a 2.4 feature in a 2.3 file is clearly a user error.  However, \nshould tomcat not throw an exception when it sees a tag in web.xml that is not \ndefined in its DTD?  Tomcat is usually very strict at reporting problems in \nweb.xml, which is a very useful feature, this is partly why I reported this \nproblem.\n",
            "date": "20041012T15:26:08",
            "id": 1
        },
        {
            "author": null,
            "body": "Please delete/ignore my last comment above - I added it to the wrong bug \nreport :)",
            "date": "20041012T15:28:42",
            "id": 2
        },
        {
            "author": null,
            "body": "I'll take a look at making the web.xml files all use the same schema (the 2.4 \none).  But Tomcat doesn't validate and won't validate your web.xml files for \nyou: use a validator for that.  Or submit your own enhancement patch to be \nconsidered.",
            "date": "20041025T18:42:47",
            "id": 3
        },
        {
            "author": null,
            "body": "Done for Tomcat 5.0.30 and 5.5.4.",
            "date": "20041025T19:02:42",
            "id": 4
        }
    ],
    "component": "Catalina",
    "description": "There are a number of web.xml files bundled with the tomcat binary installer.  \nTheir headers are however a mixture of different versions - some are v2.3 and \nsome are v2.4.  This has led me to make errors.  For example I accidentally \nbased a web.xml file on a 2.3 DTD and then used the 2.4 feature <include-\nprelude> within it, which was then silently ignored (see report 31670).\n\nI appreciate that 2.3 is still valid, and it is useful to distribute examples \nof each version. \n\nI'd like to suggest making all bundled web.xml files the latest version \ncurrently (2.4) but include the 2.3 headers commented out?  That way, people \ncan clearly see the choice they are making, but can use all the new features \nwithout worrying about \"upgrading\" the bundled web.xml examples.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "31671",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "P3 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "web.xml files are mix of 2.3 and 2.4 DTD",
    "systemSpecification": true,
    "version": "5.0.28"
}