{
    "comments": [
        {
            "author": null,
            "body": "antiJARLocking (be careful about case) is not completely foolproof. Use\nantiResourceLocking if you want true hotdeploy, but it's a lot more expensive in\nterms of webapp startup time.\n\nPlease verify if mail.jar is actually locked (= try to delete it manually).",
            "date": "20041012T21:31:38",
            "id": 0
        },
        {
            "author": null,
            "body": "The jar could not be deleted. I did have the case correct (antiJARLocking).\n\nI also tried antiResourceLocking but got very strange results. mail.jar was\nstill locked and when I stopped Tomcat the manager and admin webapps got\ndeleted!!! This might be correct as I manually added the contexts for admin and\nmanager into server.xml which I know I'm not supposed to do now.",
            "date": "20041012T21:49:14",
            "id": 1
        },
        {
            "author": null,
            "body": "I did test it, and I think you are not being very constructive in your comments.\nTested with Struts' example webapp, precompiled, deployed and undeployed using\nthe Tomcat deployer (which uses the Ant tasks), with both antiJARLocking and\nantiResourceLocking (which both do deployment where expected). Without one of\nthese two options, some JARs remain, which is to be expected.\n\nPlease don't reopen this report.",
            "date": "20041012T22:02:24",
            "id": 2
        },
        {
            "author": null,
            "body": "Sorry Remy, this was my fault. I didn't have a temp directory in my base\ndirectory. But not having the temp dir really broke things though, so I have\nreopened the bug with a suggestion that a message is logged and/or the temp dir\nis created if it doesn't exist.",
            "date": "20041019T21:34:37",
            "id": 3
        },
        {
            "author": null,
            "body": "Tomcat ships with the work dir created.  The code already tries to create it if \nnot already created.  I've added a warning to be logged if the work dir for a \ncontext cannot be determined or accessed.",
            "date": "20041025T19:11:15",
            "id": 4
        },
        {
            "author": null,
            "body": "Sorry I was talking about the temp directory (java.io.tmpdir I think). Could the\nsame be done for the temp directory which is separate from the work directory\nbut is required for the antiJARLocking and antiResourceLocking flags. It would\nbe good if they both worked the same way. Cheers.",
            "date": "20041026T14:58:12",
            "id": 5
        },
        {
            "author": null,
            "body": "No.  Java.io.tmpdir is up to server administration control, not Tomcat's.  It's \nassumed to be configured properly and cannot typically be created due to \npermissions on the server.",
            "date": "20041026T15:02:55",
            "id": 6
        },
        {
            "author": null,
            "body": "Further, if you want to try and come up with a patch that does it, please do so \nand post it to the tomcat-dev mailing list please so that we can discuss the \nissue, rather than reopening this Bugzilla issue a third time.  It has to work \nunder a SecurityManager as well.",
            "date": "20041026T15:03:36",
            "id": 7
        },
        {
            "author": null,
            "body": "I've added a warning message for the tempdir thing, and that's all that will be\ndone.",
            "date": "20041026T15:06:34",
            "id": 8
        },
        {
            "author": null,
            "body": "I wasn't too sure about creating of the temp dir, I thought it might not be\npossible or a good idea. I think a warning message is fine. Cheers.",
            "date": "20041026T16:09:51",
            "id": 9
        }
    ],
    "component": "Webapps:Manager",
    "description": "Have tested whether Bug 29526 is fixed for 5.5.3, but an undeploy still leaves\nmail.jar in the lib directory. Everything else is deleted. antijARLocking was\nset to true in conf/context.xml.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "31677",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "P5 minor",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Cannot undeploy and deploy war file with on the same context",
    "systemSpecification": true,
    "version": "5.5.3"
}