{
    "comments": [
        {
            "author": null,
            "body": "I looked in MessageDigest, and indeed, it is not thread safe. Problems are very\nunlikely to occur, though.",
            "date": "20041112T10:30:51",
            "id": 0
        },
        {
            "author": null,
            "body": "As far as I can see DigestAuthenticator only ever wants\na digested AND encoded String given a String.\n\nIt might simplify the code to factor out the synchronize+digest+encode\ninto another utility method in MD5Encoder that accepts single \nString parameter and returns an encoded MD5 digest String result. \nThis method would synchronize on its MessageDigest.\n\nAddition to MD5Encoder could be something like:\n\n\tprivate static MessageDigest md5Helper;\n\n\tstatic {\n\t\ttry {\n\t\t\tif (md5Helper == null)\n\t\t\t\tmd5Helper = MessageDigest.getInstance(\"MD5\");\n\t\t} catch (NoSuchAlgorithmException e) {\n\t\t\tthrow new IllegalStateException();\n\t\t}\n\t}\n\t\n\tpublic String digestAndEncode(String p) {\n\t    synchronized (md5Helper) {\n\t        return encode(md5Helper.digest(p.getBytes()));\n\t    }\n\t}\n\nSorry for lack of a proper patch but Ive not got proper setup at moment.\n",
            "date": "20041120T18:21:18",
            "id": 1
        },
        {
            "author": null,
            "body": "Checked nightly build and there are other places where this bug could rear it's ugly head:\n1. RealmBase\n2. org.apache.catalina.servlets.WebdavServlet\n\n",
            "date": "20041208T22:28:37",
            "id": 2
        },
        {
            "author": null,
            "body": "Created attachment 13686\nRealmBase patch",
            "date": "20041208T22:29:14",
            "id": 3
        },
        {
            "author": null,
            "body": "The issue is rare, but possible, and I like this patch because it's small, and \nsafe.  The performance impact is negligible.  So I'll go ahead and commit it \nfor RealmBase -- thanks for submitting it.\n\nWebDAV is a bit of a different story: it's not nearly as much of a concern, \njust a little lightweight implementation not subject to highly concurrent use.\n\nDone for 5.0.31, doing 5.5.6 next.",
            "date": "20041209T14:54:02",
            "id": 4
        }
    ],
    "component": "Catalina",
    "description": "Static use of java.security.MessageDigest is not thread-safe. A symptom of this bug would be \"random\" \n401 responses to Digest Authentication challenges. The static declaration:\nprotected static MessageDigest md5Helper;\n\nThe  use of this idiom in the DigestAuthenticator (and RealmBase) class means that all threads are \neffectively using the same instance of the MessageDigest. Highly concurrent testing showed this defect. \nIn reviewing the java docs for MessageDigest, there is nothing that indicates that it is thread-safe. \n\nThere are two solutions, either create a wrapper class which synchronizes access, or create new \ninstances when needed. For performance reasons it would probably be a good idea to create a wrapper \nclass as creating new instances can be expensive.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "32137",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P3 major",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Random \"401\" responses for Digest - DigestAuthenticator thread un-safe use of MessageDigest",
    "systemSpecification": true,
    "version": "5.0.29"
}