{
    "comments": [
        {
            "author": null,
            "body": "I'll look at it, but using deploy and undeploy. install and remove are\ndeprecated and unsupported.",
            "date": "20041216T13:50:52",
            "id": 0
        },
        {
            "author": null,
            "body": "undeploy had a defect in this case, so I fixed it.\nremove will now simply call undeploy. install already calls deploy.",
            "date": "20041216T17:05:18",
            "id": 1
        },
        {
            "author": null,
            "body": "*** Bug 32831 has been marked as a duplicate of this bug. ***",
            "date": "20041223T15:58:37",
            "id": 2
        }
    ],
    "component": "Unknown",
    "description": "To reproduce: introduce a typo in the web-app/servlet-mapping/servlet-name element of a web.xml of \na working app, so that a url-pattern is mapped to an undefined servlet.  Run \"ant install\".  Although \nAnt reports a successful build, there will be a number of exceptions reported in catalina.out (including \n\"IllegalArgumentException: Servlet mapping specifies an unknown servlet name ...\"), and the webapp \nwon't work.  \n\nAttempts to undeploy the broken web-app using \"ant remove\" or the HTML manager then fail, \nwith complaints that the app hasn't been started (\"LifecycleException\").  The commands \"ant install\" and \n\"ant reload\" also fail, reporting that the \"Application already exists at path ...\" and \"[app] has not been \nstarted\", respectively.  It seems the only way out is to delete the webapp from the filesystem by \nhand.\n\nI expect it should not be possible to partially deploy a webapp, even if it is misconfigured.  Either the \ndeployTask should delete from webapps an app that couldn't be started, or the UndeployTask should \nallow such an app to be removed.\n\nI am using Ant 1.6.2.  My build.xml and web.xml closely resemble the examples given in the \ndocumentation.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "32729",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Can deploy but not undeploy improperly configured webapps",
    "systemSpecification": true,
    "version": "5.5.4"
}