{
    "comments": [
        {
            "author": null,
            "body": "I confirm. This also happens to me.",
            "date": "20050127T10:25:12",
            "id": 0
        },
        {
            "author": null,
            "body": "I agree with this patch and would like to do this, but I'm not sure how to check\nfor admin privileges on startup for this service.  If someone provides a patch,\nI'll be glad to apply and test it.",
            "date": "20050728T16:10:18",
            "id": 1
        },
        {
            "author": null,
            "body": "Guessing at correct OS. Since this is an enhancement, marking it as such.",
            "date": "20060830T03:08:40",
            "id": 2
        },
        {
            "author": null,
            "body": "Moved to https://issues.apache.org/jira/browse/DAEMON-210",
            "date": "20110623T14:15:56",
            "id": 3
        },
        {
            "author": null,
            "body": "This is actually Tomcat installer problem.\nIt should install the manager autostart for current user only.\n\nWe cannot silently exit the manager because this would also cause\nthe silent exit when the user logs in and clicks on the manager application manually.",
            "date": "20110623T15:43:23",
            "id": 4
        },
        {
            "author": null,
            "body": "Installing it for the current user feels wrong to me. What if there are several Admins?\n\n\nAnyway, as a first step, installing it could be made optional. Interested users can always copy its shortcut into their \"Startup\" menu folder.\n\nWould it be better to always install it as \"Startup\" menu shortcut, instead of using the \"Run\" branch in the registry?",
            "date": "20110623T18:06:07",
            "id": 5
        },
        {
            "author": null,
            "body": "I was planning on tackling this along with bug 40510. i.e., make this use HKCU and then add an option to install for current or all users.\n\nMoving entries from the registry to the start-up folder wasn't part of that plan at the moment but might be considered if it makes bug 50949 easier to fix.",
            "date": "20110623T18:18:14",
            "id": 6
        },
        {
            "author": null,
            "body": "Fixed in 7.0.x for 7.0.17 onwards.\n\nWill be proposed for back-port as a package once the fixes for bug 40510 and bug 50949 are complete.",
            "date": "20110623T18:28:25",
            "id": 7
        },
        {
            "author": null,
            "body": "This has been proposed for back-port to 5.5.x and 6.0.x.",
            "date": "20110624T18:57:05",
            "id": 8
        },
        {
            "author": null,
            "body": "This has been fixed in 6.0.x and 5.5.x.\n\nIt is included in 6.0.33 onwards and will be included in 5.5.34 onwards.",
            "date": "20110822T15:55:43",
            "id": 9
        }
    ],
    "component": "Native:Integration",
    "description": "I am running as a Power User and I can't start SM. It complains \"Application\nSystem Error. Access is denied. Unable to open the Service Manager. [OK]\"\nService Manager is autostarting from\n\"HKLM/Software/Microsoft/Windows/CurrentVersion/Run\", wich means it will be\nstarted at each logon, for all the users. There are users who might not have the\nright to control services. The solutions as I see it is that tomcat5w.exe should\ngraciously and silently exit if the user has no right to use it.\nPS. I have only this machine and I am not really sure that my error message\nisn't due to another causes. Those who know the source code might confirm or\ninfirm if tomcat5w isn't already working as requested.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "33262",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "RFE",
    "priority": "P2 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Service Manager autostart should check for administrative rights",
    "systemSpecification": true,
    "version": "5.5.4"
}