{
    "comments": [
        {
            "author": null,
            "body": "/s has been implemented long ago (in theory).",
            "date": "20050202T12:17:04",
            "id": 0
        },
        {
            "author": null,
            "body": "It still presents a dialog box to the user asking if everything under tomcat\nshould be removed. This dialog box should be avoided by some command line options.",
            "date": "20050202T12:20:54",
            "id": 1
        },
        {
            "author": null,
            "body": "It's /S, and 5.5.7 works great. Please do not reopen the report.",
            "date": "20050202T12:29:33",
            "id": 2
        },
        {
            "author": null,
            "body": "Created attachment 14158\nDialog box that shows on silent uninstall\n\nI am not sure what you understand by \"silent\" install. I define it as the user\nnot being presented with any dialog boxes whatsoever. I have attached a\nscreenshot of the dialog box that gets present when you run the uninstaller\nwith the /S option. I am requesting that there be another option for example\n/CLEAN=TRUE which will avoid the dialog box. The whole point of a silent\ninstall is that you can integrate it into the installer of another package. We\ndont want to expose the use of Tomcat to the end user of our product because it\nreally does not concern them. If the attached dialog box pops up to our end\nuser they will not know what to do with it. I hope I am making myself clear.\nPlease let me know if I am not.",
            "date": "20050202T12:39:06",
            "id": 3
        },
        {
            "author": null,
            "body": "Ah, ok, the problem is during the uninstallation process, with this yes/no. You\nshould have described the issue more precisely.",
            "date": "20050202T12:57:31",
            "id": 4
        },
        {
            "author": null,
            "body": "Fixed in CVS. Sorry for the trouble.",
            "date": "20050202T13:14:37",
            "id": 5
        },
        {
            "author": null,
            "body": "I am sorry if my description was not clear. I will endevour to be more eliquent\nin future.",
            "date": "20050202T13:22:47",
            "id": 6
        }
    ],
    "component": "Native:Packaging",
    "description": "if bug 10021 is unfesable to do then at least there could be a silent uninstall\noption so that a batch file could be writted to effectively do bug 10021.",
    "hasPatch": false,
    "hasScreenshot": true,
    "id": "33351",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "RFE",
    "priority": "P2 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "silent uninstall",
    "systemSpecification": true,
    "version": "Unknown"
}