{
    "comments": [
        {
            "author": null,
            "body": "I am not aware of any relevant changes. Please provide a ready to test war.",
            "date": "20050202T22:51:55",
            "id": 0
        },
        {
            "author": null,
            "body": "there were changes to o.a.jasper.jspc.java concerning the classloader.  i can't \ndemonstrate this in a ready to run war since the problem doesn't happen if i \nlet jsp's compile at runtime.  this is only happening to me at precompile \ntime.  i did some more testing and have narrowed the behavior down to a case \nwhere if i have 2 .jsp files named a.jsp and b.jsp and the second one \nalphabetically (b.jsp) has the taglib reference but a.jsp doesn't, then the bug \nhappens.  if i rename a.jsp to c.jsp so that the non taglib jsp comes after the \ntaglib one, then it works.  it appears that something magic is happening so \nthat precompiling with taglibs only works if the first jsp that is processed by \njspc.java contains a taglib reference.  if you diff jspc.java between 5.5.4 and \n5.5.7 you'll see a number of changes regarding its management of the \nclassloader that may or may not be the culprit.  hope this is of some help :)",
            "date": "20050203T01:21:33",
            "id": 1
        },
        {
            "author": null,
            "body": "The jspc changes are not relevant. Without a test war -> invalid.\n\nBTW, jsp-examples is precompiled as part of the Tomcat build process. It\ncontains JSTL pages, without expanded TLDs. Do you have any explanation as to\nwhy it precompiles without errors ?",
            "date": "20050203T01:28:41",
            "id": 2
        },
        {
            "author": null,
            "body": "excellent point :)  i downloaded 5.5.7-src.zip and am able to compile it under \ncygwin on win xp.  you are correct that the jsp-examples precompile correctly.  \nonce it had all compiled successfully, i dropped one new .jsp into \nthe .../jakarta-tomcat-5.5.7-src/jakarta-servletapi-5/jsr152/examples/tagplugin \ndirectory.  this jsp is named aaa_breaks_jspprecompile.jsp and contains has one \nline it:\n\n<h3>no taglib uri reference in first file alphabetically makes jspc die</h3>\n\n(note there is no reference to a taglib)\n\ni then did a touch *.jsp in that tagplugin directory to make all the .jsp's out \nof date and re-ran ant and sure enough i get:\n\nbuild-webapps-precompile:\n\nBUILD FAILED\nC:\\workspace\\toolbelt\\tomcat\\jakarta-tomcat-5.5.7-src\\build.xml:50: The followin\ng error occurred while executing this line:\nC:\\workspace\\toolbelt\\tomcat\\jakarta-tomcat-5.5.7-src\\jakarta-tomcat-5\\build.xml\n:767: The following error occurred while executing this line:\nC:\\workspace\\toolbelt\\tomcat\\jakarta-tomcat-5.5.7-src\\jakarta-tomcat-5\\build.xml\n:372: org.apache.jasper.JasperException: The absolute uri: http://java.sun.com/j\nsp/jstl/core cannot be resolved in either web.xml or the jar files deployed with\n this application\n\ni know this sounds crazy, but it appears that as long as the first .jsp file \n(sorted alphabetically) in any given directory of a webapp does NOT use \ntaglibs, then no other jsp in that same directory that uses taglibs will \nprecompile.  hopefully it's easy for you to create the \naaa_breaks_jspprecompile.jsp file in the above mentioned directory and \nreplicate the problem in your own build environment.  i apologize for not \nattaching a war file but demonstrating the problem only requires this \nsingle .jsp and a touch *.jsp so that all files in that subdir are marked as \nout of date.  thanks!",
            "date": "20050203T16:15:46",
            "id": 3
        },
        {
            "author": null,
            "body": "That's a good example. This should be fixed now.",
            "date": "20050208T15:08:08",
            "id": 4
        },
        {
            "author": null,
            "body": "*** Bug 33358 has been marked as a duplicate of this bug. ***",
            "date": "20050210T15:10:10",
            "id": 5
        },
        {
            "author": null,
            "body": "*** Bug 34134 has been marked as a duplicate of this bug. ***",
            "date": "20050322T19:47:32",
            "id": 6
        }
    ],
    "component": "Jasper",
    "description": "i upgraded from 5.5.4 to 5.5.7 and noticed that my ant jsp precompile task was \nfailing for .jsp files that were referencing taglibs.  the message it gives is:\n\norg.apache.jasper.JasperException: The absolute uri: \nhttp://java.sun.com/jsp/jstl/sql cannot be resolved in either web.xml or the \njar files deployed with this application\n\nthe line in the offending jsp looks like:\n\n<%@ taglib uri=\"http://java.sun.com/jsp/jstl/sql\" prefix=\"sql\" %>\n\nif i go into the jstl taglib jar file and grab the sql.tld file and put it into \nmy WEB-INF then the jspc task works.\n\nin 5.5.4 this worked without having the sql.tld file in WEB-INF (it was just \nfound in the .jar file of the tag library)",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "33373",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "jspc precompiling jsp with absolute uri in taglib fails",
    "systemSpecification": true,
    "version": "5.5.7"
}