{
    "comments": [
        {
            "author": null,
            "body": "Fix applied.  In the future, please use a standard diff format when submitting \npatches.",
            "date": "20050222T18:28:26",
            "id": 0
        }
    ],
    "component": "Webapps:Documentation",
    "description": "This page is out of date for NetBeans IDE:\nhttp://jakarta.apache.org/tomcat/faq/development.html#rd-netbeans\n\nThe question should be: \"How do I remotely debug Tomcat using NetBeans IDE?\"\n\nThis is what the answer should be for \"How do I remotely debug Tomcat using\nNetBeans IDE?\":\n\nThis answer assumes that you have correctly set up a NetBeans IDE project and\nthat you know how to use its debugger. If not, please go to\nhttp://www.netbeans.org/kb/using-netbeans/40/debug.html and read up on how to\nuse NetBeans IDE and its debugger.\n\nMake sure that Tomcat is started, that your application is deployed, and that\nthe sources are all defined as resources in your application. If you have a\nservlet or JSP file, set a breakpoint where its sure to hit on the next request.\nGo to \"Run->Attach Debugger\". A dialog pops up to let you specify the following\noptions:\n\n    * Debugger: JPDA Debugger\n    * Connector: SocketAttach\n    * Host: The IP address of the host your Tomcat installation is running on\n(127.0.0.1 if it is your local machine).\n    * Port: The port of your Tomcat debugging interface, which should be 8000 if\nyou've followed the instructions above.\n\nWhen you press OK, you have a debugging connection very similar to local debugging.\n\nNote that NetBeans IDE has a second option -- you can debug JSP files and\nservlets locally using a Tomcat server that is bundled with the IDE. The bundled\nTomcat server can be started in debug mode (its default port number is 11555)\nand you can open a remote connection to it from NetBeans IDE as described above.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "33692",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Update for: \"How do I remotely debug Tomcat using NetBeans?\"",
    "systemSpecification": true,
    "version": "Unknown"
}