{
    "comments": [
        {
            "author": null,
            "body": "Done.  Thanks for submitting the patch.",
            "date": "20050323T16:53:04",
            "id": 0
        }
    ],
    "component": "Webapps:Documentation",
    "description": "Index: development.xml\n===================================================================\nRCS file: /home/cvspublic/jakarta-tomcat-site/xdocs-faq/development.xml,v\nretrieving revision 1.3\ndiff -u -r1.3 development.xml\n--- development.xml\t22 Feb 2005 17:27:41 -0000\t1.3\n+++ development.xml\t27 Feb 2005 15:14:26 -0000\n@@ -100,17 +100,17 @@\n   <answer>\n     <p>\n This answer assumes that you have correctly set up a NetBeans IDE project and\n-that you know how to use its debugger. If not, please go to\n+that you know how to use the NetBeans IDE debugger. If not, please go to\n <a href=\"http://www.netbeans.org/kb/using-netbeans/40/debug.html\">\n http://www.netbeans.org/kb/using-netbeans/40/debug.html</a>\n  and read up on how to use NetBeans IDE and its debugger.\n </p>\n <p>\n-Make sure that Tomcat is started, that your application is deployed, and that\n-the sources are all defined as resources in your application. If you have a\n-servlet or JSP file, set a breakpoint where its sure to hit on the next request.\n-Go to \"Run->Attach Debugger\". A dialog pops up to let you specify the following\n-options:\n+Make sure that Tomcat is started in debug mode as described above, that your \n+application is deployed, and that the sources are all defined as resources in \n+your application. If you have a servlet or JSP file, set a breakpoint where you \n+think a problem might be occurring. Go to \"Run->Attach Debugger\". A dialog pops \n+up to let you specify the following options:\n <ul>\n     <li> Debugger: JPDA Debugger </li>\n     <li> Connector: SocketAttach </li>\n@@ -125,9 +125,9 @@\n </p>\n <p>\n Note that NetBeans IDE has a second option -- you can debug JSP files and\n-servlets locally using a Tomcat server that is bundled with the IDE. The bundled\n-Tomcat server can be started in debug mode (its default port number is 11555)\n-and you can open a remote connection to it from NetBeans IDE as described above.\n+servlets locally using a Tomcat server that is bundled with the IDE. When you\ndebug a \n+JSP file or servlet in the IDE, the bundled Tomcat server automatically starts\nin debug \n+mode, and the debugger connects to it.\n     </p>\n   </answer>\n </p>",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "33767",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "[PATCH] Modification to FAQ for Remote Debugging with NetBeans IDE",
    "systemSpecification": true,
    "version": "Unknown"
}