{
    "comments": [
        {
            "author": null,
            "body": "hey folks, have I posted to a wrong bugzilla or something? This thing breaks our\nproduction cluster and chances are it breakes someone elses as well as we speak.\nAnd it could be relevant to 5.5.x as well if thats what you after ;)",
            "date": "20050311T03:41:16",
            "id": 0
        },
        {
            "author": null,
            "body": "You got the right Bugzilla.  It's just that most of us don't think \ncrossContext is a major deal (after all, it's not a Spec-mandated feature) \nand/or simply don't feel like dealing with it.  Since you already have a fix \nit, presumably your production cluster is up already.  Thanks for pointing out \nthe issue and suggesting a patch: it'll be incorporated when someone has the \ntime and interest for it.",
            "date": "20050311T04:05:40",
            "id": 1
        },
        {
            "author": null,
            "body": "hi Yoav, thats a relief to see a live soul here! I thought of giving this\nproblem a bump after noticing our cluster running alot soother now after the\nfix. crossContext calls is what I eventually traced the problem to, but that is\nnot something we use alot, so I've got a gut feeling that the problem could have\nan impact on something else as well. I will be able to definitevely confirm\neither tomorrow though, so I'll keep your posted if you dont mind be posted.",
            "date": "20050311T04:34:34",
            "id": 2
        },
        {
            "author": null,
            "body": "Actually, if you had looked, you would have seen that it won't affect Tomcat\n5.5.x (the request dispatcher will no longer use createEmptySession).",
            "date": "20050323T18:04:33",
            "id": 3
        },
        {
            "author": null,
            "body": "No further info and Remy's comment lead me to closing this issue at this time.",
            "date": "20050324T15:24:01",
            "id": 4
        }
    ],
    "component": "Catalina",
    "description": "hi,\n\nApplicationHttpRequest class instantiates local sessions using\ngetManager().createEmptySession() call. getManager().createEmptySession() method\nis not overriden by Filip's session managers and it would always create\nStandardSession instance. An adverse effect of this is broken cluster in case of\ncross-context forwards and includes.\n\nTo fix the problem I used Manager.createSession() call instead of\nManager.createEmptySession() in ApplicationHttpRequest.java line 504. \n\nhope this helps.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "33776",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 major",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "crosscontext include and forward do not honor session manager on the target context",
    "systemSpecification": false,
    "version": "5.0.30"
}