{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 14485\nExample .war that cannot be undeployed after deployment and a Tomcat restart",
            "date": "20050314T11:56:29",
            "id": 0
        },
        {
            "author": null,
            "body": "Ok, using antiResourceLocking (which modifies the docBase) caused a bad\nregistration of the resources.",
            "date": "20050314T12:55:18",
            "id": 1
        }
    ],
    "component": "Catalina",
    "description": "We have a webapp that needs to be dynamically redeployed on Windows, so we\nturned the antiResourceLocking option on in a context.xml file in its META-INF\ndirectory. Deployment/undeployment from a clean Tomcat works fine. However after\nstopping the Tomcat service and starting it again, we find that although the\nwebapp is autoDeploy-ed correctly on startup (and unpacked into the \\temp\\\ndirectory), it cannot be undeployed. The manager webapp reports a successful\nundeploy and there is no error message in any of the Tomcat logs; however the\nManager's application list still includes the webapp, which appears to have been\nstopped but not undeployed.\n\nThis behaviour seems to be the same whether or not antiResourceLocking is turned\non globally. However if we either i) set antiResourceLocking=true in the global\nconf\\context.xml file and remove the entire context.xml file from the webapp or\nii) set antiResourceLocking=false in the webapp context.xml file, undeployment\nsucceeds. (NB: unfortunately this does not provide a workaround for us, as we\nneed antiResourceLocking=false globally to make other webapps work correctly)\n\nTo demonstrate that this is a Tomcat problem and not specific to our apps, I\nhave reproduced it using only the Manager webapp for the deploy/undeploy\noperations, with a stripped down webapp containing only a single JSP page,\nweb.xml and the context.xml file. I'll upload this example .war shortly.\n\nI suspect the problem is related to the context files stored in the\nconf\\enginename\\host folder, as I note that deleting the webapp's context file\nfrom this folder seems to allow the undeployment to work correctly (whether it\nis deleted before or after starting Tomcat for the second time).",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "34006",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Undeploy of webapps with antiResourceLocking in META-INF\\context.xml fails after Tomcat restart",
    "systemSpecification": true,
    "version": "5.5.7"
}