{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 14526\nWAR file showing multiple value headers are not reset with call to setHeader( )\n\nThe WAR file contains an index.jsp that redirects the user to a servlet that\ntriggers the bug.  You will need to view the response headers to see the\nviolation.  The servlet may be accessed directly with the request:\n\nGET /SetHeaders/SetHeaders HTTP/1.0",
            "date": "20050321T20:33:11",
            "id": 0
        },
        {
            "author": null,
            "body": "Created attachment 14527\nProposed patch\n\nOriginal bug summary describes the decisions made for the patch.",
            "date": "20050321T20:34:26",
            "id": 1
        },
        {
            "author": null,
            "body": "-1 for the proposed patch (quite inefficient).\n\nOverall, I think the issue is trivial while the change to make it work\nefficiently is not exactly trivial, so there is no hurry to fix this.",
            "date": "20050321T21:12:37",
            "id": 2
        },
        {
            "author": null,
            "body": "Created attachment 14531\nSlightly more efficient patch - one interation over the list of headers\n\nThis patch changes the setValue( ) method call to an addValue( ) method call to\navoid needlessly iterating over the entire list in the call to setValue(\n)--since setValue( ) will not find a header with given name after all headers\nwith that name have been removed.\n\nAfter this patch, a call to setHeader( ) will require one full iteration\nthrough the list of headers; whereas current CVS iterates over half the list,\non average, inside the call to setValue( ).  Therefore, assuming the\nDEFAULT_HEADER_SIZE of 8, this will mean an additional 4 String comparisons,\nbut without using a hash or some kind of custom search tree or redesigning\nMimeHeaders with multiple header values in mind, a full iteration over the list\nis unavoidable.  So, are the additional String comparisons a small enough price\nto pay for compliance?\t:)\n\nA better solution is to fix the setValue( ) method of the MimeHeaders\nclass--assuming (since the partial javadoc doesn't say so) that setValue( )\nshould replace all existing headers having the given name.  If this is the\nintended behavior of the setValue( ) method, the next patch could be used\ninstead.  It's consequences (and implementation) are identical to those of this\npatch.",
            "date": "20050322T02:01:12",
            "id": 3
        },
        {
            "author": null,
            "body": "Created attachment 14532\nPatch to fix the setValue( ) method of MimeHeaders (on which Response's setHeader( ) method relies)\n\nThis patch implements the changes given in\nhttp://issues.apache.org/bugzilla/attachment.cgi?id=14531 in the MimeHeaders\nmethod setValue( ) instead of the Response method setHeader( ).  The\nconsequences and implementation are the same as those described in the patch\nfor Response.\n\nOnly one of the patches should be used.  Since the partial javadoc for the\nsetValue( ) method was not clear about its intended behavior, I was unsure\nwhich class should be changed.",
            "date": "20050322T02:06:33",
            "id": 4
        },
        {
            "author": null,
            "body": "The problem is not the cost of the comparisons, but of removeHeader if it\nmatches anything, so -1 for any of the proposed patches. I will fix it\neventually, but the issue is small enough that it is ok to not fix it immediately.",
            "date": "20050323T17:55:40",
            "id": 5
        },
        {
            "author": null,
            "body": "This is fixed now in the CVS, and will appear in 5.5.9.",
            "date": "20050325T17:38:40",
            "id": 6
        }
    ],
    "component": "Connector:Coyote",
    "description": "The setHeader( ) method in the org.apache.coyote.Response class does not clear\nexisting values for a header with multiple values.\n\nAccording to the Servlet Specification version 2.4 (SRV.5.2, para 2):\n-----\nThe setHeader method sets a header with a given name and value. A previous\nheader is replaced by the new header. Where a set of header values exist for the\nname, the values are cleared and replaced with the new value.\n-----\n\nThis requirement has been true since at least Servlets 2.2 (same location in\nSerlvets 2.3 specification; SRV.6.2, para 2 in the Servlets 2.2 specification).\n\nWhere only one value exists, the setHeader( ) method properly replaces it with\nthe specified value.\n\nAttached is a patch that fixes the bug.  In creating the patch, I found that:\n\n  a) the setHeader( ) method in Response relies on the\norg.apache.tomcat.util.http.MimeHeaders class's setValue( ) method.\n  b) the setValue( ) method in MimeHeaders relies on getValue( ) in MimeHeaders\n  c) the getValue( ) method in MimeHeaders explicitly states, \"If more than one\nsuch field is in the header, an arbitrary one is returned.\"\n  d) the MimeHeaders class's source code is prefixed with: \"XXX XXX XXX Need a\nmajor rewrite  !!!!\"\n\nTherefore, with the existing MimeHeaders class, all existing header values must\nbe removed before calling getValue( ).  If the MimeHeaders class is rewritten,\nthis requirement may be alleviated by a design change in consideration of the\nServlet Specification's requirements for setHeader( ).\n\nThe attached patch simply removes the named header (by calling MimeHeader's\nremoveHeader( ) method) before calling MimeHeader's setValue( ) method.  This\nmeans that the removeHeader( ) method will be called with every execution of the\nResponse's setHeader( ) method.  Since removeHeader( ) iterates over every\nheader, we incur a penalty for every execution of setHeader( ), and the penalty\ngrows as the number of headers increases.  However, since:\n\n  a) there is no way to find out whether multiple values exist for a specified\nheader (other than iterating as is done by removeHeader( ))\n  b) the containsHeader( ) and getHeader( ) methods iterate over the headers (by\ncalling getValue( )) (as is done by removeHeader( ))\n  c) the average number of headers is small (assumed to be about 8)\n\nattempting to determine if multiple values exist for the header before calling\nremoveHeader( ) is fruitless since the same penalty is paid whether zero, one,\nor multiple values exist for the named header and the penalty is identical to\nthat imposed by calling the removeHeader( ) method without first checking for\nthe existence of a header.  If checking first, the penalty would double for the\ncase where multiple values exist.  If the assumption that the number of headers\nis small holds true, the penalty should be minimal.\n\nI'm marking the severity as minor because the bug is unlikely to affect many\nusers (only those trying to replace all values of a header with multiple values)\nand workarounds exist (i.e. ensure that the headers are set to their correct\nvalue the first time ;), or reset the response while retaining and setting the\nvalues that should not be replaced).  However, until this bug is fixed, Tomcat\nis not in compliance with the Servlet Specification.  ;)\n\nThis bug is also confirmed to exist in Tomcat  CVS, 5.5.8, 5.5.7, and in 5.0.30\ncode.  It may also exist in Tomcat 4.x and Tomcat 3.x.\n\nAttached patch fixes the bug.  The patch is against Tomcat 5.5.8 source and\napplies cleanly to CVS.\n\nAttached WAR file contains an example of the problem.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "34113",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 minor",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "[PATCH] setHeader( ) method in Response object does not clear multiple values",
    "systemSpecification": false,
    "version": "Nightly Build"
}