{
    "comments": [
        {
            "author": null,
            "body": "The tag is optional and may be added in server.xml or other places.  Read the\nrest of the docs, especially the ones on Context configuration.",
            "date": "20050330T14:30:14",
            "id": 0
        },
        {
            "author": null,
            "body": "Item 2 of a seemingly step-by-step HOWTO says:\n\n\"Add this in between the </Context> tag of the examples context and the </Host>\ntag closing the localhost definition.\"\n\nThis step is *impossible* to follow as is because the server.xml does not\ncontain the string \"</Context>\".\n\nI personally think that examples provided in documentation should work verbatim\nand not require various unspecified amendments informed by further reading, but\nif this is not in fact the policy of the documentation team then may I suggest\nyou add some text to this effect?  e.g. \"These example are approximate only; if\nthese examples don't work for you, please read the document in its entirety,\nincluding all linked pages.\"",
            "date": "20050330T16:51:34",
            "id": 1
        },
        {
            "author": null,
            "body": "I've added to the JNDI DataSources HowTo:\n- An explicit paragraph at the top of the page saying you shouldn't even read\nthis page if you don't understand the context and host configuration pages, with\nlinks to these pages.\n- An explicit notice in the section you mention, addressing what to do if\nthere's no context tag in server.xml and the reader couldn't simply copy and\npaste the one repeated in the doc.",
            "date": "20050330T19:23:08",
            "id": 2
        }
    ],
    "component": "Webapps:Documentation",
    "description": "Section 2 of\nhttp://jakarta.apache.org/tomcat/tomcat-5.0-doc/jndi-datasource-examples-howto.html\nsays to add a slug of XML between a </Context> tag and a\n</Host> tag.  Tomcat's conf/server.xml (at least version 5.0.28) does\nnot have a </Context> tag.  I had some success with adding a\n<DefaultContext> tag and putting the slug in that, but I'm not sure if\nthat's the right thing to do.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "34237",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "server.xml does not contain </Context> tag, as documentation says it does",
    "systemSpecification": true,
    "version": "5.0.28"
}