{
    "comments": [
        {
            "author": null,
            "body": "One more thing, this works for Tomcat 5.0.x. ",
            "date": "20050411T16:33:58",
            "id": 0
        },
        {
            "author": null,
            "body": "In 5.5, the manager will only handle contexts deployed by the autodeployer.\nPlease don't insist for it to behave in a different way, it will not happen. The\nother part of the bug has been fixed already.",
            "date": "20050411T16:42:18",
            "id": 1
        },
        {
            "author": null,
            "body": "So you claim that it is 'as designed' to restrict undeploy by manager of\nautodeployed applications? (I'm OK with that)\nBut why the report is: \"OK - Undeployed\", if it is not true! I'd expect\ndifferent result message at least (it could be probably downgraded).",
            "date": "20050411T16:51:00",
            "id": 2
        },
        {
            "author": null,
            "body": "Hacking in contexts using server.xml is not recommended. I do not see any reason\nto address this non issue.",
            "date": "20050411T16:55:33",
            "id": 3
        },
        {
            "author": null,
            "body": "I'm OK with not recommend using server.xml, but it is still part of product,\ntherefore valid issue, although with lower priority.",
            "date": "20050411T17:36:50",
            "id": 4
        },
        {
            "author": null,
            "body": "I do not insist on this being considered as a serious issue, especially if the  \nstopping has been fixed. However, I do not agree it is a \"non issue\". Defining  \ncontext in the server.xml is a valid usecase, although not recommended and  \nugly, but it is still valid.  \n  \nI would expect the Tomcat Manager to behave reasonably which is returning  \nsomething like \"FAIL - Application cannot be undeployed...\" and not claiming  \nit was undeployed successfully, if it was not.  \n  \nRemy, please note that I've filed this issue in attempt to improve the Tomcat  \nuser experience. This usecase is not what I would personally do. However,  \nusers who are upgrading from erlier versions (3.x.x or 4.x.x) are often used  \nto it and they would surely consider this as an issue. \n \nBtw, if this issue should be closed, it should be cloased as WONTFIX and not \nas INVALID. \n \nAnyway, thanks Remy for fixing the other issue! ",
            "date": "20050411T17:53:07",
            "id": 5
        },
        {
            "author": null,
            "body": "I have fixed this by disabling undeploy for contexts defined in server.xml\n\nThis fix will be in 5.5.20 onwards",
            "date": "20060915T01:58:13",
            "id": 6
        }
    ],
    "component": "Webapps:Manager",
    "description": "Steps to reproduce: \n \n1. autodeploy a web application by defining its context in server.xml \n2. start the Tomcat server \n3. use the Tomcat Manager to undeploy the application \n \nYou will get the \"OK - Undeployed application at context path /WebApplication\" \nmessage, but the application will NOT be undeployed, it will be only stopped. \n \nIf you try to stop the server after that, it will fail! \n \nI have used the shared installation (CATALINA_BASE dir), but I guess this \nwon't work for standalone Tomcat isntallation either.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "34399",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P4 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Undeploying fails when context defined in server.xml & server fails to stop",
    "systemSpecification": true,
    "version": "5.5.7"
}