{
    "comments": [
        {
            "author": null,
            "body": "It's mentioned in bold (and the examples have been updated) in the 5.5. JDBC\nDataSources How-To.",
            "date": "20050601T04:17:56",
            "id": 0
        },
        {
            "author": null,
            "body": "(In reply to comment #1)\n\nSorry, my fault, I stand corrected re the bold comment - I was focused on the \nexamples at the bottom of the page and skipped over the bold statement at the \ntop of the page.  I'd therefore like to file a bug report about my eyeglasses \nplease ;)\n\nHowever despite my failure to read what was there (or perhaps because of it) I \nwould still like to suggest (as also mentioned in report 35055) that it might \nbe useful to put these sorts of issues either in the release notes, or if not \nappropriate there, to create a new doc at each version called something \nlike \"Upgrading from previous versions of tomcat\"...?  Such a doc would be a \nboon for people with existing webapps, to help them make smoother upgrades to \nlater TC builds.\n\nJust a suggestion :)\n",
            "date": "20050601T18:46:39",
            "id": 1
        }
    ],
    "component": "Webapps:Documentation",
    "description": "Have just spent 3 days stuck on upgrading a working webapp from 5.0.28 to \n5.5.9, I finally solved it with help from tomcat-user, but I can't find the \ncore issue mentioned in the TC docs.  I therefore humbly suggest it might be a \nuseful note to include in the docs for 5.5 (and maybe 5.0 too, as a warning \nthat the approach that was previously valid in 5.0 is now invalid in 5.5).  \nAlso, might it be a good idea to include this in future 5.5.x release notes?\n\nBasically, under 5.0.28 I had a separate xml context config file within my \nwarfile/META-INF, that used the nested-tag approach, i.e. <ResourceParams> \n<parameter> </parameter> </ResourceParams>, but this did not work under 5.5.9, \nwhich seems to require the single-tag <Resource/> approach.  I recognise that \nthe JDBC how-to page example uses the new approach, but it makes no comment \nabout the previous approach being invalid, perhaps it would help those \nupgrading if the change was explicitly mentioned?  I say this particularly in \nview of the fact that TC offers several ways to config a context, so it might \nbe helpful to clarify that here is one way that is no longer valid in 5.5.\n\nThe reported exception was \"No suitable driver\" from java.sql.DriverManager, \nwhich is why I did not initially suspect an XML problem.  This is a second \nreason why this is a tricky one to solve without help from the docs.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "35014",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "RFE",
    "priority": "P2 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Please document the change in the context file XML format",
    "systemSpecification": false,
    "version": "5.5.9"
}