{
    "comments": [
        {
            "author": null,
            "body": "Further discussion of the issue can be found here:\nhttp://www.mail-archive.com/dev%40tomcat.apache.org/msg01312.html\n\nPeter Rossbach now plans to implement Cross-Context Session Replication in\nrelease 5.5.14.  The proposed solution discussed by Remy and Peter is to use the\nendAccess method in ClusteredSession to populate a thread-local that will\ncontain the list of all the sessions that were modified and that need to be\nreplicated.  Then the ReplicationValve can use this thread-local to perform the\nreplication of all the affected sessions.\n",
            "date": "20051204T06:16:40",
            "id": 0
        },
        {
            "author": null,
            "body": "Hello John and Eric,\n\nI have add now the support for cross context cluster session replication. Look at svn head for tomcat \n5.5.16.\n\nMy tests are very basic and we need help from real application with cross context usage.\n\n\nThanks\npeter",
            "date": "20060105T20:47:32",
            "id": 1
        },
        {
            "author": null,
            "body": "I have set up a full clustered portal/portlet environment using the latest\n5.5.16 svn head code from 19 Jan 2006 and I have verified that both normal and\ncross-context session changes are now being properly replicated.\n\nThe JSR-168 portlet community is eternally grateful to Peter for this work!\n\nI'll be posting a Wiki page to document the configuration and provide a sample\nwebapp for testing.",
            "date": "20060123T18:09:29",
            "id": 2
        },
        {
            "author": null,
            "body": "Here is the Wiki article I put together to document how to use this new\nfunctionality with JSR-168 portlet applications:\n\nhttp://www.ja-sig.org/wiki/display/PLT/Clustering+JSR-168+Portlet+Applications+in+Tomcat\n\nThanks again to Peter for getting this implemented!\n",
            "date": "20060206T19:15:31",
            "id": 3
        },
        {
            "author": null,
            "body": "FYI - There was a regression on this in Tomcat 6. Peter has fixed it again (Thanks, Peter!) and it will be available in Tomcat 6.0.21 as well as Tomcat 7.",
            "date": "20091111T08:12:29",
            "id": 4
        }
    ],
    "component": "Catalina:Cluster",
    "description": "I am creating this issue as a documentation and watch point for the eventual\nenabling of session replication for contexts that are the targets of a cross\ncontext dispatch. This issue was discussed on the tomcat-dev mailing list. The\narchive of the discussion can be found here:\nhttp://www.mail-archive.com/tomcat-dev%40jakarta.apache.org/msg73283.html",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "35710",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "P3 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Cross-Context Session Replication",
    "systemSpecification": false,
    "version": "5.5.9"
}