{
    "comments": [
        {
            "author": null,
            "body": "For the storeconfig module, this was fixed in 5.5.10: see\nhttp://cvs.apache.org/viewcvs.cgi/jakarta-tomcat-catalina/modules/storeconfig/src/share/org/apache/catalina/storeconfig/ConnectorStoreAppender.java?rev=1.3&view=log.\n Can you please test 5.5.10 and let us know?",
            "date": "20050727T02:11:17",
            "id": 0
        },
        {
            "author": null,
            "body": "Well, when you get a chance to test, please let us know.",
            "date": "20050901T20:48:46",
            "id": 1
        },
        {
            "author": null,
            "body": "Yes, I'd like to test it out. But where I can get 5.5.10 from ? I see 5.5.9 and\n5.5.11-alpha from the download page. Would you like me to try 5.5.11-alpha ?\nthanks (and sorry for the delay in responding to this)",
            "date": "20050902T02:27:44",
            "id": 2
        },
        {
            "author": null,
            "body": "I verified that this works in 5.5.11-alpha. Any idea whether/when the fix will\nbe ported to 5.0.x (currently 5.0.30) ? If the fix is to the admin webapp only,\nthen,\ncan I just take the admin webapp from 5.5.11 and then try it under 5.0.x ? thanks.",
            "date": "20050917T03:28:51",
            "id": 3
        },
        {
            "author": null,
            "body": "This is a bug(perhaps) for EXE installed verion of tomcat5.5.12,the ZIP \nversion is correct.\nwith EXE installed version,if i you edit config file(server.xml) in admin app\nthe http 8080 connector changes to:\n<connector type=\"HTTPS\" sheme=\"http\"...\n>\n",
            "date": "20050929T13:42:45",
            "id": 4
        },
        {
            "author": null,
            "body": "Closing this as fixed since the OP tested it and reported that the issue was\nfixed in 5.5.11.\n\nIt is very unlikely that this will be ported to 5.0.x since development has all\nbut stopped on that branch.\n\nComment 5 is not directly related to the original issue. The .exe code and .zip\ncode are identical so the described behaviour is very unexpected. If this is\nstill an issue, please open a new bug report.",
            "date": "20061001T21:33:13",
            "id": 5
        }
    ],
    "component": "Webapps:Administration",
    "description": "I'm using tomcat 5.5.9 version and when I use the admin app to make any changes\nto the server.xml file (or evn if I just save, without making any changes), the\nHTTPS connector definition (if there is one defined) in server.xml gets\ncorrupted. Basically the the attribute \"sslProtocol=TLS\"\" is omitted when saving it.\nAs a result, https connection doesn't work. If I add that attribute manually\nafter  I save the changes through the admin app, then https connection works.\n\nWe noticed a similar problem on tomcat 5.0.28 as well, and I posted a question\nabout this on the tomcat mailing lists last month. In tomcat 5.0.28, the issue\nwas slightly different that when you save changes through the admin webapp, the\nfollowing duplicate attributes to the HTTPS connector were being added. If we\nremove those entries manually, then the connector seem to come up fine.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "35835",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Submitting changes through admin app corrupts the HTTPS connector definition in server.xml",
    "systemSpecification": true,
    "version": "5.5.9"
}