{
    "comments": [
        {
            "author": null,
            "body": "I don't think it's a Tomcat bug.  You can look and test the simple cookie\nexample servlet that ships with Tomcat to see for yourself.",
            "date": "20051017T00:45:49",
            "id": 0
        },
        {
            "author": null,
            "body": "Hello,\n\nI want to re-open this case because I'm running into the same problem.  I'm \nporting a large app to tomcat and can't go any further until this is fixed.\n\nI've written a separate app that contains a jsp file with a form and a \nservlet.  That's it.  All the servlet does is set the cookie and include the \njsp.\n\nIf I use a cookie value without spaces then then there are no quotes.  If I \nuse a value with spaces than quotes are automatically put around the value.  I \nalso get the same results with commas.  I have not tried any other characters.\n\nI would like to help get this resolved, so please feel free to contact me \nabout this.\n\nThank you,\n\n\nSteve.",
            "date": "20051201T04:34:52",
            "id": 1
        },
        {
            "author": null,
            "body": "Please attach the minimal WAR you mention with the one servlet and JSP to this\nissue so that we can reproduce your results.\n\nPlease confirm your report is true for an out-of-the-box Tomcat 5.5.12\ninstallation in stand-alone mode, i.e. without NetBeans or another IDE.\n\nPlease confirm that the cookie example servlet that ships with Tomcat does NOT\nshow quotes on your screen.  It doesn't for me, which is why this issue was\ninitially closed, but perhaps it strips out the quotes along the way.\n\nThen, if you really want to help, a patch would be nice ;)",
            "date": "20051201T05:03:19",
            "id": 2
        },
        {
            "author": null,
            "body": "Created attachment 17118\nweb application\n\nAfter submitting the form.  check your cookie values.  It is a session cookie\nso it will disappear after you close your browser.",
            "date": "20051202T03:53:29",
            "id": 3
        },
        {
            "author": null,
            "body": "Hello,\n\nI've downloaded 5.5.12 and have tested the app and it acts the same way as the \nother version.\n\nCan you direct me to the package(s) that handle the tomcat cookie parsing?  \nI'm going to need a little direction since I haven't done any core tomcat \ndevelopment.\n\nThank you.",
            "date": "20051202T04:13:09",
            "id": 4
        },
        {
            "author": null,
            "body": "(In reply to comment #5)\n> Hello,\n> I've downloaded 5.5.12 and have tested the app and it acts the same way as \nthe \n> other version.\n> Can you direct me to the package(s) that handle the tomcat cookie parsing?  \n> I'm going to need a little direction since I haven't done any core tomcat \n> development.\n> Thank you.\n\nIt's in o.a.t.u.http.ServerCookie.  You'll find it under connectors/util/java \nin the source distro.\n\n\n",
            "date": "20051202T05:50:22",
            "id": 5
        },
        {
            "author": null,
            "body": "Please have a look at the following specs \nhttp://www.faqs.org/rfcs/rfc2068.html , \nIf the cookies contains the special characters they should be quoted , that is\nwhat have been implemented .\nRegards\nVicky",
            "date": "20051205T12:19:55",
            "id": 6
        },
        {
            "author": null,
            "body": "Vicky,\n\nCould you be so kind as to point out which section? \n\nThanks",
            "date": "20051205T16:14:01",
            "id": 7
        },
        {
            "author": null,
            "body": "Hello,\n\nDo you believe that if I set a cookie to a certain value in an application, \nthen when I go to read the cookie, I should be given the same value that I set \nor a different value?  I believe that if I set the cookie value to a,b,c,d,e \nthen I should get a,b,c,d,e returned back to me when I read the cookie.  In my \napplications, I should not have to take into considderation that the cookie \nmay have been escaped.  The application server should take care of that for me.\n\nDo you agree?",
            "date": "20051206T02:00:32",
            "id": 8
        },
        {
            "author": null,
            "body": "Sorry,\n\nI'm going to read into this rfc a little and continue to research it.\n\nThank you.",
            "date": "20051206T02:01:43",
            "id": 9
        },
        {
            "author": null,
            "body": "Hello,\n\nI've just looked at the rfc you've pointed me to and I think you are referring \nto section 2.2.  That is the section where they talk about basic rule about \nconstructing a http header.  From my understanding of the rfc, if a http \nheader value contains special characters then the http header value needs to \nbe quoted to escape it.\n\nI set the cookie and monitored the output of the http header.  This is what I \ngot.\n\nSet-Cookie: ServletCookieVar=\"asfasf asdf asf asdf\"\n\nBy the looks of it,  You're not quoting the http header value.  You're quoting \nthe cookie value.  If you were to quote the header value, then the header \nwould look like this.  Notice the position of the quotes.\n\nSet-Cookie: \"ServletCookieVar=asfasf asdf asf asdf\"\n\nAm I correct to assume that this is what the header should look like?\n\nDoes this seem correct or am I reading the wrong part of the rfc?\n\nregards,\n\n\nSteve.\n\n\n\n",
            "date": "20051206T02:26:04",
            "id": 10
        },
        {
            "author": null,
            "body": "I seem to be saying sorry al lot.\n\nI guess I shouldn't say yours.  You're probably not the person that wrote that \ncode, so please do not think I'm attacking you.  I'm just trying to justify \nwhat's happening and fix the bug ASAP.\n\nAlso,  I'm not attacking the person who did write the code.  It's all in how \nthe person interprets the rfc.\n\nThank you,\n\n\nSteve.",
            "date": "20051206T02:32:05",
            "id": 11
        },
        {
            "author": null,
            "body": "This is fixed now in SVN trunk, and hopefully will even make the cutoff for \ninclusion in 5.5.14.\n",
            "date": "20051206T04:17:28",
            "id": 12
        },
        {
            "author": null,
            "body": "William,\n\nThank you very much for taking care of it.  I was looking at the class you \npointed me to but have not had enough time to narrow down exactly which methods \nI needed to modify.\n\nThank you,\n\n\nSteve.",
            "date": "20051206T16:55:27",
            "id": 13
        },
        {
            "author": null,
            "body": "Hi Steave,\nAs pointed by Willaim that the fix will come with 5.5.14 I think you will have\nto wait till that. I can understand this to be a critical requirement for you so\nI think we can ask William for the changes for the fix so that you can apply it\n, but this will be a bit of risk  . \nNow looking at the code I can understand that \n1) Some changes to me made at appendCookieValue method , precisely at \n     buf.append( name );\n     buf.append(\"=\");\n     maybeQuote(version, buf, value);\nThe appendCookieValue gets called from the addCookie of the\norg.apache.catalina.connector.Response , you make a call to this when you are\nadding a cookie .\n\n\n2) maybeQuote is having a version parameter which is not used at all , can this\nbe removed too ? This is not relevant to this bug .\n\nI have done just a initial investigation. \nBTW are the changes done to this bug or it is yet to be done , incase of later\nthen I think we can help Steave and the same changes can be committed to CVS for\nTomcat 5.5.14\n\nRegards\nVicky",
            "date": "20051212T06:57:05",
            "id": 14
        }
    ],
    "component": "Unknown",
    "description": "Multiple word phrases (like Online Query) saved in a cookie are quoted when\nretrieved. See example below ...\n\nEnter:\n  Online Query\n\nClick Submit. Submit saves the value in a cookie to be later used in search.\n\nReturn to search page which will fetch cookie value and place in appropriate\ninput box. The value is now displayed as:\n\n\"Online Query\" \n\nGranted that this is the integrated version of Tomcat in Netbeans but I wanted\nto report this here as well as with Netbeans.\n\nUsing JSDK 1.4.2_08\n\nThanks",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "36863",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Space seperated cookie value text returned in quotes",
    "systemSpecification": true,
    "version": "5.5.7"
}