{
    "comments": [
        {
            "author": null,
            "body": "OK, clarified warning -- thanks for the suggestion.\n\nNext time, please try to provide a better title for your Summary of Bugzilla\nissues, tell us the Tomcat version, and mark minor enhancements as such.  This\nis far from critical.",
            "date": "20051020T03:38:05",
            "id": 0
        },
        {
            "author": null,
            "body": ">mark minor enhancements as such.  This is far from critical.\n\nThanks for fixing this oversight - I have a bone to pick with you here though. It was critical to me as I lost \nabout a week's worth of work when an entire website was deleted basically without warning.",
            "date": "20051020T03:45:50",
            "id": 1
        },
        {
            "author": null,
            "body": "The new message is only shown when application is stopped but not when\napplication is started.",
            "date": "20051207T21:05:47",
            "id": 2
        },
        {
            "author": null,
            "body": "Yup, I know, that's what he asked for.",
            "date": "20060413T21:42:06",
            "id": 3
        }
    ],
    "component": "Webapps:Manager",
    "description": "Even though I realize this is a mistake someone makes only once...\n\nWhen you \"Deploy\" an application in the webapps manager - it doesn't create a new application. It just \nmakes a link between the application already existing in the webapps folder and tomcat manager. \nTherefore, you would think that when you click a link called \"Undeploy\" it would sever that link NOT delete \nthe entire webapp folder - usually that kind of action is called, you know, \"Delete.\" Therefore, for the sake \nof user-friendliness and to, you know, avoid the usual sadomasochistic Linux user-experience, maybe you \nshould have the javascript popup say something useful along the lines of: \"Are you sure - this will delete \nthe webapp folder\" - not just: \"Are you sure\" when the undeploying is really deleting.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "37172",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "P2 minor",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "user-friendly suggestion",
    "systemSpecification": true,
    "version": "5.5.14"
}