{
    "comments": [
        {
            "author": null,
            "body": "me too! I created two <Resource> entries for UserDatabases (UD1 and UD2) in\n<GlobalNamingResources>, and two <Realm> entries directly under <Engine> for the\nUserDatabases. Within two different hosts, I have a manager.xml in each host\nwith a <ResourceLink> to one of the realms (manager1 has resourcelink to UD1,\nmanager2 links to UD2). \nBut in the manager-app of the second host (manager2), you can spuriously logon\nwith the user from the first UserDatabase UD1, but the users from the second\nUserDatabase UD2 are ignored. \nWhen I move the <Realm> entry from the <Engine> directly to the <Context>\nelement of the second manager app, then everything works as expected. Seems like\nthe handling of multiple <Realm> elements within one element is broken.",
            "date": "20051112T13:53:56",
            "id": 0
        },
        {
            "author": null,
            "body": "See http://tomcat.apache.org/tomcat-5.5-doc/config/engine.html\n\n<doc-quote>\nYou can nest at most one instance of the following utility components by nesting\na corresponding element inside your Engine  element:\n* Realm - Configure a realm that will allow its database of users, and their\nassociated roles, to be shared across all Hosts and Contexts nested inside this\nEngine, unless overridden by a Realm configuration at a lower level.\n</doc-quote>",
            "date": "20051112T14:06:50",
            "id": 1
        },
        {
            "author": null,
            "body": "OK, then I reopen as enhancement request. \nI think it makes sense to be able to configure several parallel realms, e.g. a\ndefault set of admin users in a file based security and another enhanced set in\na database or in LDAP. Or, maybe you have your employees in LDAP and your\ninternet customers in a JDBC realm.\nOf course you need a way to specify the order of the realm lookup, this could be\ndone analogous to the JAAS Control Flags (REQUIRED, REQUISITE, SUFFICIENT and\nOPTIONAL).",
            "date": "20051113T11:39:40",
            "id": 2
        },
        {
            "author": null,
            "body": "From 2005 to now, is there any plan to implement it?",
            "date": "20100630T17:53:45",
            "id": 3
        },
        {
            "author": null,
            "body": "Based on comment 3, I would suggest change the title of this enhancement to something like \"Support multi-Realms at Engine element\".\nCheck if it makes sense.\n\n----\n\nIs there a workaround for this feature? I need to support two different LDAPs / Realms using tomcat.",
            "date": "20100630T18:21:55",
            "id": 4
        },
        {
            "author": null,
            "body": "(In reply to comment #4)\n> From 2005 to now, is there any plan to implement it?\n\nLooks like it's already implemented, if you'd care to move up:\nhttp://tomcat.apache.org/tomcat-6.0-doc/realm-howto.html#CombinedRealm",
            "date": "20100630T18:25:00",
            "id": 5
        },
        {
            "author": null,
            "body": "No plans to back-port this to Tomcat 5 but it is available in Tomcat 6 and Tomcat 7. Marking it as fixed as it has been implemented, although not in Tomcat 5.",
            "date": "20100701T03:06:44",
            "id": 6
        },
        {
            "author": null,
            "body": "Created attachment 25695\nbackport tomcat linux",
            "date": "20100704T18:11:08",
            "id": 7
        },
        {
            "author": null,
            "body": "Created attachment 25696\nbackport tomcat windows",
            "date": "20100704T18:12:55",
            "id": 8
        },
        {
            "author": null,
            "body": "Ok.\n\nIBM Rational Team Concert isn't officially supported on Tomcat 6 yet.\n\nSo I get the Tomcat 6.0 and 5.5 source code and wrote a back-port for this feature (CombinedRealm).\nNow CombinedRealm can be used in Tomcat 5.5.\n\nAttached I am sending a new catalina.jar\nIf someone wants to use to support multi-LDAP or LDAP + local user, should backup and replace the original file: JazzServer\\server\\tomcat\\server\\lib\\catalina.jar\n\nThe catalina.jar for windows and linux are different (size and content), so I considered it and made two catalina.jar.\n\nFor information this backport change these files:\norg/apache/catalina/realm/LocalStrings.properties\norg/apache/catalina/realm/mbeans-descriptors.xml\norg/apache/catalina/realm/CombinedRealm.java\norg/apache/catalina/realm/RealmBase.java\norg/apache/catalina/startup/RealmRuleSet.java\norg/apache/catalina/startup/EngineRuleSet.java\norg/apache/catalina/startup/ContextRuleSet.java\norg/apache/catalina/startup/HostRuleSet.java\n\nDocumentation is the same of Tomcat 6.0 and available at:\nhttp://tomcat.apache.org/tomcat-6.0-doc/realm-howto.html#CombinedRealm",
            "date": "20100704T18:13:42",
            "id": 9
        }
    ],
    "component": "Unknown",
    "description": "I copied both the\n\nResource name=\"UserDatabase\" auth=\"Container\"\n...\n\nand\n<Realm className=\"org.apache.catalina.realm.UserDatabaseRealm\"\n             resourceName=\"UserDatabase\"/>\n\nentries and renamed them, i.e. added a new UserDatabaseRealm entry.\n\nAfterwards manager application would no longer accept the tomcat user (which is\nmanager role). After deleting the new entries, the tomcat user is accepted again.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "37449",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "P2 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Support multi-Realms at Engine element",
    "systemSpecification": true,
    "version": "5.5.12"
}