{
    "comments": [
        {
            "author": null,
            "body": "This is now fixed in the SVN trunk, and will appear in 5.5.15.",
            "date": "20051229T09:00:09",
            "id": 0
        },
        {
            "author": null,
            "body": "(In reply to comment #1)\n> This is now fixed in the SVN trunk, and will appear in 5.5.15.\n\nUrm, this in no way means that I don't agree with Remy that the TCK test is \ncompletely invalid.  It really s*cks when Tomcat has to program around bugs in \nSun's test, for no other reason than that the test author is completely brain-\ndead.",
            "date": "20051229T09:40:29",
            "id": 1
        }
    ],
    "component": "Connector:HTTP",
    "description": "An HTTP 1.0 POST request with no message body and no content-length attribute\nwill receive a 403 \"The request body was too large to be cached during the \nauthentication process\" Response.\n\nAlthough the validity of the POST request can be called into question, the\nTomcat response is clearly counter to RFC 2616 Section 4.3 ( The presence of a\nmessage-body in a request is signaled by the inclusion of a Content-Length or\nTransfer-Encoding header field in the request's message-headers).\n\nI've tested an HTTP 1.1 POST without a message body and no content-length\nattribute. Although Tomcat handles it properly, Tomcat seems to block in a read\nattempting to read a message body (I see an 8 second delay between POST Request\nand the Response). Although that behavior is \"correct\", I think it could be\naccurately described as \"undesirable\".\n\nThanks to Bill Barker, Remy Maucherat, and Bill Stoddard for their help on\ndev@tomcat.apache.org. On dev, Remy proposed removing the \"if (keepAlive)\" from\nthe following fragment (I presume it applies to both Http11Processor.java and\nHttp11AprProcessor.java). I have not tested this fix...\n\n         if (!contentDelimitation) {\n            // If there's no content length and we're using keep-alive\n            // (HTTP/1.0 with keep-alive or HTTP/1.1), assume\n            // the client is not broken and didn't send a body\n >>>>>>>>>>            if (keepAlive) {\n                inputBuffer.addActiveFilter\n                    (inputFilters[Constants.VOID_FILTER]);\n                contentDelimitation = true;\n            }\n        }",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "38030",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 major",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "HTTP 1.0 POST Request without a message body improperly receives a 403",
    "systemSpecification": true,
    "version": "5.5.12"
}