{
    "comments": [
        {
            "author": null,
            "body": "Please see:\nhttp://tomcat.apache.org/faq/misc.html#tagbroken\n\nhttp://issues.apache.org/bugzilla/show_bug.cgi?id=16001",
            "date": "20070116T05:09:59",
            "id": 0
        },
        {
            "author": null,
            "body": "Well it has been a while since I reported this.  I am not sure the current\nstatus of the implementation right now. At the time I checked the code, there\nwas a bug in the way of picking the pooled instance, and since it was closed as\ninvalid I will assume it was not fixed.\n\nFrom the JSP spec:\n\"The JSP container may reuse classic tag handler instances for multiple\noccurrences of the corresponding custom action, in the same page or in different\npages, but only if the same set of attributes are used for all occurrences. If a\ntag handler is used for more than one occurence, the container must reset all\nattributes where the values differ between the custom action occurrences. If an\nattribute value is set as a request-time attribute value (using a scripting or\nan EL expression), the container must reset the attribute between all reuses of\nthe tag handler instance ...\"\n\n\nThe pool implementation is using attributes specified in the basic way for\nselecting a pooled instance. I mean:\n\n<mytag attr=\"1\"/>\n\nBut it is not considering the alternate way of specifying an attribute\n\n<mytag>\n<jsp:attribute name=\"attr\">1</jsp:attribute>\n</mytag>\n\n\nFrom the spec:\n\"The <jsp:attribute> action must only be used to specify an attribute value for\nstandard or custom actions.\"\n\nSo <jsp:attribute> is valid way of specifying an attribute for a custom action\nand TagLibs are actions, therefore, the container should use attributes defined\nby this mean when selecting the pooled instance.\n\nIn the example code I posted originally (when I reported the bug), the same\ninstance of the TagHandler is used, and although the attributes set differs,\nthose attributes are not reset as the specification states.\nFor the way the pool is implemented, a different instance should be used because\nan additional attribute is specified.\n\nAs a conclusion, if a properly developed TagHandler is used and one of its\nattributes is specified using <jsp:attribute>, which is completely valid, the\nobtained result could be wrong due to the way the Pool is implemented.\n",
            "date": "20071205T10:16:51",
            "id": 1
        },
        {
            "author": null,
            "body": "Thanks for the report. I have fixed this in trunk and proposed the fix for 6.0.x and 5.5.x",
            "date": "20090204T02:28:53",
            "id": 2
        },
        {
            "author": null,
            "body": "This has been fixed in 6.0.x and will be included in 6.0.19 onwards",
            "date": "20090220T14:46:20",
            "id": 3
        },
        {
            "author": null,
            "body": "This has been fixed in 5.5.x and will be included in 5.5.28 onwards.",
            "date": "20090603T15:12:33",
            "id": 4
        }
    ],
    "component": "Jasper",
    "description": "When i use a taglib twice in the same page and the two instances of these tags \nshare the same atrributes in the declaration but one of them have and attribute\nset using jsp:attribute, the value of this attribute is used in the other one too.\n\nExample\n<%@ taglib prefix=\"c\" uri=\"http://java.sun.com/jstl/core\" %>\n<html>\n<body>\n<h4>1 to 10 step 2</h4>\n<c:forEach var=\"i\" begin=\"1\" end=\"10\">\n<jsp:attribute name=\"step\">2</jsp:attribute>\n<jsp:body>\n  <c:out value=\"${i}\"/> \n</jsp:body>\n</c:forEach>\n<br>\n<h4>1 to 10 no step</h4>\n<c:forEach var=\"i\" begin=\"1\" end=\"10\" >\n  <c:out value=\"${i}\"/> \n</c:forEach>\n</body>\n</html>\n\nThe output is \n\nSimple Range Iteration\n1 to 10 step 2\n1 3 5 7 9\n1 to 10 no step\n1 3 5 7 9\n\nExpected\nSimple Range Iteration\n1 to 10 step 2\n1 3 5 7 9\n1 to 10 no step\n1 2 3 4 5 5 7 8 9\n\n\nThanks",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "38197",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 major",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "taglib pool bug when tag is used with jsp:attribute",
    "systemSpecification": true,
    "version": "5.5.12"
}