{
    "comments": [
        {
            "author": null,
            "body": "You (or Pluto in this case) gotta encode special characters like semicolon in\nthe URL.  For more help, see\nhttp://www.blooberry.com/indexdot/html/topics/urlencoding.htm.\n\nThat Jetty works is nice, it must do some automagical encoding / unencoding in\nthe background, but that by itself doesn't mean Tomcat is buggy here.",
            "date": "20060413T20:19:31",
            "id": 0
        },
        {
            "author": null,
            "body": "It was the case that Tomcat didn't handle %xx encoded ; characters in URLs\ncorrectly. It is fixed in 5.5.18 onwards. I am therefore assuming that this\nissue is fixed.",
            "date": "20061029T19:29:34",
            "id": 1
        }
    ],
    "component": "Catalina",
    "description": "Problem observed in a Pluto portlet.  If you submit a form, and one of the form\nfields (text box) has a ; in the value entered by the user, and you get a that\nname and value from the action request (e.g. servlet request) and call\nActionResponse.setRenderRequest(name, value), then Tomcat corrupts the next\nrequest.  This does not happen when the same code runs on Jetty.  Somehow that ;\nappears to be making it into a request URL.  Following are some comments from\nDavid DeWolf of Pluto.\n\n-------------------------\n\nRender parameters are stored within the url so that they persist across render\nrequests and do not rely on session state. The PortalControlParameter class is\nprimarily responsible for converting render parameters, modes, window states,\netc . . .to a portal url.\n\nSee:\n\nhttp://svn.apache.org/repos/asf/portals/pluto/branches/pluto-1.0.2/portal/src/java/org/apache/pluto/portalImpl/core/PortalControlParameter.java\n\nAlso See:\nhttp://svn.apache.org/repos/asf/portals/pluto/branches/pluto-1.0.2/portal/src/java/org/apache/pluto/portalImpl/core/PortalUrl.java\n\nI'm trying to think of any reasons why this conversion would be dependent upon\nthe underlying servlet container. The only thing I can think of is that the two\ncontainers are returning different values from request.getPathInfo() (which is\nsubsequently parsed back into modes, window states, and render parameters).\n\nI would be willing to bet that the issue is with the semi-colon in the\nparameter. A quick glance at the source code indicates that pluto does not treat\nit as a \"special\" character and thus it is not encoded within the url. If that\nis happening, I'll bet that tomcat is truncating pathInfo at the semi colon and\njetty is not.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "38390",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 major",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Pluto portlet fails if you set a render parameter including a ; in the value",
    "systemSpecification": true,
    "version": "5.5.9"
}