{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 18030\nPatch for o.a.c.startup.Bootstrap and o.a.c.startup.ClassLoaderFactory",
            "date": "20060405T22:20:17",
            "id": 0
        },
        {
            "author": null,
            "body": "Fixed. Thanks.",
            "date": "20060412T15:31:48",
            "id": 1
        }
    ],
    "component": "Catalina",
    "description": "I propose an enhancement for Bootstrap / ClassLoaderFactory.\nAt the moment, TC 5.5 gives the users the choice to define their class loader\nconfigurations in catalina.properties. Each class loader is being configured via\na comma seperated list of places to look for classes.\n\nNow Bootstrap and ClassLoaderFactory do something, a normal user does not\nexpect: they do not keep the order of the entries. They rearrange all entries,\nsuch that all directories are searched first, then all *.jar type entries and at\nthe end all URL form entries. This leads to unexpected code being loaded (e.g.\nin the case of adding product patches and adding instance specific classes etc.).\n\nI attach a patch, which does only slightly change the code, but includes the\nfollowing changes:\n\n1) Keep the order of entries when constructing the class loader\n2) allow ${catalina.home} and ${catalina.base} not only at the beginning of\ntokens (useful in the case of URLs)\n\nThe same patch applies to the yet unchanged classes in 6.0. If there is some\ninterest, I can contribute a patch for 5.0 as well.\n\nI hope someone has a little spare time left to review the patch.\n\nIn case the patch is being applied, I would also send some documentation for\ncatalina.properties.\n\nOne last word: TC 5.5 hs a comment\n\n# Please note that for individual jar files, e.g. bar.jar, you need the URL form\n# starting with file:.\n\nbefore shared.loader in catalina.proprties. This comment is no longer true in\n5.5, even without this patch.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "39218",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "RFE",
    "priority": "P2 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Wrong order in TC class loading",
    "systemSpecification": false,
    "version": "5.5.16"
}