{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 18424\nA patch that fixes the overwriting vary header bug\n\nThis change checks for existing Vary headers and will add to any existing\nvalues in the Vary header. If there is no existing Vary header then it will add\na new one as before.",
            "date": "20060607T17:19:32",
            "id": 0
        },
        {
            "author": null,
            "body": "Good catch: thanks for reporting this.",
            "date": "20061225T04:57:34",
            "id": 1
        },
        {
            "author": null,
            "body": "(In reply to comment #2)\n> Good catch: thanks for reporting this.\n\nOhh it was a nice xmas present that someone picked this up :)\n\nPlease note that the patch only patched\nHttp11AprProcessor.java\n\nThe other HttpProcessor.java needs fixing too. I'm not sure what the difference\nis between these files but they both have the same Vary bug.",
            "date": "20061225T06:41:16",
            "id": 2
        }
    ],
    "component": "Connector:Coyote",
    "description": "If you have a site that uses \"vary:\" headers such as \"vary: cookie\" to\ndistinguish between the cacheability of pages for cookied and non-cookied users\nthis header will get overwritten if you enable gzip negotiation in tomcats\nserver.xml config.\n\nIf gzip negotiation is enabled it should modify the vary header *not* overwrite it.\n\nThis is quite bad as enabling gzip in the config can currently cause incorrect\nfiles to get cached in browsers/proxies. By the time a developer realises that\nthe gzip functionality is broken in this way, various caches will hold the wrong\ncontent possibly for long periods of time even once gzip is turned off again.\n\nI suggest putting a warning in the server.xml against using gzip negotiation if\nyou are already using vary headers until this bug gets fixed.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "39402",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "enabling gzip negotiation overwrites existing \"vary:\" headers",
    "systemSpecification": false,
    "version": "5.5.0"
}