{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 18706\nPatch for SSI filter and servlet",
            "date": "20060812T19:29:01",
            "id": 0
        },
        {
            "author": null,
            "body": "Created attachment 18707\nPatch for DefaultServlet\n\nPlease note the two methods getBooleanInitParameter() and getIntInitParameter()\n- if someone with a better understanding of the Tomcat code layout could move\nthese into a utility class or similar, it would probably be better.",
            "date": "20060812T19:30:26",
            "id": 1
        },
        {
            "author": null,
            "body": "I am sure you mean well, but this is a bad idea, sorry. The only acceptable\nchange is for the parsing of the parameters, but it would need to be more\nconservative than this.",
            "date": "20060812T19:44:26",
            "id": 2
        },
        {
            "author": null,
            "body": "Perhaps Remy can elaborate on his reasoning for it being a bad idea so that\nJames can amend his patches.  Simply stating it is a bad idea without raising\nyour own concerns does not mean anything.",
            "date": "20060813T09:48:29",
            "id": 3
        },
        {
            "author": null,
            "body": "I too am not a big fan of just catching Throwables and treating them as\nExceptions.  I'm not going to touch the getXParameter code at the moment, but\nwill take a look at the catch(Throwable) parts.",
            "date": "20061225T05:45:08",
            "id": 4
        },
        {
            "author": null,
            "body": "OK, I've changed the classes (directly, not using your patches) to catch\nExceptions instead of Throwables, log them better, and generally be a little\nbetter citizens in this regard.  Thanks for reporting this.",
            "date": "20061225T06:07:53",
            "id": 5
        }
    ],
    "component": "Unknown",
    "description": "In multiple places throughout the Tomcat source code, java.lang.Throwable is\ncaught, and dealt with as if it was an Exception subclass, meaning that\njava.lang.Error subclasses may be ignored or dealt with inappropriately. I'm\nmaking this as a bug to hold patches I've been working on, for this problem.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "40241",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "java.lang.Throwable is caught inappropriately",
    "systemSpecification": false,
    "version": "5.5.17"
}