{
    "comments": [
        {
            "author": null,
            "body": "I'd assume this would just be lumped into JAVA_OPTS.  [That's what I do for most\neverything -- rather than chasing separate variables for debugging, etc, etc.]",
            "date": "20060918T14:36:09",
            "id": 0
        },
        {
            "author": null,
            "body": "If you want to tweak your script and contribute your patched script, that would\nbe much appreciated.  But I think Jess is correct, and I use his approach as well.",
            "date": "20070325T09:02:42",
            "id": 1
        },
        {
            "author": null,
            "body": "I had exactly the same problem. My suggestion when JMX is needed, is to put this setenv.sh in \"bin\" directory:\n\nif [ \"$1\" = \"start\" ] ; then\n    export CATALINA_OPTS=\"-Dcom.sun.management.jmxremote \\\n        -Dcom.sun.management.jmxremote.port=9004 \\\n        -Dcom.sun.management.jmxremote.authenticate=false \\\n        -Dcom.sun.management.jmxremote.ssl=false\"\nfi\n\nHowever this does not work on Windows, since catalina.bat does not pass the first (start/stop) parameter to setenv.bat\n\nIt would be great if this line in catalina.bat could be changed in the standard distribution:\nif exist \"%CATALINA_HOME%\\bin\\setenv.bat\" call \"%CATALINA_HOME%\\bin\\setenv.bat\"\n\nto this:\nif exist \"%CATALINA_HOME%\\bin\\setenv.bat\" call \"%CATALINA_HOME%\\bin\\setenv.bat\" %1\n\nThis way neither startup nor catalina scripts should be modified, JMX can be enabled from set solely from setenv, providing upgrade compatibility.\n\nI would also suggest changing documentation (monitoring.html) to recommend the method above, instead of modifying the startup script.",
            "date": "20081005T03:22:00",
            "id": 2
        },
        {
            "author": null,
            "body": "Note the previous message didn't make it to the dev list as I had redirected bug e-mail whilst I moved lots of bugs around.\n\n\nThe start up scripts already support this.\n\nJAVA_OPTS is used for start, stop & run\n\nCATALINA_OPTS is only used for start & run",
            "date": "20081005T03:39:13",
            "id": 3
        }
    ],
    "component": "Unknown",
    "description": "catalina.sh needs to have some type of environmental variable that allows the\nuser to just pass the JMX options for remote monitoring on startup.\n\nThe reason for this being is according to Sun's Documentation\nhttp://java.sun.com/j2se/1.5.0/docs/guide/management/agent.html if the port is\nalready bound to when the JVM is started it throws an Exception and exists the\nJVM.  So passing the JMX options via JAVA_OPTS or CATALINA_OPTS is setting it\nfor both startup and shutdown.  We only need this to be passed during startup. \nI can shutdown Tomcat ungracefully by using -force but that causes other\n'issues' in a cluster environment during startup b/c the sessions weren't\ncleaned up properly.\n\nI can go manually tweak my catalina.sh script to support this but the minute I\nupgrade Tomcat I've broken it and I need to reapply my fix.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "40534",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "P2 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "JMX Monitoring in Tomcat",
    "systemSpecification": false,
    "version": "Unknown"
}