{
    "comments": [
        {
            "author": null,
            "body": "I suppose the logical conclusion would be to look why the flag is false, rather\nthan resort to hacking. Most likely you are seeing concurrent access to the\nrequest object.",
            "date": "20061101T05:20:50",
            "id": 0
        },
        {
            "author": null,
            "body": "(In reply to comment #1)\n> I suppose the logical conclusion would be to look why the flag is false, rather\n> than resort to hacking. Most likely you are seeing concurrent access to the\n> request object.\n\nBut i´m an user and not a developer. As an user i cant do nothing to resolve the\nproblem. As i observe, the recycle must set to false! There is a finally clause\nthat force the recycle! I supose that or the recycle may throw an exception or\nan other process is accessing the request object.",
            "date": "20061101T06:42:11",
            "id": 1
        },
        {
            "author": null,
            "body": "A new request object is generated for each request. Therefore, the only ways I\ncan for what you report to happen are:\n- Multiple threads trying to read the parameters at the same time. This isn't\nsomething any of the internal Tomcat code does.\n- An exception during the parameter processing.\n\nI have added additional logging if the parameter processing fails to SVN and\nthis will be included in 5.5.21 onwards.\n\nIf you still see this problem post 5.5.21 and there is no helpful information in\nthe logs, please re-open and provide a test case so I can investigate further.",
            "date": "20061111T13:41:00",
            "id": 2
        }
    ],
    "component": "Catalina",
    "description": "Hi,\n\nI’m having a problem with parameters loses in tomcat. It’s an intermittent\nproblem. That occurs when I do some ajax’s request and then I do one or more\nform submissions. \n\nI put the tomcat in debug mode and  I observed the class CoyoteAdapter – the\nmethod service(). There exists a request variable (CoyoteRequest type) that has\na protected variable requestParametersParsed that is a flag to parse or not\nparse the parameters of a post or get. In the end of the method exists a\n‘finally’ clause that force the request variable to do a recycle. The recycle\nforces the requestParametersParsed variable to change to false. Then in the next\nutilization of the class the parameters will be parsed again. \n\nThe problem that I’ve found is in some situations (as described at the start)\nthe requestParametersParsed variable is true and the parameters are not parsed. \n\nThe consequence of this is that in my servlet when I ask request.getParameter(…)\nand it returns null but in my query string or in my post data has the parameter.\nThe prove of that is when I ask request.getQueryString() and it returns a not\nempty string with my parameter.\n\nEx:\n\nrequest.getQueryString() = servlet?param=x\nrequest.getParameter(‘param’) = null\n\n\nSee a pierce of the method service of CoyoteAdapter:\n \n    public void service(Request req, Response res)\n        throws Exception {\n\n…\n        try {\n\n            // Parse and set Catalina and configuration specific\n            // request parameters\n            if ( postParseRequest(req, request, res, response) ) {\n                // Calling the container\n                connector.getContainer().invoke(request, response);\n            }\n\n…\n        } finally {\n            // Recycle the wrapper request and response\n            request.recycle();\n            response.recycle();\n        }\n\n    }\n\nAt line “if postParseRequest(…” the request. requestParametersParsed must be\nfalse but in some situations it is true!\n\nI cant find the cause of the problem but I found the problem. To resolve my\nproblem I put a request.recycle(); before the line to force the\nrequestParametersParsed  variable to false.\nI don’t want to have a tomcat modified by me. Its not good. \n\nSee the post\nhttp://mail-archives.apache.org/mod_mbox/tomcat-dev/200601.mbox/%3C43D11EAA.1090905@amazon.com.br%3E\nHe is having the same problem.\n\nThanks\n\nThiago",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "40860",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "P2 critical",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Tomcat loses request parameters",
    "systemSpecification": true,
    "version": "5.5.9"
}