{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 19184\nsome JRockit Memory Leak Detector pictures and the script to send data",
            "date": "20061128T10:13:01",
            "id": 0
        },
        {
            "author": null,
            "body": "You seem to be in a hurry. You did not seem to notice it, but the cache is\nbounded and also configurable. Using the Servlet API provided methods for\nparameters handling with very large POSTs is inefficient and will lead to large\namounts of garbage collections.\n\nIf you'd like me to look into adjusting the defaults or some of the behavior of\nthe cache, you should send me an explanation I can understand (unlike these\nscripts).",
            "date": "20061128T15:46:47",
            "id": 1
        },
        {
            "author": null,
            "body": "Ok, I understand the script I think. The first one generate a:\n\"firstname=xxxxxxx[long]xxxxxxxx\" line. The second makes a number of requests\nwhile appending a number to it. Solution: the string cache is useful, but\nthere's little point caching large strings.",
            "date": "20061128T16:06:48",
            "id": 2
        },
        {
            "author": null,
            "body": "(In reply to comment #3)\n> Ok, I understand the script I think. \n\nYes, the script works exactly how You said. I created it just to isolate the\nproblem from my real app where I need to POST many large Strings (could be\nmegabytes). \n\nFirst, I don't understand why there is a need to cache request parameters for a\nlonger duration than it takes to process the request. It would be useful only in\nvery rare cases: if clients would make the exact same request many times.\n\nSecond, I could not confgure the cahce in a useful way. These are default \nStringCache settings in catalina.properties:\n\n# String cache configuration.\ntomcat.util.buf.StringCache.byte.enabled=true\n#tomcat.util.buf.StringCache.char.enabled=true\n#tomcat.util.buf.StringCache.trainThreshold=500000\n#tomcat.util.buf.StringCache.cacheSize=5000\n\nThe byte cahce is enabled by default and the memrory leak occurs.\n\nI tried to avoid the leak by trying different configurations and here is what I\ndiscovered:\n\n1) The leak does not appear if the byte cache is disabled\n(...StringCache.byte.enabled=false). But disabled cache can't be useful at all.\n\n2) I don't know what is the purpose of trainTreshold property, but that is the\nonly property that can help: setting it low enough (even extremely low) avoids\nthe leak. For example, lowering trainTreshold to 100 for 10kB requests avoids\nthe leak, but isn't that the same as disabling the cache?\n\n3) Limiting the cache size does not work as expected - for example, with\ncacheSize=1 the large requests still lead to exhaustion of heap memory. Digging\nwith Memory Leak Detector shows that _all_ the request parameters still stay in\nheap, referenced by a static field in org.apache.tomcat.util.buf.StringCache.\n",
            "date": "20061129T06:36:18",
            "id": 3
        },
        {
            "author": null,
            "body": "This cache caches the result of the conversion of byte[] to String. This is an\nexpensive operation since it includes many allocations and B2C  operations(which\nmakes the cache lookup cost insignificant as long as no sync occurs), and it's a\nbit of an experiment.\n\nThe way the cache works is that it looks for a while at the strings the webapp\nis using, build usage data (for example, the attributes names, etc, are going to\nbe used oftem), and then generates a static cache out of that.\n\nThe cache is supposed to be relatively small, however, so if it can get too big\nit's bug. I added a limit on the String size in the code along with a new system\nproperty, which should be all that is needed.",
            "date": "20061129T08:21:41",
            "id": 4
        },
        {
            "author": null,
            "body": "This has been fixed by Remy in SVN for 6.0.x and I have ported his fix to 5.5.x.\n\nThe fix will be included in 5.5.21 and 6.0.3 onwards.",
            "date": "20061202T12:12:26",
            "id": 5
        }
    ],
    "component": "Catalina",
    "description": "POST parameter values stay referenced by a static field in\norg.apache.tomcat.util.buf.StringCache - thus the GC can never release the memory.\n\nSteps to Reproduce:\n1) install and start tomcat 5.5\n(http://apache.zone-h.org/tomcat/tomcat-5/v5.5.20/bin/apache-tomcat-5.5.20.zip)\n\n2) see the example webapp \"Request Parameters Example\" included in the install\n(http://localhost:8080/servlets-examples/servlet/RequestParamExample)\n\n3) run script \"send.sh\" to create heavy load\n#!/bin/bash\n\nexport LEAK_COMMAND='curl --silent\nhttp://localhost:8080/servlets-examples/servlet/RequestParamExample --output\nresponse.htm --data @send.txt'\n\n#create initial POST parameter with value about 10kB\n\necho \"firstname=\" > send.txt\nfor((i=0;$i<=10000;i=$(($i+1))));do\n  echo -n \"x\" >> send.txt\ndone\n\n\n#send the request\nfor((i=0;$i<=1000;i=$(($i+1))));do\n  echo $i\n  # modify the param value to send (append i)\n  echo -n $i >> send.txt\n  \n  $LEAK_COMMAND\n\ndone\n\n4) running the script causes heap usage to increase for some 40MB",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "41057",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Tomcat leaks memory on every request",
    "systemSpecification": true,
    "version": "5.5.20"
}