{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 20023\na patch that fixes this bug",
            "date": "20070423T14:08:36",
            "id": 0
        },
        {
            "author": null,
            "body": "If you could explain how this patch is a good idea and solves something, I would\nbe interested :)",
            "date": "20070423T14:22:06",
            "id": 1
        },
        {
            "author": null,
            "body": "in the current code tomcat gets all the URLs from the URLClassloader, and call\nthe getFile() method to get the file name, after it creates a File object and\ngets the CanonicalName to create the final File object that will be used later ...\nbut the CanonicalName when it is running on windows and has spaces on the name,\nis some thing like:\nProgram%20Files/...\nwhen the file object is created, and the exists method is called it returns\nfalse because the File object does not know how to convert %20 to \" \" ...\nif you look at the code in the patch, instead of calling the getFile, creating a\nFile object, getCanonicalName, create another File object that does not know how\nto handle %20 ...\n\nI just take the original URL object, call the toURI method and pass it to the\napropriate File constructor that will handle the %20 correctly ...\n\nwith this patch it works fine, and loads the TLDs from the applications that are\nin directories with spaces in the names ...",
            "date": "20070423T15:43:41",
            "id": 2
        },
        {
            "author": null,
            "body": "Ok, but your patch was not good (not all URLs are %xx encoded).",
            "date": "20070424T06:42:48",
            "id": 3
        },
        {
            "author": null,
            "body": "but the URI class understand all URI formats, being it %xx encoded or not ...",
            "date": "20070424T07:17:08",
            "id": 4
        },
        {
            "author": null,
            "body": "How about stopping using \"...\" ?\nThe issue has been fixed in the 6 branch, but not using your patch.",
            "date": "20070424T07:44:31",
            "id": 5
        },
        {
            "author": null,
            "body": "Ok, I'll not use \"...\" \nthe fix is already in the trunk? I have just tested it and it still not working",
            "date": "20070424T08:02:46",
            "id": 6
        },
        {
            "author": null,
            "body": "testes in tomcat 6 trunk and the bug still there.",
            "date": "20070425T07:37:02",
            "id": 7
        },
        {
            "author": null,
            "body": "This is not the case. Please do not reopen this bug report.",
            "date": "20070425T08:00:46",
            "id": 8
        },
        {
            "author": null,
            "body": "so this bug will not bi fixed?\nchange it to wont be fixed, but not to fixed, because it is not fixed.",
            "date": "20070425T09:07:34",
            "id": 9
        },
        {
            "author": null,
            "body": "If you're out there to post nonsense, then I suggest you do not post (it is very\neasy to verify the patch I committed will fix the problem you reported, and I\nhave also tested the fix). This is a bug report, not your blog.",
            "date": "20070425T09:11:18",
            "id": 10
        },
        {
            "author": null,
            "body": "sorry, it appears that I was having a problem with the proxy I'm behind here.\nI updated twice the sources and it was not downloading did not had your patch.\nI had to download all again from another network without a proxy to get the\nsources with your patch applied.\nSorry again.",
            "date": "20070425T09:36:32",
            "id": 11
        }
    ],
    "component": "Catalina",
    "description": "if you install tomcat or a web application in a directory with spaces in the\nname, for example \"C:\\Program Files\\vds\\tomcat\" for tomcat or \"C:\\Program\nFiles\\vds\\console\" for a web application.\nthe TLD files that are inside the META-INF directory of the jar files will not\nbe loaded.\n\nthe problem is is the file treatment inside the TldConfig class ...\nI have attached a patch with the correction.\nthis bug is found in Tomcat 6 too",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "42202",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "P2 major",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "if you install tomcat in a directory with spaces it ignores TLD files inside jar files",
    "systemSpecification": true,
    "version": "5.5.24"
}