{
    "comments": [
        {
            "author": null,
            "body": "According to the HTTP spec there is one space character between the method and\nthe URL - i.e. your request is invalid HTTP.\nhttp://tools.ietf.org/html/rfc1945#page-23\n\nThis ticket should probably be marked INVALID, but the error response doesn't\nlook appropriate - the response should probably be a 400 Bad Request.\n",
            "date": "20070626T17:56:32",
            "id": 0
        },
        {
            "author": null,
            "body": "(In reply to comment #1)\n> According to the HTTP spec there is one space character between the method \nand\n> the URL - i.e. your request is invalid HTTP.\n> http://tools.ietf.org/html/rfc1945#page-23\n> This ticket should probably be marked INVALID, but the error response doesn't\n> look appropriate - the response should probably be a 400 Bad Request.\n\nThank you for pointing me in the right direction. After reading the Http spec \nI have to agree with you that the Http is invalid. A point could be made that \nthe spec should be followed exactly when sending and be more forgiving when \nreceiving, but that is another issue.  I have passed the information you \nprovided to Software AG, who is now looking into making changes to correct the \nHttp on their end (in Natural).  Thanks again!",
            "date": "20070709T07:43:44",
            "id": 1
        },
        {
            "author": null,
            "body": ">According to the HTTP spec there is one space character between the method and\n>the URL - i.e. your request is invalid HTTP.\n>http://tools.ietf.org/html/rfc1945#page-23\n\n>This ticket should probably be marked INVALID, but the error response doesn't\n>look appropriate - the response should probably be a 400 Bad Request.\n\nIt is true that in the RFC the Request line is made up of single spaced\nelements, but if you look at appendix b\n(http://tools.ietf.org/html/rfc1945#page-55) it says \n\"   Clients should be tolerant in parsing the Status-Line and servers\n   tolerant when parsing the Request-Line. In particular, they should\n   accept any amount of SP or HT characters between fields, even though\n   only a single SP is required.\n\"",
            "date": "20071205T10:05:57",
            "id": 2
        },
        {
            "author": null,
            "body": "I have same 505 error with Natural 4.2 make a post on a tomcat 5 but after\nanalyse it, i have a different conclusion.\n\nThis for me doesn't work even if we remove space :\n\nPOST http://C010030S:5599/NXAServer/NextAxiomServer HTTP/1.0\n\nTomcat only accept this request :\n\nPOST /NXAServer/NextAxiomServer HTTP/1.0\nHost: C010030S:5599",
            "date": "20080213T01:42:14",
            "id": 3
        },
        {
            "author": null,
            "body": "I have committed a patch to trunk that makes the parsing of the request line tolerant of multiple SP and/or HT. The patch has been proposed it for 6.0.x and 5.5.x\n\nI have also tested the example given in comment #4 and cannot reproduce that issue.",
            "date": "20080519T13:10:23",
            "id": 4
        },
        {
            "author": null,
            "body": "This patch has been applied to 6.0.x and will be in 6.0.17 onwards.",
            "date": "20080611T13:04:38",
            "id": 5
        },
        {
            "author": null,
            "body": "This has been fixed in 5.5.x and will be included in 5.5.27 onwards.",
            "date": "20080730T14:01:40",
            "id": 6
        }
    ],
    "component": "Connector:Coyote",
    "description": "When a Tomcat based Http listener receives a Soap request with more than one \nspace between the \"POST\" command and the URL, this error response is returned \nby Tomcat version 5.5.20, and there is no response at all from other versions \n(4.0.2 and 5.0):\n\nHTTP/1.1 505 HTTP Version Not Supported\nServer: Apache-Coyote/1.1\nDate: Fri, 08 Jun 2007 22:19:07 GMT\nConnection: close\n\nHere is what I mean about there being more than one space between the Post and \nthe URL.  In the examples below I leave out the body of the Soap request for \nsimplification.  I used the TCPMonitor supplied by the Apache project to \ncapture a Soap request and here is how it is displayed in the monitor (it \nprobably looks completely different on the wire):\n\nPOST    http://C010030S:5599/NXAServer/NextAxiomServer HTTP/1.0\n\nUser-Agent: Natural 4.2\nContent-Type: text/xml; charset=utf-8\nSOAPAction: urn:rpc?path=Training.webMethods.validateUserid\nContent-Length: 338\n\nNote the four spaces between the \"POST\" and the URL in the first line.  Now \nhere is what the request looks like after removing three of the four spaces:\n\nPOST http://C010030S:5599/NXAServer/NextAxiomServer HTTP/1.0\nUser-Agent: Natural 4.2\nContent-Type: text/xml; charset=utf-8\nSOAPAction: urn:rpc?path=Training.webMethods.validateUserid\nContent-Length: 338\n\nThe request seems to only get handled correctly by the Tomcat HTTP listener \nwhen there is one space between the \"Post\" and the URL.  \n\nThis example is from a Soap request issued by a Natural program running on a \nZ/OS mainframe.  Instead of sending you a complete example to recreate the \nproblem (which would require a mainframe) it would probably be easy to use the \nApache TCP Monitor to capture a Soap request from an available test system and \nthen add one of more spaces between the Post and the URL, resend the request \nin the monitor and see what happens.  \n\nWhat I'm trying to do is invoke from Natural on a mainframe (which \nunfortunately we have no control over) a web service running on webMethods \n(IntegrationServer version 6.1 which uses Tomcat402B.jar, so that may be \nversion 4.0.2B (?), and JVM 1.4.2_13). No response is returned at all from \nthat version.  I then tried to do the same thing with webMethods version 6.5 \n(which uses Tomcat 5.0 and JVM 1.4.2_07) and still got no response.  Then I \ntried NextAxiom version 6.5.2.0 (which uses Tomcat version 5.5.20) and I at \nleast got a response from it (see the response at the top of this \ndescription).  I then tried invoking web services that use other Http \nlisteners and found the two I tried handled the Soap request just fine.  One \nexample is IBM HTTP Server (version 1.3.8) that is running on a WebSphere \nserver; it handles the request with more than one space just fine (by \"fine\" I \nmean it recognized the URL and handed it off to the process at that URL).  The \nother I don't know much about; it was just some remote web service I found on \nthe web (http://www.webserviceX.NET).\n\nI have looked through the Apache Tomcat website, documentation and an \nassociate looked through the bug database for version 5, and we can't find \nanything that addresses this problem.  I downloaded the source code, but got \nlost looking around and decided to ask for some help to find and fix this \nproblem.  Or maybe someone has an idea on how to configure the Http listener \nto handle this better.\n\nIf this is a bug, I would be more than happy to attempt to fix this myself if \nsomeone could point me in the right direction.\n\nThank you very very much for your time and efforts.\n\nDick Salisbury\nIdaho Power Company\ndsalisbury@idahopower.com",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "42750",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "P3 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Http Post requests not handled correctly if there is more than one space between the \"POST\" and the URL",
    "systemSpecification": true,
    "version": "5.5.20"
}