{
    "comments": [
        {
            "author": null,
            "body": "This is by design.\n\nThe installer has been updated to make is clearer what the checkbox actually\nmeans which is \"do you want this service to start automatically when windows\nstarts\" rather than what it previously suggested \"do you want to install a\nTomcat service\"\n\nThis fix will be in the next 5.5.x release.\n\nIf you want to install multiple instances, use the zip. It includes service.bat\nwhich can be used to add multiple services with different names.",
            "date": "20070803T04:53:06",
            "id": 0
        },
        {
            "author": null,
            "body": "OK - so I was simply mislead by the terse \"Service\" (or whatever the checkbox \nwas labeled with) to believe, that this would NOT install a service, if \nunchecked. Thanks for clarifing this!\n\nBTW: how about separating this into TWO checkboxes, one labeled e.g. \"register \nas service\" and an indented \"sub-checkbox\" labeled \"automatically start with \nthe system\", i.e. something like:\n\n...\n[ ] register as service\n    [ ] automatically start this service when system boots.\n...\nIdeally, the indented checkbox would only be accessible, if the parent is \ndeselected, i.e. grayed out, if the register is deselected.\n\nAnd, in that latter case (i.e. if the user deselected the \"register...\" \noption) then install that startup.bat file to /bin instead. \n\nOr frankly, I don't really see, why one could not install that startup.bat \n*always*. If the user has stopped or disabled the service, but still wants to \nstart tomcat temporarily by hand, (s)he could use that startup.bat.\n\nAt least *I* would find that very handy for testing! :-)\n\nMichael\n",
            "date": "20070803T06:10:44",
            "id": 1
        }
    ],
    "component": "Unknown",
    "description": "Hello,\nfor test reasons I had to install several versions of Tomcat (v6.0 and 5.5.23 \nin this case). Doing so, I had to learn, that the Windows-Installer for Tomcat \nobviously ALWAYS tries to enter Tomcat as a system service, even if the \ncorresponding checkbox in the config dialog has been UNchecked. This is a bit \nannoying, since \n1.) if another Tomcat version has already been installed before, then during \nthe installation one gets an error, that entering Tomcat as a system service \nfailed (=> abort/retry/ignore).\n2.) during subsequent reboots one is now always pestered with an error message \nthat a service(namely the one whose entry failed - see above) failed to start.\n\nSo, the Tomcat installer would either have to obey the check box and NOT enter \nthe app as a service unless told so, \nOR\nthe *names* (and maybe further settings - don't know what's all required for \nthe installation of a Windows Service) would need to be sufficiently distinct \nso that several installations could happily co-exist as different services. Of \ncourse, in that case, one would need to make sure that portnumbers (and \nprobably misc. other settings, too) would have to be distinct, or that at any \ntime only one of those installed services would actually be running, but \nthat's another issue, that the user/admin would have to take care of.\n\nRegards,\nMichael",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "43020",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P2 minor",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Tomcat always tries to install as service on Windows",
    "systemSpecification": true,
    "version": "5.5.23"
}