{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 20908\nPatch tha implements this functionality\n\nThis patch implements the functionality described in this issue. It was created\nagainst the current trunk of /repos/asf/tomcat/container/tc5.5.x\n\nThe patch does not add the new properties in the non-English resource bundles.\nI was not sure if I should add them or not.",
            "date": "20071002T14:50:14",
            "id": 0
        },
        {
            "author": null,
            "body": "The version for this issue should be 5.5.25, but that version is not yet\navailable here in Bugzilla.",
            "date": "20071002T14:51:24",
            "id": 1
        },
        {
            "author": null,
            "body": "I would have thought you would want some control over which manager instance you\nhit in most cases. We usually make the manager app directly accessible to admins\nvia an alternative port.",
            "date": "20071004T18:34:34",
            "id": 2
        },
        {
            "author": null,
            "body": "Yes, for actually managing the web applications (starting and stopping etc.),\nyou want to be sure which server you are using. For such tasks we use dedicated\nports.\n\nHowever, for the server status information it is interesting to see which\nmachine is answering the current request.",
            "date": "20071005T09:04:52",
            "id": 3
        },
        {
            "author": null,
            "body": "Set the correct \"Version\".",
            "date": "20080104T03:49:44",
            "id": 4
        },
        {
            "author": null,
            "body": "It took rather a long time but this has been applied to 7.0.x and will be included in 7.0.17 onwards.\n\nI don't see this being back-ported to 6.0.x or 5.5.x.",
            "date": "20110615T21:58:01",
            "id": 5
        }
    ],
    "component": "Webapps:Manager",
    "description": "We have an environment with a couple of load-balanced Tomcats fronted by httpd.\nIf someone accesses the manager application through the load-balancer, they will\nnot know which of the load-balanced Tomcats they end up at. In these situations,\nand others as well, it would be nice if the manager could tell the hostname and\nIP address of the machine it is running on.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "43538",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "P2 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "[patch] Show the hostname and IP address in the manager webapp",
    "systemSpecification": false,
    "version": "5.5.25"
}