{
    "comments": [
        {
            "author": null,
            "body": "Created attachment 21735\nPath to ServerCookie to include HttpOnly option\n\nThis patch will effect great change to many classes in Tomcat. But the change is simple, and is compliant with the original source on this functionality enhancement at http://msdn2.microsoft.com/en-us/library/ms533046.aspx",
            "date": "20080330T02:42:32",
            "id": 0
        },
        {
            "author": null,
            "body": "Created attachment 21736\nPatch for Request to include HttpOnly support from SessionCookie",
            "date": "20080330T02:53:41",
            "id": 1
        },
        {
            "author": null,
            "body": "Created attachment 21737\nPatch for Response to include HttpOnly support from SessionCookie and Request",
            "date": "20080330T02:54:14",
            "id": 2
        },
        {
            "author": null,
            "body": "Supported browsers :     \n* IE 7.0\n* Firefox >= 2.0.0.5\n* Firefox 3.0 beta\n* Camino 1.5.4\n* IE 6.0 sp1+\n* Opera 9.50 beta+\n\nSafari underway, see: http://bugs.webkit.org/show_bug.cgi?id=10957\n",
            "date": "20080330T03:05:15",
            "id": 3
        },
        {
            "author": null,
            "body": "Created attachment 21741\nPatch for HttpOnly support in javax.servlet.http.Cookie",
            "date": "20080331T12:44:09",
            "id": 4
        },
        {
            "author": null,
            "body": "Created attachment 21742\n Patch to ServerCookie to include HttpOnly option\n\nSince this patch changes today's behavior, added code to provide backwards compatibility that defaults to HttpOnly being turned off for this initial release. Would like to default this to on, someday.",
            "date": "20080331T12:52:58",
            "id": 5
        },
        {
            "author": null,
            "body": "All the major browsers supporting it... It is useful for the security of web applications and can help prevent XSS (if not XST). This isn't really a big change to the code and should be done quickly.\n\nAnd if anyone is thinking its only a Microsoft hack, then today we shouldn't have AJAX in web programming.",
            "date": "20080711T15:58:57",
            "id": 6
        },
        {
            "author": null,
            "body": "The Servlet 3.0 spec EDR includes support for HttpOnly cookies.  I've come up with an untested 3.0 EA api jar for geronimo including the api change.\n\nSource code at https://svn.apache.org/repos/asf/geronimo/specs/trunk/geronimo-servlet_3.0_spec\n\nsnapshots at http://people.apache.org/repo/m2-snapshot-repository/org/apache/geronimo/specs/geronimo-servlet_3.0_spec/1.0-EA-SNAPSHOT/\n",
            "date": "20080712T09:28:32",
            "id": 7
        },
        {
            "author": null,
            "body": "Thank you for your support to see my HttpOnly session id patch get pushed into a future release of Tomcat. Several of the committers tell me that this patch will indeed go live in a future release - after the recent dramatic and dramatic changes to cookie encoding settles down.\n\nThe patches I submitted are rather simple, this is not rocket science. (And it will indeed break very old/obscure browsers like IE 5.5 on Mac). My patch does not change anything by default - it requires a configuration change to make the JSESSIONID cookies HttpOnly. I prefer secure by default, but I think this is a fair compromise to encourage the powers-that-be to push this live, hopefully soon. ",
            "date": "20080724T18:47:23",
            "id": 8
        },
        {
            "author": null,
            "body": "> And it will indeed break very old/obscure browsers like IE 5.5 on Mac\n\nIf only :-) But IE on Mac never reached 5.5, it stopped at 5.02.",
            "date": "20080725T00:27:00",
            "id": 9
        },
        {
            "author": null,
            "body": "Actually, the final mac IE version was 5.2.3, see  http://en.wikipedia.org/wiki/Internet_Explorer_for_Mac but you got my point, I hope. HttpOnly in VERY rare cases \"breaks the browser\" so my patch only enables HttpOnly session cookies if a configuration file change is made.",
            "date": "20080725T00:30:08",
            "id": 10
        },
        {
            "author": null,
            "body": "I have applied a variation of your patches to trunk and will propose them for 6.0.x and 5.5.x shortly. The main differences are:\n\n1. No change to the Servlet API classes. Whilst this is in the 3.0 draft, the API isn't defined and whilst I am reasonably sure what it will look like I don't want to risk API breakage when the 3.0 API is published.\n\n2. It is enabled by default in trunk and will be enabled by default in Tomcat 7.x. I will propose the same default for 6.0.x and 5.5.x but we'll need to see which way the votes go.\n\n3. It is configured via the Manager. Where there is an option to use the standard Tomcat configuration mechanism I prefer to use it. System properties should be reserved for configuration that doesn't fit with a standard component or would require some ugly hacks to do so. This was a nice, simple fit with the Manager.",
            "date": "20080913T10:44:28",
            "id": 11
        },
        {
            "author": null,
            "body": "Mark, thank you! I'm a big fan of the choices you made here in terms of proposing default-on for tomcat 5/6 and easy configuration via the Tomcat Manager.\n\nRight ON! I can't wait to see this go live!",
            "date": "20080914T07:00:35",
            "id": 12
        },
        {
            "author": null,
            "body": "I don't think I was too clear in my previous comment. Configuration isn't via the Manager app it is via the Manager element that may be placed within a Context element in the configuration files. ie a new attribute has been added to http://tomcat.apache.org/tomcat-6.0-doc/config/manager.html",
            "date": "20080914T07:11:43",
            "id": 13
        },
        {
            "author": null,
            "body": "Thanks for the clarification, Mark. If I'm reading this right - you are placing the HttpOnly configuration option within the context of one virtual host instead of a global system property?\n",
            "date": "20080914T14:19:30",
            "id": 14
        },
        {
            "author": null,
            "body": "With the current trunk implementation, you would need to do the following to disable HttpOnly\n\n<Context>\n  <Manager useHttpOnly=\"false\" />\n</Context>\n\nAs with any Context configuration you could set this for an individual Context, all Contexts within a host or every Context within a Tomcat instance.",
            "date": "20080914T15:57:13",
            "id": 15
        },
        {
            "author": null,
            "body": "This has been implemented in 6.0.x and will be included in 6.0.19 onwards. It is disabled by default so you need to use:\n\n<Context>\n  <Manager useHttpOnly=\"true\" />\n</Context>\n\nto enable it.",
            "date": "20090301T04:49:28",
            "id": 16
        },
        {
            "author": null,
            "body": "As the original poster of the feature request back in Feb 08, I want to extend my sincere gratitude to the Mark and the Tomcat team for adding this patch to trunk! \n\nThank you, Gents!",
            "date": "20090305T12:47:18",
            "id": 17
        },
        {
            "author": null,
            "body": "Created attachment 23497\nPort of httpOnly to 5.5.x\n\nNote that the implementation was subsequently changed to do the configuration on the Context element rather than the Manager.\n\nI have also attached a port of the Tomcat 6.0.x implementation to Tomcat 5.5.x",
            "date": "20090416T03:23:37",
            "id": 18
        },
        {
            "author": null,
            "body": "(In reply to comment #17)\n> This has been implemented in 6.0.x and will be included in 6.0.19 onwards. It\n> is disabled by default so you need to use:\n> \n> <Context>\n>   <Manager useHttpOnly=\"true\" />\n> </Context>\n> \n> to enable it.\n\nThis was moved out of Manager with http://svn.apache.org/viewvc?rev=750918&view=rev but is still documented in webapps/docs/config/manager.xml - missed removing the documentation in the Standard Manager Implementation section. \n\nThis is Context only, i.e. the following will do the trick:\n\n<Context useHttpOnly=\"true\">\n...\n</Context>",
            "date": "20090611T09:32:19",
            "id": 19
        },
        {
            "author": null,
            "body": "Sorry about that. I just removed it from trunk and 6.0.x",
            "date": "20090611T09:44:45",
            "id": 20
        },
        {
            "author": null,
            "body": "This has been applied to 5.5.x and will be included in 5.5.28 onwards.",
            "date": "20090613T13:27:39",
            "id": 21
        },
        {
            "author": null,
            "body": "(In reply to comment #22)\n> This has been applied to 5.5.x and will be included in 5.5.28 onwards.\n\nOn Tomcat 5.5.28, when using context.xml.default to setup attributes for all contexts, this appears to have no effect. For example, in my context.xml.default for a particular host I have: \n\n<Context reloadable=\"true\" swallowOutput=\"true\" crossContext=\"true\" allowLinking=\"true\" unpackWAR=\"false\" useHttpOnly=\"true\">\n\nAnd yet if I setup a page with: \n\n<script type=\"text/javascript\">\ndocument.write(document.cookie);\n</script>\n\nI still get cookie information written to the output: \n\nJSESSIONID=A7FB0749E8CDE79E7687E2DABF932BE2; JSESSIONID=7924B5D74D10AD458191C6292196C87A \n\nDo I need to specify this individually for every context?",
            "date": "20100131T12:23:31",
            "id": 22
        }
    ],
    "component": "Servlet & JSP API",
    "description": "JavaScript currently has access to the JSESSIONID cookie, access that is never\nrequired of any application. IE 6.0 and Firefox (as of 2.0.0.5) now support the\nHTTPOnly flag than when added to a cookie will prevent document.cookie calls\nfrom JavaScript blocking a large class of security vulnerabilities such as XSS\n(Cross Site Scripting). I would like to add HTTOnly support to the Tomcat\nservlet session manager, turned ON by default, but give the server\nmanager/programmer the ability to turn this off. Although this is an\nenhancement, this is really a needed security patch that will only add to the\nglory of Tomcat Servlet support.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "44382",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "P1 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Need to add support for HTTPOnly session cookie parameter",
    "systemSpecification": false,
    "version": "Unknown"
}