{
    "comments": [
        {
            "author": null,
            "body": "Many thanks for the patch. I modified it slightly and committed it to the jk docs. It will be in the next release.",
            "date": "20080507T00:26:16",
            "id": 0
        },
        {
            "author": null,
            "body": "Many thanks for the patch. I modified it slightly and committed it to the jk docs. It will be in the next release.",
            "date": "20080507T00:26:34",
            "id": 1
        }
    ],
    "component": "Connector:Coyote",
    "description": "Created attachment 21928\nAdds instruction for IIS 6 to add dll as a Web Service Extension\n\nOverview:\nUsing the current instructions off of the apache web site, the isapi_redirect.dll will not successfully run in IIS 6.0.\n\nSteps to Reproduce: \n On Windows Server 2003 running IIS 6 install the isapi_redirect.dll following the directions in 'Configuration' at http://tomcat.apache.org/connectors-doc/webserver_howto/iis.html#Configuring%20the%20ISAPI%20Redirector\nWhen you're done, he configuration looks complete.\n\nActual Result:\nThe connector is filtering the request, and entries will be made in the log file proving that the connector is reading and matching requests. However, the requests do not get forwarded to Tomcat.\n\nExpected Result:\nThe connector should be forwarding requests that match the entries in uriworkers.properties to the Tomcat instance specified by the matched worker.\n\nBuild & Platform:\nSetup: \n Win Server 2k3\n IIS 6.0\n Tomcat 5.5 (JBoss 4.0.4)\n isapi_redirect-1.2.26.dll\n isapi_redirect-1.2.25.dll\n isapi_redirect-1.2.15.dll\n IE 5,6 Firefox 2.0.0.14\n\nFurther Information:\nThe required information is already on the atlassian website, however it should probably be included in the core documentation at apache. Googling turns up more instances of people having this problem before returning atlassian's page.\nhttp://confluence.atlassian.com/display/DOC/Setting+up+Confluence+with+IIS\n(Scroll down to the section titled IIS 6.0)\n\nSeverity:\nSet to normal as this only impacts a very specific configuration. However, in that configuration it's critical as it prevents any normal operation of the connector.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "44946",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "tomcat-connector How-to for IIS 6.0 should include adding Web Service Extensions",
    "systemSpecification": true,
    "version": "Unknown"
}