{
    "comments": [
        {
            "author": null,
            "body": "I've propose a backport of the Accept-Ranges fix for 5.5.x",
            "date": "20081013T04:58:32",
            "id": 0
        },
        {
            "author": null,
            "body": "Making MIME type matching case insensitive is an enhancement so I will change the severity of this bug once the accept range fix has been applied",
            "date": "20081101T17:59:06",
            "id": 1
        },
        {
            "author": null,
            "body": "There are two issues in OP's report.\n\nThe 'making MIME type matching case insensitive' part of this issue is addressed as bug #45995. Thus I narrowed the Summary.",
            "date": "20090102T08:37:58",
            "id": 2
        },
        {
            "author": null,
            "body": "This has been fixed in 5.5.x and will be included in 5.5.28 onwards.",
            "date": "20090603T14:02:23",
            "id": 3
        }
    ],
    "component": "Catalina",
    "description": "Hi,\n\nOn the dev-tomcat list I described in the topic \"Byte Serving and PDFs with the DefaultServlet\" an issue that I had with Tomcat to serve PDFs.\n\nAnalysing the answers I could find that the matter was related to the case of the file extension. Today Tomcat is case sensitive for MIME type extensions.\n\nSo the solution for me was enter two MIME specifications on the web.xml file. One is for \"pdf\" and another one for \"PDF\".\n\nThis way I would like to ask for and request for enhancement to make Tomcat be able to, due a setup on configuration file, consider or not case for MIME type extensions.\n\nAbout the HTTP response header, I would like to have \"useAcceptRanges\" Feature as default for src.share.org.apache.catalina.servlets.DefaultServlet. It was already added on Tomcat after 6.0.18.\n\nRegards,\n\nVitor",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "45996",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "BUG",
    "priority": "P5 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "allow byte serving with HTTP response header",
    "systemSpecification": false,
    "version": "5.5.27"
}