{
    "comments": [
        {
            "author": null,
            "body": "I am curious as to which elements you are trying to log that require UTF-8. Most will be ISO-8859-1. The only exceptions I can think of are user name and session attribute values.\n\nI am concerned that whilst an access log is typically configured at the host level the user name encoding can vary from request to request (if you are using FORM) and session attributes are under no obligation to use a single consistent encoding. Therefore, it would be rather difficult to ensure the correct logging of each of these elements.\n\nGiven the above I am not in favour of using UTF-8 by default.\n\nHowever, I can see the potential of making the encoding configurable with the default being the current behaviour. Therefore, I am marking this as an enhancement.\n\nPatches are always very welcome and if you are interested in writing such a patch and need any assistance feel free to ask on the dev list.",
            "date": "20090416T14:38:59",
            "id": 0
        },
        {
            "author": null,
            "body": "Implemented in 7.0 with r11145200 and will be in 7.0.19.",
            "date": "20110711T15:16:40",
            "id": 1
        },
        {
            "author": null,
            "body": "Created attachment 27278\n2011-07-11_tc6_bug46252.patch\n\nCorrection: that revision number above was r1145200\n\nHere is patch that will be proposed for Tomcat 6.\nBackport to Tomcat 5.5 is unlikely.",
            "date": "20110711T16:01:05",
            "id": 2
        },
        {
            "author": null,
            "body": "Created attachment 27279\n2011-07-11_tc6_bug46252_v2.patch\n\nUpdated patch: added r1145237\n\nThis adds\nin AccessLogValve:\n- i18n for messages\n- Log a failure if access log file cannot be opened.\n- Autocreate directory if it is specified as a part of the file name\nin FileHandler:\n- Autocreate directory if it is specified as a part of the file name",
            "date": "20110711T17:03:05",
            "id": 3
        },
        {
            "author": null,
            "body": "Created attachment 27280\n2011-07-11_tc6_bug46252_JMX.patch\n\nAdditional patch:\nExpose the new \"encoding\" option through JMX.\nI also fixed wrong mapping for \"getEnabled()\".",
            "date": "20110711T18:17:32",
            "id": 4
        },
        {
            "author": null,
            "body": "Fixed in 6.0 with r1149099 and will be in 6.0.33.\nI won't backport these changes to 5.5.",
            "date": "20110721T10:26:33",
            "id": 5
        }
    ],
    "component": "Catalina",
    "description": "AccessLogValve, which is responsible for handling the access log uses FileWriter (that doesn't support Unicode). I guess that instantiating the writer like this would solve the case:\n\nwriter = new PrintWriter(new OutputStreamWriter(new FileOutputStream(pathname), \"UTF-8\"), true);",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "46252",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "P2 enhancement",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "Tomcat access log doesn't support Unicode",
    "systemSpecification": true,
    "version": "5.5.17"
}