{
    "comments": [
        {
            "author": null,
            "body": "Use the readonly option and/or fix the umask for the user running Tomcat.\n\nFurther help and advice is available from the Tomcat users list.",
            "date": "20090710T08:59:17",
            "id": 0
        },
        {
            "author": null,
            "body": "Thank you for the quick response.  The 'readonly' option seems to solve my problem.  It would be handy to have it mentioned on this page:\n\n    http://tomcat.apache.org/tomcat-5.5-doc/realm-howto.html\n\n\nWith respect to the umask suggestion, this seems inadequate.  If tomcat really wants to rewrite this file, it should be rewritten with permissions no looser than the original permissions.  I'd call this a serious security bug.",
            "date": "20090710T09:25:01",
            "id": 1
        },
        {
            "author": null,
            "body": "I've updated the docs for trunk, 6.0.x and 5.5.x to include information on the UserDatabaseRealm and configuring UserDatabase resources.\n\nThe JavaAPI does not provide a mechanism to control file permissions so there is little Tomcat can do in that regard. I have included a warning about the side-effects of writing the file in the new documentation.",
            "date": "20091210T13:10:46",
            "id": 2
        }
    ],
    "component": "Catalina",
    "description": "The file tomcat-users.xml, which may/does contain password information, is made world-readable on startup, perhaps as a side effect of being rewritten.  The rewriting itself seems like a bug (why is this being done?), but chmod'ing the file to be world-readable is a serious security problem.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "47507",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "P2 normal",
    "product": "Tomcat 5",
    "project": "TOMCAT",
    "summary": "tomcat-users.xml is rewritten and made world-readable on startup (!)",
    "systemSpecification": true,
    "version": "5.5.23"
}