{
    "comments": [
        {
            "author": "oleg.kalnichevski@bearingpoint.com",
            "body": "I strongly disagree it's HttpClient's responsibility to check what type of URL \na request is redirected to. I do not think the HttpClient should take liberty \nin changing a request type, matter how appropriate that might seem at the first \nglance. This kind of decision should better be taken on a higher level, that \nis, by the HttpClient consumer",
            "date": "2002-11-21T23:20:58.000+0000",
            "id": 0
        },
        {
            "author": "Thomas Mathis",
            "body": "I agree with you that the HttpClient should not check what kind of URL the \nredirect is. But please take once more a look to the RFC (10.3 Redirection \n3xx). The second request (forwarded method) can only be a GET or HEAD. POST is \nnot allowed.",
            "date": "2002-11-21T23:41:50.000+0000",
            "id": 1
        },
        {
            "author": "oleg.kalnichevski@bearingpoint.com",
            "body": "Entity enclosing methods now disallow automatic redirection",
            "date": "2003-02-01T08:15:56.000+0000",
            "id": 2
        }
    ],
    "component": "HttpClient (classic)",
    "description": "I execute a PostMethod to an URL which redirects me to a HTML page. If I set \nfollow redirects to true the HttpClient wants to execute once more a POST. Of \ncourse a POST is not allowed to HTML pages. I think the HttpClient should \nexectue a GET method instead. That's also what is in the RFC2616:\n\n10.3 Redirection 3xx\n\n   This class of status code indicates that further action needs to be\n   taken by the user agent in order to fulfill the request.  The action\n   required MAY be carried out by the user agent without interaction\n   with the user if and only if the method used in the second request is\n   GET or HEAD. A client SHOULD detect infinite redirection loops, since\n   such loops generate network traffic for each redirection.\n\n      Note: previous versions of this specification recommended a\n      maximum of five redirections. Content developers should be aware\n      that there might be clients that implement such a fixed\n      limitation.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-128",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Redirection of a POST method",
    "systemSpecification": false,
    "version": ""
}