{
    "comments": [
        {
            "author": "Oleg Kalnichevski",
            "body": "I personally do not see an elegant way of implementing the requested feature,\nand what is more, do not think that J2EE authentication should be supported by\nthe stock version of HttpClient at all. \n\nAuthentication logic in HttpClient has undergone several radical changes since\nthis feature request was filed. The monolithic HttpAuthenticator has been\nrestructured into smaller, AuthScheme interface implementing modules and\ndeprecated. Besides, form-based authentication is not a part of HTTP protocol\nand should probably better be built on top of HttpClient, instead of being kind\nof shoved in.\n\nAll that makes me kind of lean towards marking this bug as 'WONTFIX'. What do\nyou think, guys? Am I being too lazy and unimaginative?\n\nOleg\n",
            "date": "2004-01-15T00:14:01.000+0000",
            "id": 0
        },
        {
            "author": "Michael Becke",
            "body": "Agreed.  This is not something that needs to be fixed.  Form authentication  is just like posting \ninto any other form.  It is not another kind of HTTP authentication.  This type of authentication \nshould be handed using PostMethod.\n\nMike",
            "date": "2004-01-15T00:29:32.000+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "If there are any fresh and bright ideas or/and practical suggestions as to how\nJ2EE authentication can be implemented without causing too much of design\nbadness, feel free to reopen the bug report. Patches welcome\n\nOleg",
            "date": "2004-01-15T00:37:39.000+0000",
            "id": 2
        }
    ],
    "component": "HttpClient (classic)",
    "description": "Add support for J2EE style FORM authentication type. \n\nUnlike the BASIC and DIGEST types this is not handled by HTTP headers so needs\nan adjustment to the way in which the authentication is sent. As far as i can\ntell from my testing with one or two J2EE servers the way to successfully login\nrequires request of a protected page which will respond with the login FORM and\nthen the submission of that form. The two requests must be associated with one\nanother using the jsessionid cookie.\n\nIt seems to me that this 'bug' must be solved in cooperation with the recent\ndiscussions of pluggable authentication module. i suggestion the following\nsignature: \n\nPluggableAuthenticator.authenticate(HttpMethod method, HttpState state). \n\nThis mirrors the existing Authenticator method but also requires change to the\nstate object to allow access to the connection properties (i dont know how this\naffects MultiClient). Alternately we could go for: \n\nPluggableAuthenticator.authenticate(HttpMethod method, HttpClient client).\n\nIn either case Authenticator needs a way to know which plugin to call. I suggest\nmodification of HttpMethodBase to detect the 'j_security_check' form action in\nthe response and automatically submit credentials if they are provided using the\nnew class \n\nJ2EEFormAuthenticator implements PluggableAuthenticator.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-74",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "J2EE FORM authentication (also affects pluggable authentication)",
    "systemSpecification": false,
    "version": "2.0 Alpha 1"
}