{
    "comments": [
        {
            "author": "Dustin Sallings",
            "body": "Created an attachment (id=8058)\nMD5-sess patch.\n",
            "date": "2003-09-04T16:02:11.000+0000",
            "id": 0
        },
        {
            "author": "Ortwin Glück",
            "body": "Thanks Dustin for contributing this feature! May I ask you also for appropriate\nJUnit test cases that prove the integrity of your patch, please.\n\nPlease mind that the source code must not contain any TAB characters; see\nhttp://jakarta.apache.org/commons/patches.html",
            "date": "2003-09-04T16:23:00.000+0000",
            "id": 1
        },
        {
            "author": "Dustin Sallings",
            "body": "Created an attachment (id=8066)\nMD5-sess patch + unit tests (and having run unit tests)\n",
            "date": "2003-09-05T01:58:36.000+0000",
            "id": 2
        },
        {
            "author": "Dustin Sallings",
            "body": "Hey, thanks for the pointers.  It was pretty late when I did this and I\ncompletely guessed about how you'd want this.  I attached a new patch without\ntabs and with the junit test.  Having run the junit test, I found something else\nI'd broken in the digest stuff (assuming algorithm would be passed in, which is\nnot required).\n\nI'm not sure I'm completely comfortable with the unit tests, however, as they\nonly  seem to test that the authenticator and the digest get the same result,\nnot that the result is correct.  It would probably be a good idea to do a\nsimilar set of digest tests that include an expected digest response to validate\nthe algorithms as well.\n\nThat said, it's lunch time.  :)\n",
            "date": "2003-09-05T02:02:31.000+0000",
            "id": 3
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I believe the patch is good to be committed. The question remains, though, if\nthe patch should be applied to HEAD only or to 2.0 branch and HEAD. Opinions?\n\nOleg",
            "date": "2003-09-08T01:56:36.000+0000",
            "id": 4
        },
        {
            "author": "Michael Becke",
            "body": "I think we might as well include this in 2.0.\n\nMike",
            "date": "2003-09-08T08:41:03.000+0000",
            "id": 5
        },
        {
            "author": "Ortwin Glück",
            "body": "Actually this patch adds an additional feature and therefore not suitable for\ncommitting to the 2.0 branch. Well, we can now argue about the definition of the\nterm 'feature' :-) But in this particular case I guess it's okay to commit it to\nthe branch, as it adds improved compatibility, it's small and has a test case.\nAny objections?",
            "date": "2003-09-08T13:57:04.000+0000",
            "id": 6
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "No objections from me. I believe it is good to be included into 2.0 release as \nwell. \n\nOleg ",
            "date": "2003-09-08T15:01:06.000+0000",
            "id": 7
        },
        {
            "author": "Dustin Sallings",
            "body": "Not to argue feature/bugfix, but I think there was an actual bug here which is\nwhat got me looking in the first place.\n\nThe server I was accessing was trying to negotiate the MD5-sess algorithm which\nwas silently ignored and the client responded with an MD5 algorithm which caused\na ``Bad request'' response from the server.\n\nI'd suggest that if this does not go into 2.0, that 2.0 at least log a warning\nwhen the algorithm is not MD5.\n",
            "date": "2003-09-08T23:34:12.000+0000",
            "id": 8
        },
        {
            "author": "Ortwin Glück",
            "body": "If no objections arrive within 24 hours from now I will commit it to 2.0 branch\nand HEAD then.",
            "date": "2003-09-08T23:47:54.000+0000",
            "id": 9
        },
        {
            "author": "Ortwin Glück",
            "body": "I just looked at the patch very closely. And I found thing which I don't like:\n\nHandling of the qop Parameter is fishy. qop can be \"auth\" or \"auth-int\" or\n\"auth,auth-int\" or not present.\n\nThe patch does not support auth-int at all.\nMoreover it removes support for the case where qop is not present.\n\nI will try and add adequate auth-int support while supporting the non-present\nqop case as well. Test cases will follow.\n",
            "date": "2003-09-11T14:03:54.000+0000",
            "id": 10
        },
        {
            "author": "Dustin Sallings",
            "body": "Are you certain?  The only thing I see in the patch related to qop is logging when the qop was not \nprovided.  Other than that, it's the original implementation.\n\nI admit that I did not add support for the other two qop methods as I don't have anything against \nwhich I could confidentally test, however, I believe this patch only adds functionality and does not \nremove any.\n\nPlease correct me if I'm wrong.",
            "date": "2003-09-11T15:11:04.000+0000",
            "id": 11
        },
        {
            "author": "Ortwin Glück",
            "body": "Agreed, it's not your 'fault'. But the original implementation is bad!\n\nauth-int can not be implemented at this time since this would require access to\nthe request body (or a precalculated MD5-sum of it).\n\nI will check your patch in and refactor the code afterwards. Also the tests need\nreworking.",
            "date": "2003-09-11T15:57:31.000+0000",
            "id": 12
        }
    ],
    "component": "HttpClient (classic)",
    "description": "I was attempting to access a device that requires Digest authentication using\nMD5-sess, which does not seem to be supported.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-266",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "[patch] Support for digest auth MD5-sess",
    "systemSpecification": true,
    "version": "2.0 Beta 2"
}