{
    "comments": [
        {
            "author": "Michajlo Matijkiw",
            "body": "This patch should be applied against TestCacheEntryUpdater and it exposes the mentioned bug.  I have started to work on a fix but was hoping for some feedback on my approach.\n\nI am looking to move the logic of CacheEntryUpdater#updateCacheEntry into BasicHttpCache (this is the only place where it is used).  The rest of CacheEntryUpdater's methods can remain as helper methods.  I think this will simplify the logic and help prevent any code duplication.  I believe it might make resolving HTTPCLIENT-1003 easier as well.\n\nAny thoughts?\n\nThanks,\nMichajlo",
            "date": "2010-09-29T16:09:35.310+0000",
            "id": 0
        },
        {
            "author": "Michajlo Matijkiw",
            "body": "This patch fixes functionality so that a stale cache entry's resource is only copied into the new entry on 304 responses (it is still valid), and is replaced by all other responses.  The following changes were made:\n\n - Move CacheEntryUpdater#updateCacheEntry() logic into BasicHttpCache#updateCacheEntry(), if the response is not 304 then call BasicCacheEntry#cacheAndReturnResponse()\n - Deleted CacheEntryUpdater tests \"testUpdateCacheEntryReturnsDifferentEntryInstance()\" and \"testUpdatedEntryHasLatestRequestAndResponseDates()\" - these are trivial and difficult to test with the rearranged code\n - Added \"Via\" header to backendResponse in CachingHttpClient revalidation method\n - Added tests to TestBasicHttpCache to check proper updating of response body\n\nThis patch is submitted with the permission of my employer.\n\nThanks,\nMichajlo",
            "date": "2010-09-29T18:39:40.781+0000",
            "id": 1
        },
        {
            "author": "Michajlo Matijkiw",
            "body": "Please disregard the previous patch, I am currently working on another version that should be a little more elegant and make HTTPCLIENT-1003 easier.\n\nThanks,\nMichajlo",
            "date": "2010-09-30T01:03:56.939+0000",
            "id": 2
        },
        {
            "author": "Michajlo Matijkiw",
            "body": "This patch provides a slightly cleaner fix. \n\n - Only 304 responses go through updateCacheEntry, and I have updated CacheEntryUpdater#updateCacheEntry() to reinforce this\n - In CachingHttpClient#revalidateCacheEntry() non-304 responses go through handleBackendResponse() to ensure cachability\n - Updated unit tests to reflect this change\n\nI also fixed a random typo in CachedResponseSuitabilityChecker.java\n\nPlease let me know if I have missed anything.\n\nThis patch is submitted with the permission of my employer.\n\nThanks,\nMichajlo",
            "date": "2010-09-30T15:43:07.812+0000",
            "id": 3
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Patch 'cache_update_fix2.patch' checked in. Many thanks, Michajlo\n\nOleg",
            "date": "2010-10-01T09:50:21.765+0000",
            "id": 4
        }
    ],
    "component": "HttpCache",
    "description": "CacheEntryUpdater#updateCacheEntry() copies the old cache entry's resource, though I believe it should only do so if the response is a 304.  Otherwise it should take the response from the server to update the entry.  This method gets called when validating a cache entry and the server returns a 200 or 304.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-1001",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "CacheEntryUpdater does not properly update cache entry resource",
    "systemSpecification": true,
    "version": ""
}