{
    "comments": [
        {
            "author": "Joe Campbell",
            "body": "I was only able to find one use of Mockito in the whole project, and at that in just one test file... Did I miss something?  Attached please find the patch converting that one test case to use EasyMock.\n\nMy Company, Comcast, has authorized me to submit this patch to you and grants all license to the Apache Foundation.",
            "date": "2010-05-21T19:24:09.213+0000",
            "id": 0
        },
        {
            "author": "Joe Campbell",
            "body": "Patch changing Mockito to EasyMock.",
            "date": "2010-05-21T19:24:53.141+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I struggled somewhat with EasyMock and found Mockito slightly cleaner and more expressive. That is why I was not sure which one to keep. EasyMock it is.\n\nOleg ",
            "date": "2010-05-21T19:46:30.453+0000",
            "id": 2
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Patch checked in. Many thanks, Joe",
            "date": "2010-05-23T22:23:19.672+0000",
            "id": 3
        },
        {
            "author": "Joe Campbell",
            "body": "Yeah - As I was doing the conversion I noted that they are syntactically only slight variations of one another.  They also follow slightly different mocking philosophy:\n\nMockito by default seems to create a 'Nice' mock\n\nEasyMock by default seems to create a 'Strict' mock\n\nNot entirely sure which one I like better, they both seem to fit the bill.\n\nThanks Oleg,\n    Joe\n\n",
            "date": "2010-05-24T12:33:20.791+0000",
            "id": 4
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "As far as I know Mockito started out as a fork of EasyMock. Both frameworks share a lot in common due to that. I find Mockito slightly nicer as it eliminates those pesky replay / verify calls.\n\nhttp://code.google.com/p/mockito/wiki/MockitoVSEasyMock \n\nOleg",
            "date": "2010-05-24T15:56:49.075+0000",
            "id": 5
        }
    ],
    "component": "HttpCache, HttpClient (classic)",
    "description": "We are currently using EasyMock in the caching module and Mockito in the main module. While Mockito appears to have a somewhat nicer API, the sheer number of test cases based on EasyMock in the caching module makes it much simpler to replace Mockito with EasyMock than the other way around.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-941",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Standardize on a common mocking framework (either EasyMock or Mockito)",
    "systemSpecification": true,
    "version": ""
}