{
    "comments": [
        {
            "author": "Jonathan Moore",
            "body": "We have some outdated code that does this that we are starting to pick up to implement and contribute back for this one.\n\nOne major question is how the contribution should be structured.\n\nShould this be a new top-level module under httpcomponents-client, so that it can be optionally included as desired?\n\nOr should it show up as a new package (with associated dependencies) under the httpclient-cache module?\n",
            "date": "2010-08-11T17:29:53.501+0000",
            "id": 0
        },
        {
            "author": "Mohammed Azeem Uddin",
            "body": "\n-This patch adds the package org.apache.http.impl.client.cache.memcached, and tests for this class.\n- The package contains a single class, MemcachedHttpCacheStorage, which is a HttpCache implementation built around Memcached. \n-It uses Memcached client version 2.5 for JAVA.  The pom.xml was also updated to incorporate this. \n-The patch implements HttpCacheOperationException. \n\nThis patch is submitted by the permission of my employer. \n\nThank you,\nMohammed Azeem",
            "date": "2010-08-20T16:36:17.917+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Mohammed et al\n\nThere are some bad news. It turned out that memcached is licensed under kind of license of its own [1].  It looks like MIT type of license to me, but I am not sure and I am not a legal expect. Wikipedia categories that license as 'Permissive free software licence' but it does not necessarily mean it is compatible with ASLv2 used by Apache products.\n\nI am very reluctant to go through the pains of dealing with our legal folks in order to find out whether or not the license is compatible with ASLv2 only to be able to include just one optional class.\n\nCan you live with memcached cache storage implementation not being a part of stock version of HttpClient?\n\nOleg\n\n[1] http://github.com/memcached/memcached/blob/master/LICENSE\n[2] http://en.wikipedia.org/wiki/Permissive_free_software_license",
            "date": "2010-08-22T10:49:25.755+0000",
            "id": 2
        },
        {
            "author": "matthew hawthorne",
            "body": "Oleg,\n\n(I work with Jonathan and Mohammed)\n\nsince we are using spymemcached to talk to memcached, isn't spymemcached's license (which is MIT) the one we must be concerned with?\n\n-matt ",
            "date": "2010-08-22T21:44:46.860+0000",
            "id": 3
        },
        {
            "author": "Joe Campbell",
            "body": "In either event I would say that we probably need to remove this contribution in the short term so as not to hold up the overall release of the next version of the client.  We can then work with Oleg to find the right path to either:\n\n1) Contribute to ASF because the license is indeed compatible as determined by the ASF.\n2) Source/Store the contribution on something like google code with ASFs agreement that we can put a link to the google code site and the memcached implementation for people to download\n\nBoth paths should still provided the needed functionality to people - just a question of the ease with which they can find it.\n\nThere may be other options that I haven't listed.\n\nJoe",
            "date": "2010-08-23T12:47:55.656+0000",
            "id": 4
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "MIT license is compatible with ASLv2, so at the very least we would not need to go through the license approval process. Nevertheless, we would have to comply with the requirements of the license such giving a proper attribution to the author of the library and distributing a copy of the license itself with each the release package of HttpClient. ASL release process is already an enormous pain the in rectum and I am reluctant to make it even more complex because of an optional component. \n\nWhat could be another possibility is using the memcache storage backend as an example of writing a custom HttpCacheStorage in the tutorial. This way we would not have to deal with distribution of the library itself, while the implementation would still be available to the users, albeit in source only.\n\nWhat is your preference?\n\nOleg",
            "date": "2010-08-23T15:33:28.613+0000",
            "id": 5
        },
        {
            "author": "Joe Campbell",
            "body": "I would say we take two paths.\n\n1) We do as you describe and place the source into a tutorial about the use of the tool (to make sure that there is adequate reference to a memcache implementation)\n2) We have a link out to a remote google code as to provide a place for ongoing support and work on memcached caching and implementation work to be done.\n\nThis will allow there to be a working version included in the apache release and for there to be a place to get potentially newer releases outside of the apache release cycle.  Does this make sense or is it over kill?\n\nJoe",
            "date": "2010-08-23T15:41:55.573+0000",
            "id": 6
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I personally think that would be an overkill for a library which essentially consists of just one file. Let's revisit this issue in the BETA development phase.\n\nOleg",
            "date": "2010-08-25T12:02:13.552+0000",
            "id": 7
        },
        {
            "author": "ant elder",
            "body": "Could it be an optional dependency that is not included in the HC distribution? That way the source code can be included in svn and the src distribution and the Memcached dependency would be used by Maven when building the source but the Memcached  artifacts themselves would not be included in any distribution so no licensing needs to be changed.\n",
            "date": "2010-08-25T12:06:59.094+0000",
            "id": 8
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I am not sure this would save us from having to give appropriate attribution to the original author and to distribute a copy of the license with every copy of the caching module. I may be wrong here, though.\n\nOleg",
            "date": "2010-08-25T12:45:54.872+0000",
            "id": 9
        },
        {
            "author": "Jonathan Moore",
            "body": "If we make the memcached client Maven dependency's scope be \"provided\", does that fix our licensing issues? Then a client may link it into their executable at their option, and we can just provide instructions on how to do so if desired. Then there would actually not be anything included from that project (neither source code nor compiled binary). \n\nFailing that, can we just include the source code for MemcachedHttpCacheStorage.java in httpclient-contrib for now?\n\nWe'll separately pursue options for providing non-source access (perhaps it's worth building an Apache 2.0-licensed Java memcached client, for example).\n",
            "date": "2010-09-05T14:12:28.601+0000",
            "id": 10
        },
        {
            "author": "ant elder",
            "body": "In my opinion yes that would be fine. Either optional or provided would stop the Memcached dependency getting included so there would be no additional licensing requirements for the HC distributions.",
            "date": "2010-09-06T08:37:50.564+0000",
            "id": 11
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I see no point being a more fervent Catholic than the Pope himself. As we are no going to distribute the memcached client with the cache module, most likely we are all clean. If there is any issue with the attribution clause of the MIT license, we can add it later.\n\nMohammed,\n\nWould it be a big deal for you to rebuild the patch against the latest snapshot off the trunk?\n\nOleg",
            "date": "2010-09-07T19:49:12.865+0000",
            "id": 12
        },
        {
            "author": "Mohammed Azeem Uddin",
            "body": "Oleg,\n\nSure, I can rebuild the patch against the latest snapshot off the trunk.\n\nMohammed",
            "date": "2010-09-07T20:48:10.993+0000",
            "id": 13
        },
        {
            "author": "Mohammed Azeem Uddin",
            "body": "Rebuilt the patch against the latest trunk. So, the patch now includes MemcachedHttpCacheStorage.java and TestMemcachedHttpCacheStorage.java. The patch is being submitted with the permission of my employer. ",
            "date": "2010-09-08T20:45:43.350+0000",
            "id": 14
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Patch committed. Many thanks, Mohammed\n\nIs there any chance we could avoid buffering the cache entries in memory when saving to / loading from the cache storage?\n\nOleg",
            "date": "2010-09-08T21:22:04.426+0000",
            "id": 15
        }
    ],
    "component": "HttpCache",
    "description": "The feature here would be an implementation of the HttpCache interface that stored cache entries in memcached.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-977",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "provide a memcached implementation for HttpCache",
    "systemSpecification": true,
    "version": ""
}