{
    "comments": [
        {
            "author": "Oleg Kalnichevski",
            "body": "Created an attachment (id=11194)\nPatch against CVS HEAD\n",
            "date": "2004-04-09T04:58:21.000+0000",
            "id": 0
        },
        {
            "author": "Michael Becke",
            "body": "I think Geir's fix is good and should be applied to both 2.0 and HEAD.  I am a little more wary about \nchanging the headers to info though.  This will end up producing a lot of unnecessary output I think.  \nMy suggestion would be to move content and headers to two new logs httpclient.wire.headers and \nhttpclient.wire.content for example.  This will maintain current behavior and will also allow for more \nfine grained control.\n\nMike",
            "date": "2004-04-09T08:50:25.000+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "You are right. It did not occur to me that certain logging kits may have INFO\nverbosity per default (jdk14 for instance). I like your suggestion.\nAlternatively we may reduce the priority of request/response content logging to\nTRACE. That will require virtually no changes in the code. Let me know if you\nthink this is acceptable\n\nOleg",
            "date": "2004-04-09T19:23:22.000+0000",
            "id": 2
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Created an attachment (id=11197)\nPatch (take 2)\n",
            "date": "2004-04-09T19:23:53.000+0000",
            "id": 3
        },
        {
            "author": "Michael Becke",
            "body": "This change to TRACE is certainly easier code-wise, but I would prefer to leave both at DEBUG and \nswitch to new Logs.  Some logging kits, Log4j for example, do not support TRACE and just substitute \nDEBUG instead.  The current change would only help those people using the other logging kits.\n\nMike",
            "date": "2004-04-12T05:42:34.000+0000",
            "id": 4
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Mike, I looked at your suggestion, and even though I do agree with it, having to\ndeal with multiple appenders  would require quite a substantial overhaul if not\ncomplete rewrite of the Wire, WireInputStream & WireOutputStream classes. This\nis not something we should be wasting our time on right now, IMO. Our time\nshould be better spent. We should concentrate on those problems that delay the\n3.0 alpha1 release.\n\nHow about we check in the patch for now and see about better wire logging\nimplementation in the 4.0 time frame? My only intention is to be able to tell\nusers experiencing problems how to produce wire logs without excessive body\ncontent logs and if that takes temporarily turning SimpleLog on, it believe it's\nacceptable (again, in my opinion)\n\nOleg\n",
            "date": "2004-04-12T21:12:12.000+0000",
            "id": 5
        },
        {
            "author": "Michael Becke",
            "body": "Oleg,  I'm not terribly happy with using TRACE, but I agree there are more important things to look at.  \nGo ahead an apply this one.  We can revisit this problem when we have more time.  \n\nMike",
            "date": "2004-04-13T09:39:21.000+0000",
            "id": 6
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Patch committed to CVS HEAD and 2.0. A better solution to excessive body content\nlogging is pending\n\nOleg",
            "date": "2004-04-14T01:29:20.000+0000",
            "id": 7
        }
    ],
    "component": "HttpClient (classic)",
    "description": "This patch \n\n* fixes the problem reported by Geir H. Pettersen <geir at cellus.no>. See\nhttp://marc.theaimsgroup.com/?t=108072355300004&r=1&w=2 for details\n\n* increases the priority of HTTP request/status line & HTTP headers output from\nDEBUG to INFO. Quite often request/response content generate excessive amount of\noutput in the wirelog and produce no valuable debug information of what so ever.\nBy setting wirelog verbosity to INFO one can turn off the logging of \nrequest/response content.\n\nI believe the patch should be applied to both CVS HEAD and 2.0 branch. Please\nlet me know if you agree\n\nOleg",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-330",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "[PATCH] Wirelog corrections",
    "systemSpecification": true,
    "version": "2.0 Final"
}