{
    "comments": [
        {
            "author": "Abhishek Sethi",
            "body": "This is with policy == CookiePolicy.COMPATIBILITY ",
            "date": "2004-04-24T06:25:40.000+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I cannot help mentioning that what those so called common browsers do is simply\nsilly, as the cookie spec requires the HTTP agents to differentiate between the\ndomain scope and the host scope. \"beta.gamma.com\" in my opinion implies a single\nhost, not a domain. This said, in browser compatibility HttpClient is supposed\nto simulate whatever stupidity mainstream browsers are capable of. I'll look\ninto the problem and provide a fix if required. It may happen, though, that the\nproblem has already been fixed in the post 2.0 release time frame, as we have\nhad a similar bug report not long ago (HTTPCLIENT-301).\n\nOleg\n ",
            "date": "2004-04-24T19:05:13.000+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "My apologies. The HTTPCLIENT-301 made it into 2.0 final. I'll look into the problem\nanyhow.\n\nOleg",
            "date": "2004-04-24T19:09:17.000+0000",
            "id": 2
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Created an attachment (id=11326)\nPatch\n",
            "date": "2004-04-26T03:47:34.000+0000",
            "id": 3
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "The patch takes care of the problem.\n\nOleg",
            "date": "2004-04-26T03:48:24.000+0000",
            "id": 4
        },
        {
            "author": "Michael Becke",
            "body": "Works for me.\n\nMike",
            "date": "2004-04-26T05:02:24.000+0000",
            "id": 5
        },
        {
            "author": "Abhishek Sethi",
            "body": "Works for me as well.\n\nHowever this wasnt enough to get my code to work. This time problem happens to \nbe with Cookie header formatting. HttpClient in non-strict mode sends out \nmultiple \"Cookie:\" headers (HttpMethodBase.addCookieRequestHeader(). Whereas \nMozilla/IE/LWP send out just one header with cookies delimited by semi-colon. \n   Looks like HttpClient does not exactly mimic the behaviour of common user \nagents, in this case. I am guessing strictMode would make it behave even more \ndifferently. So should this be fixed in non-strict mode?\n  ",
            "date": "2004-04-27T06:27:30.000+0000",
            "id": 6
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Abhishek,\nThis problem has already been addressed. I suppose you are using the latest CVS\nsnapshot, as the patch is against CVS HEAD. To make HttpClient send cookies as\none header set the parameter 'http.protocol.single-cookie-header' to true\n\nGetMethod httpget = new GetMethod(\"/whatever\");\nhttpget.getParams().\n  setBooleanParameter(\"http.protocol.single-cookie-header\", true);\n\nThis parameter can also be set at the HttpClient level, if you want all\nsubsequent requests issued by that HttpClient instance to send cookies as a\nsingle header\n\nHTH\n\nOleg",
            "date": "2004-04-27T16:16:38.000+0000",
            "id": 7
        },
        {
            "author": "Abhishek Sethi",
            "body": "Hey Oleg,\n   Thanks for the quick response. You are FAST.\n \n   I am using the STABLE code since it will go into production pretty soon. \nProbably before the next HttpClient release.\n   Would you recommend CVS HEAD for production purpose? \n\n   For the time being I guess, I can work around by using a hack which ignores \nthe strict mode settings.\n\n--\ncheers,\nAbhishek.",
            "date": "2004-04-28T03:50:06.000+0000",
            "id": 8
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Abhishek,\nWe are nearing the 3.0 alpha1 release with the development branch. Even though I\nam convinced that in many areas the code quality in our development branch is\nmuch better than that in the stable one, it would be irresponsible for me to\nrecommend it for use in productive systems. For the time being, you might want\nto get the latest snapshot of 2.0 (stable) branch and tweak the compatibility\ncookie spec to your liking. The 3.0 release will provide many improvements in\nthe area of cookie management. It will also allow to plug in custom cookie spec\nimplementations. So, in the future you will not have to maintain the fork.\n\nIf you do not mind, I'll apply the patch to the CVS HEAD and close the bug\n\nOleg",
            "date": "2004-04-28T04:44:49.000+0000",
            "id": 9
        },
        {
            "author": "Abhishek Sethi",
            "body": ">> If you do not mind, I'll apply the patch to the CVS HEAD and close the bug\n\nPlease do. The fix works.\n\n",
            "date": "2004-04-28T04:51:16.000+0000",
            "id": 10
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Patch committed\n\nOleg",
            "date": "2004-04-28T05:36:27.000+0000",
            "id": 11
        }
    ],
    "component": "HttpClient (classic)",
    "description": "I noticed a difference in behaviour between httpclient and most common browsers \n(IE/Mozilla). If a web site sets a cookie for \"beta.gamma.com\", this cookie is \nnot sent in requests to \"alpha.beta.gamma.com\". \n  I am not sure what the cookie specs say, but Mozilla, IE and even \nHTTP::Cookies module in LWP seem to behave differently from HttpClient. \nHttpClient seems to rely on the leading dot in the domain name \n(like \".beta.gamma.com\").",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-335",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Handling sub-domain cookies.",
    "systemSpecification": true,
    "version": "2.0 Final"
}