{
    "comments": [
        {
            "author": "Andrea Selva",
            "body": "Hi, Roland\nthis could be a starting point for this issue, i hope, if i've cirrectly undestood the spirit.\n\n Andrea",
            "date": "2007-07-23T19:10:31.370+0000",
            "id": 0
        },
        {
            "author": "Roland Weber",
            "body": "Hi Andrea,\n\nyes, you've definitely got the spirit right :-) Thanks a lot.\n\nIf you could make one more tweak to it: instead of passing the planner to the constructor of the HttpClient implementations, could you use the default instantiation strategy that Oleg has implemented for the other helper objects?\n\nI'm about to wrap it up for today and will be offline tomorrow evening. If Oleg doesn't check it in, I'll do it later this week.\nThis issue should remain open though, as there are a fews things left to figure out. In particular, I don't like the dependency of the route planner on the connection manager. It needs the scheme registry though. I'm afraid there might be a bigger design problem lurking behind.\n\nthanks again,\n  Roland\n",
            "date": "2007-07-23T19:38:40.543+0000",
            "id": 1
        },
        {
            "author": "Andrea Selva",
            "body": "Hi,\nthis patch has the fix you suggested...and is more smartinsted of passing the parameter to the constructor\nThanks for the suggest\n Andrea",
            "date": "2007-07-24T19:45:45.624+0000",
            "id": 2
        },
        {
            "author": "Roland Weber",
            "body": "Hi Andrea,\n\nI had to made a few modifications before committing your patch. Technically, the problem was that your additions to HttpConn were depending on HttpClient, which is something I'd prefer to avoid.\n- HttpRoutePlanner returns a route, not a routed request\n- default implementation currently in client, it still depends on a constant defined in HttpClientParams\n- attribute in AbstractHttpClient is private and accessed via getter, to ensure initialization\n- added license headers\n\nI had to remove the @author tags for now, since your CLA is not on file. I'll put them in when your name is listed here:\nhttp://people.apache.org/~jim/committers.html#unlistedclas\n\nThanks a lot for this contribution,\n  Roland\n",
            "date": "2007-07-26T16:34:24.212+0000",
            "id": 3
        },
        {
            "author": "Roland Weber",
            "body": "I've moved DefaultHttpRoutePlanner from client to conn, along with the DEFAULT_PROXY parameter.",
            "date": "2007-09-01T15:34:28.082+0000",
            "id": 4
        }
    ],
    "component": "HttpClient (classic)",
    "description": "Define an interface to determine a route for a given target host.\nCreate default implementation replacing DefaultHttpClient.determineRoute(...);\nImplementations will need access to params and/or request.\n\nThe interface fits into HttpConn, but DHC.dR(...) uses client parameters.\nEither move parameters to HttpConn, or keep default implementation in HttpClient.\n\nAlternative implementations could evaluate Java system properties related to proxy settings.\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-669",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "introduce HttpRoutePlanner interface",
    "systemSpecification": true,
    "version": ""
}