{
    "comments": [
        {
            "author": "Michael Becke",
            "body": "Created an attachment (id=6182)\nthreading docs and some other fixes\n",
            "date": "2003-05-03T11:12:58.000+0000",
            "id": 0
        },
        {
            "author": "Michael Becke",
            "body": "Attached is the latest version of the threding docs that I have been working on.\n It's a little rough but it's a starting point.  Anyone want to expand on this?\n\nMike",
            "date": "2003-05-03T11:14:10.000+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I was thinking about writing an SSL guide unless there's someone else who wants\nto take on this duty.\n\nOleg",
            "date": "2003-05-05T03:56:05.000+0000",
            "id": 2
        },
        {
            "author": "Adrian Sutton",
            "body": "Sorry it's taken so long to look at this, simplek things first.  Oleg, an SSL\narticle would be brilliant but unfortunately I don't know enough about it to\nwrite one.  If you were to jot down some notes I could write up the doc from\nthem at least as a draft.\n\nMike, I took a look at your threading article and it looks good, a few\nrephrasings may help and I'll look into that tomorrow but I'm not enough of a\nword smith to do much with it.\n\nI'm not sure about some of the other changes in the patch though, most of it\nlooks like minor spelling adjustments etc, but there is one change to the\nauthentication article that I think is incorrect.  In the subsection \"Preemtive\nAuthentication\" your patch adds a note that preemptive authentication can be\nenabled on a per method basis by calling: someMethod.setDoAuthentication(true);\n however from what I can tell, setDoAuthentication controls whether or not\nHttpClient tries to authenticate at all and doesn't affect preemptive\nauthentication.  More relevant seems to be the method\nHttpState.setAuthenticationPreemptive(boolean value).",
            "date": "2003-05-09T19:46:59.000+0000",
            "id": 3
        },
        {
            "author": "Michael Becke",
            "body": "Adrian,\n\nAny assistance on phrasing would be helpful.  Even though I wrote it, I find the\nwording a little awkward.\n\nYou are quite right about preemptive authentication.  That part of the patch\nshould be removed.\n\nThanks,\n\nMike",
            "date": "2003-05-09T20:45:02.000+0000",
            "id": 4
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Adrian,\n\nI will happily provide most of the content for the SSL guide. Unfortunately it \nmay take me a while, though, as I am quite busy doing those unpleasant things \ncalled earning a living. (The consulting business appears to be picking up a \nbit here in Europe, and my bosses occasionally want me to get some stuff done \nin return for keeping me on their payroll). I would really appreciate if could \njust massage the article language- and style-wise, correct my Russki English \nand make sure the content is actually readable and clear enough for an average \nHttpClient user. I have a notoriously bad record of writing documentation.\n\nAs far as preemptive authentication goes, it can be controlled on a per HTTP \nstate basis. The HttpState class reads the default value from \nthe 'httpclient.authentication.preemtive' upon initialization. Once the \nHttpState object is instantiated, the preemptive authentication can be \nactivated / deactivated with the following method:\n\nHttpState#setAuthenticationPreemtive(boolean)\n\nOleg",
            "date": "2003-05-09T21:56:39.000+0000",
            "id": 5
        },
        {
            "author": "Adrian Sutton",
            "body": "Created an attachment (id=6473)\nUpdated threading guide.\n",
            "date": "2003-05-24T05:43:06.000+0000",
            "id": 6
        },
        {
            "author": "Adrian Sutton",
            "body": "Created an attachment (id=6474)\nSlightly tweaked version of Mike's assorted changes.\n",
            "date": "2003-05-24T05:43:52.000+0000",
            "id": 7
        },
        {
            "author": "Adrian Sutton",
            "body": "I've attached both the new version of Mike's threading guide that clarifies some\nof the wording but is mostly untouched as well as a new patch file with the\nassorted changes that came along with it, slightly tweaked and in particular\nremoved the changes regarding pre-emptive authentication.  I'll go back and look\nat the authentication docs now to see if they need updating.",
            "date": "2003-05-24T05:45:09.000+0000",
            "id": 8
        },
        {
            "author": "Adrian Sutton",
            "body": "Created an attachment (id=6475)\nUpdate for authentication guide to provide more detail to preemptive authentication.\n",
            "date": "2003-05-24T05:55:32.000+0000",
            "id": 9
        },
        {
            "author": "Michael Becke",
            "body": "These look good to me.  I will apply these patches if there are no objections.\n\nMike",
            "date": "2003-05-26T21:50:46.000+0000",
            "id": 10
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Mike,\nNo objections from me. I think you should also re-tag the content of xdoc\ndirectory after having committed the patches, as these changes should make it\ninto beta-1. \n\nOleg",
            "date": "2003-05-26T22:02:38.000+0000",
            "id": 11
        },
        {
            "author": "Michael Becke",
            "body": "Can do.",
            "date": "2003-05-26T22:10:09.000+0000",
            "id": 12
        },
        {
            "author": "Michael Becke",
            "body": "Docs committed and re-tagged.",
            "date": "2003-05-26T22:22:11.000+0000",
            "id": 13
        },
        {
            "author": "Adrian Sutton",
            "body": "Created an attachment (id=6597)\nUpdate for the redirect docs to include information about the special redirect types.\n",
            "date": "2003-06-02T19:44:02.000+0000",
            "id": 14
        },
        {
            "author": "Michael Becke",
            "body": "The authentication and redirection docs managed to slip through the cracks. \nThey have now been committed.\n",
            "date": "2003-06-04T09:31:21.000+0000",
            "id": 15
        },
        {
            "author": "Adrian Sutton",
            "body": "There seems to be two items missing that prevent us from closing this bug:\n\n1. Quotes from user's on why they used it (I'll post under a new thread to the \nmailing list calling for these soon).  Currently we have a list of \napplications that used HttpClient but not why they did.\n\n2. Clover reports.  Clover is a commercial product that provides free licenses \nfor opensource projects upon request.  There was a discussion about how to go \nabout requesting this on commons-dev a while back but I'm not sure what the \noutcome was (I don't recall seeing one).  Should we contact the PMC for \napproval or just go ahead and request a license?  I'd really like to get \nClover up and running so we can do a review of the test cases.",
            "date": "2003-06-17T15:17:14.000+0000",
            "id": 16
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Adrian,\nI would just quickly consult the rest of the Commons crowd by posting a message\nto the jakarta-commons-dev. If no satisfactory answer is given in a timely\nmanner, we should approach the vendor on our own. \n\nOleg",
            "date": "2003-06-17T15:54:39.000+0000",
            "id": 17
        },
        {
            "author": "Adrian Sutton",
            "body": "Commons crowd consulted - they passed me onto community@apache.org.  \nCommunity@apache.org doesn't seem to have anything to say on the matter so I've gone with the \nhistorical approach of just requesting a license ourselves.  We should hear back from them in the \nnext day or so.  I've already received an email from their tech support saying they'd be happy to \nprovide a free license to HttpClient if I just filled out the appropriate form on the website.  Having \nnow filled out that form, I don't expect there'll be any issues.",
            "date": "2003-06-20T04:48:39.000+0000",
            "id": 18
        },
        {
            "author": "Adrian Sutton",
            "body": "We now have a license for clover to use with HttpClient (HttpClient committers \ncan email me for details on how to get their hands on it).  To add the report \nto the website we need to specify it as a report in the project.xml.  However, \nit means that we have to specify every report we want to run so we won't \nautomatically get any new reports that are added to maven's default setup.  I \nhave listed all the reports we currently have in the project.xml.\n\nAlso, for clover to work, you must run the unit tests in a forked JVM as the \nresults are only written out when the JVM exits.  I've added the property that \nachieves this to project.properties, but if you rebuild httpclient using maven \na lot during development, you may wish to override this in your own \nbuild.properties (which takes precedence).  The line to add is:\n\nmaven.junit.fork=false\n\nAlso, the clover plugin seems to have major issues on Windows, particularly \nwhen there is a space in the path to the HttpClient sources.  I'm not sure if \nthis has been fixed in maven's CVS yet or not.\n\nSo, do considering these down sides, do we wish to add clover to maven's \ndefault run or should we:\n\na. add a link to the report via navigation.xml and run the clover report \nmanually then upload it to the site.\n\nb. Not put the clover report on the website and just use it when required.\n\nc. Go find a fix for the problems and use an updated version of the clover \nplugin when generating the site (what happens to anyone who is still using the \nlast stable release of maven or before?).\n\nd.  Something completely different.",
            "date": "2003-06-26T18:20:23.000+0000",
            "id": 19
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "\nAdrian\nI apologize that your efforts to promote the use of clover have so far enjoyed\nonly a lukewarm support from our side. You have the right to feel abandoned. \n\nI believe I have some explaining to do. I feel 100% test case coverage may be\nsimply unattainable at this point. Yes, it should be our goal, but it is not the\nonly goal that we have. I think your efforts can be better spent by looking into\nSimpleHttpConnection redesign, for instance. I would feel by far better if had a\nway to reliably test proxy support, instead of bringing up the formal test case\ncoverage level from 50% to 51%. So, I am perfectly comfortable with plan B (Not\nput the clover report on the website and just use it when required) for the time\nbeing.\n\nOleg",
            "date": "2003-07-09T20:15:01.000+0000",
            "id": 20
        },
        {
            "author": "Adrian Sutton",
            "body": "With the decision to leave the clover report off the website at least for now,\nthis bug can now be closed as fixed.  The improvements to test cases is really a\nseparate issue.",
            "date": "2003-07-24T19:49:04.000+0000",
            "id": 21
        }
    ],
    "component": "HttpClient (classic)",
    "description": "- quotes from user's on why they used it.\n- better project docs, including checkstyle and clover reports, and changelog\n- examples showing how to configure logging and why you may want to\n- Links on HttpClient to 'sister' projects such as Slide, Cactus and Latka to\nshow where how it's being used.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-69",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "User/Developer Documentation",
    "systemSpecification": false,
    "version": "2.0 Alpha 1"
}