{
    "comments": [
        {
            "author": "Roland Weber",
            "body": "Hi Odi,\n\na) I don't think we should make significant changes to the User-Agent header in the 3.1 code base, like dropping Jakarta from it. People may have set up filter rules that rely on the name. That is also the reason why I'm not sure about changing anything but the version indicator at all. Since it's an RFC violation, we might change the space character to a dash. Btw, section 3.8 of RFC 2616 also mentions:\n[quote]\n  successive versions of the same product SHOULD only differ in the product-version portion of the product value\n[/quote]\nWhat is the lesser evil here?\n\nb) Dropping Jakarta for the 4.0 code base is fine. What I don't like are calls to System.getProperty() to collect a user agent string, at least not in the default User-Agent interceptor. We can have a selection of them of course. Like one that says Apache-HttpCore/J-4.0-a5 in core and another one that says Apache-HttpClient/J-4.0-a1 in client. And another one that collects values from system properties.\n(I'd like to see the version number being updated by the build process, but I don't have the time nor inclination to learn Maven2...)\n\nc) You suggestion also generates space characters in \"(Windows XP 5.1;x86) and \"(Sun Microsystems Inc.)\" ;-)\n\nd) A request interceptor that checks a header for compliance is a _really_ good idea. I am in favor of enabling such verification interceptors by default. People will never learn to comply with specifications unless exceptions are thrown into their faces. Misbehaviour must be punished, immediately and without mercy (Dubious API Dictator Roland ;-)\n\ncheers,\n  Roland\n",
            "date": "2007-06-06T16:51:50.205+0000",
            "id": 0
        },
        {
            "author": "Ortwin Glück",
            "body": "Hi Roland,\n\nI agree that changing the User-Agent string may break existing filtering rules. So better don't change that now.\n\nSystem properties: Well, yes, they are a bit nasty (SecurityManager comes to mind). But that's the official way to obtain that sort of information. Look at other User-Agent strings and you will see that most of them carry this information.\n\nSpaces are legal within a comment. That is the text between parantheses.\n\nOkay, I'll happily contribute a User-Agent validator :-)\n\nOdi",
            "date": "2007-06-06T18:40:20.187+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Fixed in SVN trunk. The User-Agent string now conforms to the standard defined in RFC 2616 and looks like \"Apache-HttpClient/\" + VersionInfo.getReleaseVersion() + \" (java 1.4)\"\n\nOleg",
            "date": "2007-07-03T08:27:08.736+0000",
            "id": 2
        }
    ],
    "component": "HttpClient (classic)",
    "description": "Our User-Agent says \"Jakarta Commons-HttpClient/3.1-rc1\". But space is a reserved character to separate individual *products* and comments according to RFC 2616, section 14.43. Jakarta is not a product. At the same time we may want to drop the Jakarta name altogether.\n\nWe should change this to something more standard like: \n\n\"Apache-HttpClient/3.1-rc1 (\"+ System.getProperty(\"os.name\") +\";\"+ System.getProperty(\"os.arch\") +\") \"+\n\"Java/\"+ System.getProperty(\"java.vm.version\") +\" (\"+ System.getProperty(\"java.vm.vendor\") +\")\"\n\nwhich renders:\n\n\"Apache-HttpClient/3.1-rc1 (Windows XP 5.1;x86) Java/1.5.0_08 (Sun Microsystems Inc.)\"\n\nSun's internal Http client uses something like \"Java/1.5.0_08\".\n\nI am completely ignoring the fact that real-world user agents use almost arbitrary strings.\nSome fine examples of misbehaviour from my private logs:\n\n\"Jakmpqes dihurxf wfyiupsc\" -- apparently somebody has to hide something...\n\"Missigua Locator 1.9\"\n\"Poodle predictor 1.0\"\n\"shelob v1.0\"\n\"ISC Systems iRc Search 2.1\"\n\"ping.blogug.ch aggregator 1.0\"\n\"http://www.uni-koblenz.de/~flocke/robot-info.txt\"  -- ...sigh\n\nI am very tempted to write a User-Agent string validator that prevents misuse of this field in HttpClient.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-655",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "User-Agent string violates RFC",
    "systemSpecification": true,
    "version": "3.1 RC1"
}