{
    "comments": [
        {
            "author": "Adrian Sutton",
            "body": "I've just noticed the target milestone for this and HTTPCLIENT-46 plug-in \nauthentication modules has been moved up to 2.0 alpha from 2.1 Final. I would \nbe interested in getting an idea of how many others are interested in \nsupporting these protocols as I have a large client who requires NTLM \nauthentication so I will be implementing it fairly soon.\n\nUnfortunately, I have fairly tight time constraints on this (fully completed, \ntested and shipping within in the next month or so) and so I am not able to \nwait long for plug in authentication module support or spend huge amounts of \ntime making the patch suitable for inclusion in HttpClient's standard CVS \nrepository.\n\nSo, how much interest is there in having NTLM authentication and is someone who \nis already familiar with the inner workings of HttpClient prepared to step up \nand add plug in authentication sooner rather than later?",
            "date": "2002-08-02T16:19:06.000+0000",
            "id": 0
        },
        {
            "author": "Adrian Sutton",
            "body": "Created an attachment (id=3233)\nZip file of patch and new files to provide NTLM support.\n",
            "date": "2002-09-26T13:07:43.000+0000",
            "id": 1
        },
        {
            "author": "Adrian Sutton",
            "body": "The attached patch provides NTLM support to HttpClient through two new classes, \nNTLM.java which handles the NTLM protocol and NTCredentials.java which provides \na Credentials class that can specify username, password, host and domain.\n\nThe patch also includes unit tests for NTLM based upon those for Digest and \nbasic authentication.  Note, that one of the existing test cases which tested \nmultiple authentication schemes needed to be changed from asking for NTLM and \nbasic to \"Unsupported\" and basic as we now support NTLM.",
            "date": "2002-09-26T13:13:38.000+0000",
            "id": 2
        },
        {
            "author": "Jeff Dever",
            "body": "Patch applied.  Thanks Adrian!",
            "date": "2002-09-26T18:41:25.000+0000",
            "id": 3
        },
        {
            "author": "Adrian Sutton",
            "body": "Since NTLM authentication does not use the concept of realms I'd previously \njust used the default credentials.  This is incredibly annoying and limiting if \nyou're using HttpMultiClient to connect to multiple NTLM authenticated \nservers.  These two attached patches change the NTLM support to first attempt \nto get the Host name from the Host header and use that to get credentials and \nthen fall back to the default credentials.  The second patch updates the test \ncases to test this new feature and generally work better with the change.",
            "date": "2002-10-02T14:29:34.000+0000",
            "id": 4
        },
        {
            "author": "Adrian Sutton",
            "body": "Created an attachment (id=3307)\nAdds a check for credentials specific to the host for NTLM authentication.\n",
            "date": "2002-10-02T14:30:11.000+0000",
            "id": 5
        },
        {
            "author": "Adrian Sutton",
            "body": "Created an attachment (id=3308)\nUpdates the test suite to test the new host based NTLM authentication.\n",
            "date": "2002-10-02T14:30:45.000+0000",
            "id": 6
        },
        {
            "author": "Adrian Sutton",
            "body": "These patches have been integrated into CVS and are working well.  This bug can \nnow be closed.",
            "date": "2002-10-29T13:42:49.000+0000",
            "id": 7
        }
    ],
    "component": "HttpClient (classic)",
    "description": "A late write in for this would be support for NTLM authenticatin as well as\nbasic and digest.  Obviously non-trivial but it would be a very big feature.\n\nAdrian Sutton, Software Engineer\nEphox Corporation\nwww.ephox.com <http://www.ephox.com>",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-72",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Support for NTLM authentication",
    "systemSpecification": false,
    "version": "2.0 Alpha 1"
}