{
    "comments": [
        {
            "author": "Roland Weber",
            "body": "Sebastian, thanks a lot for figuring this out. The situation is indeed even a bit worse, because what is logged is not the actual input from the wire, but what is returned by the parser. That's after stripping ignorable whitespace and concatenating continuation lines.\nAttached patch moves wire logging for headers (but not for the status line) from HttpMethodBase to HttpParser.readLine(...). Somebody please review this _carefully_. I know it compiles, but I don't have the environment set up to test whether it actually logs as expected...\n\ncheers,\n  Roland\n\n",
            "date": "2007-04-28T17:04:53.581+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Looks good to me\n\nOleg",
            "date": "2007-04-28T17:57:31.264+0000",
            "id": 1
        },
        {
            "author": "Roland Weber",
            "body": "patch committed",
            "date": "2007-04-28T18:20:27.608+0000",
            "id": 2
        }
    ],
    "component": "HttpClient (classic)",
    "description": "If HttpParser detects an error in any of the headers, it throws a ProtocolException\n\nAlthough the failing header is included in the Exception detail, the headers leading up to the failure are not logged, which makes it hard to debug (and is quite confusing, as the PE does not appear to be related to the data that has been received).\n\nThis is because the wire-logging is done in the caller (HttpMethodDirector) which only logs the header if the parse succeeds.\n\nPerhaps the Wire logging should be done at the point where the HttpParser reads the line.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-650",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Wire log is incomplete if HttpParser detects an error",
    "systemSpecification": true,
    "version": "3.1 RC1"
}