{
    "comments": [
        {
            "author": "Sam Berlin",
            "body": "committed fix -- please tweak the API / param names as desired.  i went with a strategy of adding a 'valid duration' to any release event, and storing the data in the existing IdleConnectionHandler, since it already stored time-sensitive info.  worked out pretty nicely i think.",
            "date": "2008-06-26T04:04:32.159+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Sam,\n\nI made some changes to the DefaultConnectionKeepAliveStrategy class and added more test cases. Please review. I also think it would be better if getKeepAliveDuration returned both TimeUnit and long in one go. Something like\n\nclass KeepAliveInfo {\n \n  long getTime();\n  TimeUnit getUnit();\n\n}\n\nOr we dropped TimeUnit altogether.\n\nOleg",
            "date": "2008-06-26T17:35:17.954+0000",
            "id": 1
        },
        {
            "author": "Daniel Woo",
            "body": "I found a similiar issue with 3.1. Will you fix 3.1? because I am using axis1 with CommonsHTTPSender which depends on httpclient3.x",
            "date": "2008-06-27T07:53:08.693+0000",
            "id": 2
        },
        {
            "author": "Ortwin Glück",
            "body": "Daniel, 3.1 is considered end of life. It is unlikely that there will be another release. We accept patches, if they have sufficient test coverage, however.",
            "date": "2008-06-27T08:49:24.113+0000",
            "id": 3
        },
        {
            "author": "Sam Berlin",
            "body": "i cleaned up the code a bit, including removing getUnit from the keep alive strategy.  i _think_ the new API is a little better, but could go either way.",
            "date": "2008-06-27T19:55:03.761+0000",
            "id": 4
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I also like it better this way.\n\nOleg",
            "date": "2008-06-27T20:30:39.091+0000",
            "id": 5
        }
    ],
    "component": "",
    "description": "HttpClient currently does not respect the 'Keep-Alive' header tokens (timeout, max, etc..) and continues to use the persistent connection beyond limits the server requests.  This leads to failure and falling back to HttpRequestRetryHandler, when it should instead just use a new connection explicitly.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-781",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Respect Keep-Alive Header",
    "systemSpecification": true,
    "version": "4.0 Alpha 4"
}