{
    "comments": [
        {
            "author": "imalka hemachandra",
            "body": "I’m a computer science third year student who willing to participate for GSOC 2011 and i am interested in this project idea. I would like to know further details on this topic. Looking forward to hear from you. Thanks in advance.   ",
            "date": "2011-04-08T03:30:29.817+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Imalka\n\nA successful completion of this project would require the following\n\n(1) Good understanding of the HttpClient 4.x API\n(2) Certain familiarity with the HTTP protocol in general\n(3) Familiarity with the concept of fluent interface [1]\n(4) Interest and ideally experience in designing APIs\n(5) Liaising with several Apache projects, primarily HttpComponents and Apache Stanbol (in incubation), and ability to reconcile different (often conflicting) ideas about interface / API design      \n\nIn sort, key requisites are HttpClient knowledge, understanding of fluent interface / API design and good communication. \n\nHope this gives you enough details / pointers for a GSoC proposal. \n\nOleg\n\n[1] http://en.wikipedia.org/wiki/Fluent_interface",
            "date": "2011-04-08T11:06:52.923+0000",
            "id": 1
        },
        {
            "author": "Xu Lilu",
            "body": "Source code and JavaDoc of the first submission.",
            "date": "2011-08-12T14:58:26.944+0000",
            "id": 2
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Lilu\n\nI put UriBuilder to the HttpClient module [1] and the rest to the new fluent-hc module [2] Please get the latest snapshot of HttpClient from SVN and try to build it from source \n\nThere is also a number of things that need fixing\n\n(1) Please _never_ use Throwable#printStackTrace() inside a library! Either rethrow exceptions with a different type (rethrow checked exception as an unchecked one, if appropriate), handle it if it can be handled internally by the class or in extreme cases log it through commons-logging. \n\n(2) FluentResponse currently depends on JUnit code, which is not okay in my opinion. Since there was no response from the Stanbol folks I we do not really know how important it is for them. I suggest we either remote the JUnit specific code or at least move it to the test folder for the time being. \n\n(3) Some test coverage would be quite useful\n\nCheers\n\nOleg\n\n[1] http://svn.apache.org/repos/asf/httpcomponents/httpclient/trunk/httpclient/src/main/java/org/apache/http/client/utils/UriBuilder.java\n[2] http://svn.apache.org/repos/asf/httpcomponents/httpclient/trunk/fluent-hc/",
            "date": "2011-08-13T09:53:38.452+0000",
            "id": 3
        },
        {
            "author": "Xu Lilu",
            "body": "1. Re-organized the structure of fluent-hc module. Two classes: FluentHttp and RequestBuilder have been removed.\n2. FluentRequest now has more constructors.\n3. Some JUnit 4 test cases have been added into the codes.\n4. Fixed some bugs (e.g., print exception's tracking info).",
            "date": "2011-08-22T16:15:35.896+0000",
            "id": 4
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Lilu\n\nI committed the patch to SVN trunk. Please review.\n\nThis officially concludes your participation in the GSoC 2011 program and results of your work will be evaluated based on the current content of the repository. Nonetheless, you are very welcome to continue contributing to the project beyond GSoC.\n\nOleg ",
            "date": "2011-08-22T19:44:06.648+0000",
            "id": 5
        }
    ],
    "component": "",
    "description": "Develop fluent API / facade to HttpClient based on code currently maintained by Apache Stanbol and Apache Sling projects. \n\nFor details see \n\nhttp://markmail.org/message/mmyljtgjp3za6kyz\n\nor contact Apache HttpComponents committers at dev@hc.apache.org",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-1076",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "[GSoC 2011] Fluent API to HttpClient",
    "systemSpecification": true,
    "version": ""
}