{
    "comments": [
        {
            "author": "Karl Wright",
            "body": "Hi all,\n\nLack of native NTLM support in 4.x also may block Lucene Connector Framework from using 4.x.  This is because many of its connectors require NTLM.  HttpClient 4.x's solution requires jcifs, and jcifs is a LGPL-licensed component, which means we cannot distribute it according to Apache rules.\n\nThe submitted patch has been granted to ASF officially to Apache as part of the software grant for LCF, and thus it can form the basis of a full featured NTLM implementation in HttpClient, which we feel would be highly desirable for the above reason.\n",
            "date": "2010-02-24T09:17:49.975+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Karl,\n\nNTLMvis a very touchy subject. I understand a lot of hard work has gone into this patch but I am afraid at this point of time it cannot be accepted. The trouble is we, as well as ASF in general, cannot distribute NTLM implementations for legal reasons. NTLM encryption algorithms may be covered by patents held by Microsoft, which would make commercial users of open-source NTLM implementations liable for the use of Microsoft intellectual property. Various high ranking ASF people are aware of the situation and promised to have this issue up with Microsoft, but to my knowledge there has been no practical outcome so far.\n\nI would even go as far as _strongly_ suggesting that the custom extensions to HttpClient that implement NTLM encryption algorithms be removed from Lucene Connector Framework, for the same reason they have been removed from HttpClient\n\nFor details on NTLM support in HttpClient 4.0 see:\nhttp://hc.apache.org/httpcomponents-client/ntlm.html\n\nOleg",
            "date": "2010-02-24T09:42:30.409+0000",
            "id": 1
        },
        {
            "author": "Karl Wright",
            "body": "Please see comments regarding this issue I've attached to httpclient-917.\n\nIf we conclude that patents will be violated, I will indeed remove all NTLM implementations from LCF, which would include even the upstream patch to httpclient-3.1 that was granted.  However, the consequences are severe to the functionality of that component that we'd want to verify this.\n\nAn NTLM implementation is also available for the Google connector framework, by the way, for what it is worth.\n\n",
            "date": "2010-02-24T11:55:41.792+0000",
            "id": 2
        },
        {
            "author": "Karl Wright",
            "body": "Reviewers here want to know if there's any controlling legal ASF document that describes the described policy available for their perusal.   A URL will do, or even a document title (if you recall seeing such a thing anywhere).\n\nAlso, FWIW, our expert here believes that ASF's legal structure may protect individual Apache contributors from liability concerns of this kind.  \"That's kind of why Apache exists,\" was the comment.\n\n\n",
            "date": "2010-02-24T18:40:36.550+0000",
            "id": 3
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "None I am aware of. You should ask at legal@apache.org\n\nOleg",
            "date": "2010-02-24T19:39:57.363+0000",
            "id": 4
        },
        {
            "author": "Karl Wright",
            "body": "I raised this specific issue on legal-discuss@apache.org yesterday, and received the following response from William A. Rowe, Jr.:\n\n>>>>>>\nAIUI - this is probably covered under the interop/Microsoft patent pledge.\nIf it is not, asking them to make it explicitly so might not be a big issue.\n\nSee\nhttp://www.microsoft.com/openspecifications/programs/wspp/wspp-patents/wspp-patent-pledges/ and\nrelated documents.\n<<<<<<\n\nThe document in question apparently pledges to protect open-source developers and their community against direct patent-infringement lawsuits for certain areas of their IP, including protocol specifications as described in this document:\n\nhttp://www.microsoft.com/openspecifications/programs/wspp/wspp-patents/\n\nThe patents that Microsoft licenses are described by protocol in the following document:\n\nhttp://download.microsoft.com/download/1/0/4/1041AEF2-0ABC-4D48-A909-EC3CD52A7F13/WSPP_Patent_Mapping.pdf\n\nThat document explicitly mentions NTLM as being a Microsoft protocol, but asserts no patent claims against it.\n\nSo if I read this correctly:\n\n(1) Open source developers are not subject to patent claims by Microsoft in any case, and\n(2) Microsoft asserts no patent claims whatsoever against NTLM, and does not suggest patent licensing for native implementations of such even against for-profit corporations.\n\nI will, of course, post any further responses that appear from legal-discuss.\n\n",
            "date": "2010-02-25T11:12:46.922+0000",
            "id": 5
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Karl\n\nGiven that we now have an explicit OK to include NTLM implementations in the ASF code (LEGAL-80), I can commit your patch to the project repository. However, there is one minor technicality that we need to discuss first. HttpClient 3.1 is effectively EOL and is not planned to have any official releases any more. So, the patch needs to be ported to the 4.x API. Would you have time and inclination to work on the port or is that something I would have to do myself?\n\nOleg",
            "date": "2010-10-18T13:48:39.268+0000",
            "id": 6
        },
        {
            "author": "Karl Wright",
            "body": "That's great news!\n\nIf the authentication architecture is at all similar, it should not take me too long to do this.  The logic trickiness is in all the encryption, and perhaps in getting some DC's set up with the proper switches for testing.  But I won't be able to start on it for a couple of weeks at best.  But by then I am hoping to have procured access to my old testing environment formerly at MetaCarta and now at qBase, so that I can verify the code.\n\nIf your time frame is too urgent for that, then by all means I urge you to go ahead.\n",
            "date": "2010-10-18T13:58:05.965+0000",
            "id": 7
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I would like to have the NTLM code incorporated before 4.1 goes BETA in order to have more time for testing. I'll take a stab at porting the patch but I would really appreciate if you could invest some effort into testing NTLM authentication in HttpClient 4.1 once ready. Some test coverage would also be nice ;-)\n\nOleg ",
            "date": "2010-10-18T14:16:27.958+0000",
            "id": 8
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Patch ported and committed to SVN trunk.\n\nKarl, could you please review / test NTLM support in HttpClient 4.1 when you happen to have time?\n\nOleg",
            "date": "2010-10-18T19:29:54.158+0000",
            "id": 9
        },
        {
            "author": "Karl Wright",
            "body": "I will test as soon as I have the means.  Hopefully that willl be sometime next week.\n",
            "date": "2010-10-19T09:28:01.554+0000",
            "id": 10
        },
        {
            "author": "Andrew Bruno",
            "body": "Does this mean that the patch checked into SVN changes this:  http://hc.apache.org/httpcomponents-client-ga/ntlm.html  (i.e. No need for JCIFS, etc.)\n\nAlso, do you know when 4.1 Alpha3 will be released?  \n\nAndrew",
            "date": "2010-11-04T04:38:09.202+0000",
            "id": 11
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Andrew,\n\nJCIFS is no longer required. NTLM should work right out of the box with the next release.\n\nHttpClient 4.1-beta1 can be expected within a week.\n\nOleg",
            "date": "2010-11-04T09:18:49.121+0000",
            "id": 12
        }
    ],
    "component": "HttpClient (classic)",
    "description": "The current HttpClient implementation lacks support for all enhancements to NTLM after Windows 95.  That includes NTLMv1, NTLMv2, and NTLM2 Session Response varieties of the protocol.\n\nThis seriously impacts the usability of HttpClient in enterprise situations, which has required the Lucene Connector Framework team to extend HttpClient to address the issue.\n\nI've attached a patch which contains the implementation used by LCF.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-919",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "NTLM implementation lacks support for NTLMv1, NTLMv2, and NTLM2 Session forms of NTLM",
    "systemSpecification": true,
    "version": ""
}