{
    "comments": [
        {
            "author": "Jon Moore",
            "body": "Hi Bart,\n\nYour patch looks great, although we need you to grant license to the ASF to include your patch. Can you either edit your attachment to grant ASF permission, or re-upload it with the proper permissions?\n\nThanks,\nJon\n",
            "date": "2011-06-09T14:09:15.758+0000",
            "id": 0
        },
        {
            "author": "Jon Moore",
            "body": "By the way, I suppose this is presumed by my earlier response, but I agree this is a bug. The cache entry should only be considered invalid if there is a Content-Length header present and it does not match the length of the cached response body. If a Content-Length header is not present, then the entry should be presumed valid (at least per the sense of this test).\n",
            "date": "2011-06-09T14:12:48.712+0000",
            "id": 1
        },
        {
            "author": "Bart Robeyns",
            "body": "with license granted to ASF",
            "date": "2011-06-09T14:14:58.130+0000",
            "id": 2
        },
        {
            "author": "Jon Moore",
            "body": "Hi Bart, patch applied to trunk. I'll also work on backporting this to the other release branches.\n",
            "date": "2011-06-09T15:03:41.341+0000",
            "id": 3
        },
        {
            "author": "Jon Moore",
            "body": "...and, by the way, Bart, thanks very much for your contribution!\n",
            "date": "2011-06-09T15:04:17.596+0000",
            "id": 4
        },
        {
            "author": "Jon Moore",
            "body": "Also backported to the 4.1.x release branch.\n",
            "date": "2011-06-09T15:14:02.344+0000",
            "id": 5
        }
    ],
    "component": "HttpCache",
    "description": "A cached entry whose original response didn't carry a Content-Length header, should not be rejected for considered invalid because the length of its cached content is different from the non-existing Content-Length header value. The attached patch only verifies the lengths if the header was originally present.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-1100",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Missing Content-Length header makes cached entry invalid",
    "systemSpecification": true,
    "version": "4.1.1, 4.1.2, 4.2 Alpha1"
}