{
    "comments": [
        {
            "author": "Roland Weber",
            "body": "Take 1 on alternative connection interfaces. Note that this is a tar, not a patch.\n\nI have used class and interface names that do not collide with existing ones. The idea is to have a few review cycles on the new interface before I have to modify all code that uses connections. Even so it took several hours longer than I had expected for a first draft. All classes and interfaces spelled \"connexion\" are supposed to be renamed to \"connection\". (Did you know that \"connexion\" is an oldfashioned but correct british spelling?) The code in the default implementation classes is copied and pasted from existing implementations. They compile and javadoc, but they have not been tested.\n\nThe general idea is to turn the connection into a simple container for a socket and associated objects. The logic for creating the socket, that is for establishing the connection, is moved to an \"operator\" (as in switchboard). The tricky part is that the operator must be able to modify the connection's state in ways that should not be available to an application developer. In order to achieve this, I have defined a third interface with internal operations that are only exposed to the operator. Here is a list of the new interfaces and classes:\n\nHttpClientConnexion - container for the connection, replaces HttpClientConnection and HttpProxyConnection. Knows it's operator and delegates calls such as open and close there.\nHttpClientConnInternal - internal operations for the connection. An instance of this interface is passed to the operator whenever the connection delegates a call there.\nHttpClientConnOperator - provides logic for opening and closing connections, uses the connection internal operations\nAbstractHttpClientConnection - defines all attributes mandated by the HttpClientConnexion and HttpClientConnInternal interfaces and implements the delegation to the operator. Internal operations are implemented by an inner class. Derived classes can focus on send/receive operations.\n\nimpl.DefaultHttpClientConnexion - implements send/receive logic mostly copied over from DefaultHttpClientConnection and AbstractHttpConnection.\nimpl.DefaultHttpClientConnOperator - implements socket creation logic mostly copied over from DefaultHttpClientConnection and DefaultHttpProxyConnection, and close/shutdown logic copied over from AbstractHttpConnection.\n\nI had some trouble in assigning the responsibility for the stale connection check (fallback implementation in DHCCOperator, better implementation in DHCConnexion) and the response availability check (connection, for now). The hooks that allow for the connection to create receiver/transmitter objects after the socket has been created by the operator need improvement. Anyway, you'll get the idea, and I have already spent three evenings with this.\n\nPlease let me know what you think. I may find time for minor revisions this weekend, everything else must wait at least one week, probably two.\n\ncheers,\n  Roland\n\n",
            "date": "2006-08-25T18:28:06.000+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Blocked by HTTPCORE-11",
            "date": "2006-08-28T14:09:14.000+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Roland,\n\nPlease give me time until Sunday to come up with an alternative proposal for your consideration\n\nOleg",
            "date": "2006-09-16T12:03:02.000+0000",
            "id": 2
        },
        {
            "author": "Roland Weber",
            "body": "Updated the description with the results of our last discussion on the mailing list.",
            "date": "2006-09-21T20:20:57.000+0000",
            "id": 3
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Hi Roland,\n\nCould you possibly live with these changed, at least short term (see two patches attached)? \n\nChangelog:\n----------\n* HttpCore: HttpClientConnection#open() method is no more\n* HttpAsync: Added  HttpAsyncClientConnection interface, which extends HttpClientConnection and preserves the semantics of HttpClientConnection that existed before the changes to the interface \n\nI admit HttpAsyncClientConnection is quite hackish and is not meant a long term solution. However, it does help to preserve the existing semantics of HttpAsync and helps us get HttpCore moving forward. Moreover, I think in the future it would make sense for HttpAsync to adopt a connection framework of either HttpCore NIO or HttpConn, so all this hooplah about open method will no longer be of any relevance.    \n\nOleg",
            "date": "2006-09-23T18:37:23.000+0000",
            "id": 4
        },
        {
            "author": "Roland Weber",
            "body": "Hi Oleg,\n\nno objections from my side. You should remove or fix the class end comment in HttpAsyncClientConnection, though :-)\nAnd the @author tag for both interface and implementation.\n\ncheers,\n  Roland\n",
            "date": "2006-09-24T16:02:18.000+0000",
            "id": 5
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "20060923-httpasync.patch  and 20060923-httpcore.patch checked in. I am going to move the issue to HttpClient shortly.\n\nOleg",
            "date": "2006-09-24T16:30:02.000+0000",
            "id": 6
        },
        {
            "author": "Roland Weber",
            "body": "I just noticed that HttpClientConnection still has the getTargetHost() method. If our goal is to define only a minimal interface in HttpCore, that should be removed too. HttpRequestExecutor no longer creates the HttpContext, so the caller can initialize the target host in the context.\n\ncheers,\n  Roland\n",
            "date": "2006-09-25T12:31:48.000+0000",
            "id": 7
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "> I just noticed that HttpClientConnection still has the getTargetHost() method. If our goal is to define only a minimal interface in HttpCore, \n> that should be removed too. HttpRequestExecutor no longer creates the HttpContext, so the caller can initialize the target host in the context. \n\nTaken care of. #getTargetHost() method removed from HttpClientConnection\n\nOleg",
            "date": "2006-10-05T10:14:43.000+0000",
            "id": 8
        },
        {
            "author": "Roland Weber",
            "body": "Even if connections do not themselves use socket factories, there needs to be code that uses both interfaces. Patches for these two issues can therefore not be developed in parallel.",
            "date": "2006-12-27T17:28:52.000+0000",
            "id": 9
        },
        {
            "author": "Roland Weber",
            "body": "I consider this issue fixed with the OperatedClientConnection. We can open a new issue for changes after review.",
            "date": "2007-02-04T11:30:30.714+0000",
            "id": 10
        }
    ],
    "component": "HttpClient (classic)",
    "description": "Instead of trying to define a full abstraction for client connections, let's define only a minimal interface in HttpCore with only those methods actually needed in the core. In particular, the core does not need to open connections (since HTTPCORE-11), and it does not care whether a connection is direct or through a proxy. An abstraction for client connections can be defined in HttpConn.\n\n(original description:)\nAs discussed on the mailing list, separating the responsibility for establishing connections from the connection objects could improve the design and help with proxy support.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-602",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "refactor HttpClientConnection and HttpProxyConnection",
    "systemSpecification": true,
    "version": ""
}