{
    "comments": [
        {
            "author": "Sylvain Laurent",
            "body": "I had raised the same problem for version 3.x in HTTPCLIENT-886, but it was dismissed :-(\nThis time I hope I found the applicable part of the RFC to make my point.",
            "date": "2010-09-07T20:51:47.368+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Fixed in trunk.\n\nOleg",
            "date": "2010-09-08T20:12:41.600+0000",
            "id": 1
        },
        {
            "author": "Sylvain Laurent",
            "body": "thanks.\nIt would be nice to add some trace or debug level messages to explain the decision returned by the retryHandler...",
            "date": "2010-09-08T20:26:25.489+0000",
            "id": 2
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I personally think that logging in DefaultRequestDirector is sufficient, but do feel free to contribute a patch with proposed changes.\n\nOleg",
            "date": "2010-09-08T20:32:48.959+0000",
            "id": 3
        }
    ],
    "component": "HttpClient (classic)",
    "description": "In DefaultHttpRequestRetryHandler, in case of NoHttpResponseException, the request is retried, without taking into account whether the http method is idempotent or not. This violates RFC 2616 section 8.1.4 which states :\n{quote}\nThis means that clients, servers, and proxies MUST be able to recover\n   from asynchronous close events. Client software SHOULD reopen the\n   transport connection and retransmit the aborted sequence of requests\n   without user interaction so long as the request sequence is\n   idempotent (see section 9.1.2). Non-idempotent methods or sequences\n   MUST NOT be automatically retried, although user agents MAY offer a\n   human operator the choice of retrying the request(s).\n{quote}\n\nThe fix is simple : at line 94, just remove the {{if (exception instanceof NoHttpResponseException) }} block. This way the idempotency of the method will be taken into account a bit further in the same method.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-989",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "DefaultHttpRequestRetryHandler must not retry non-idempotent http methods (violates RFC 2616)",
    "systemSpecification": true,
    "version": "4.0.1, 4.1 Alpha2"
}