{
    "comments": [
        {
            "author": "Roland Weber",
            "body": "Checked the source code again. Layered does not imply tunnelled.\n",
            "date": "2007-12-21T05:12:42.853+0000",
            "id": 0
        },
        {
            "author": "Roland Weber",
            "body": "I added two enums for tunnelled and layered. The boolean constructors are still present and deprecated, I don't want to change the test cases and other code until this has been reviewed.\n\ncheers,\n  Roland\n",
            "date": "2007-12-21T05:45:56.591+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Looks good to me.\n\nOn a related note, there is currently no way to override the default route planner on a per request basis, a feature some users may miss. We probably should be retrieving the actual route planner from the HTTP context, where it could be overridden, or provide HttpClient#execute method that takes a custom route planner as a parameter.\n\nOleg",
            "date": "2007-12-21T11:01:49.273+0000",
            "id": 2
        },
        {
            "author": "Roland Weber",
            "body": "Deprecated constructors are removed, testcases updated. Enum arguments can be null, I've mapped null arguments to the respective PLAIN constant. If you prefer exceptions in this case, feel free to fix that.\n\nLet's discuss the route planner when I've finished HTTPCLIENT-716. The authentication handlers and method retry handler are not overridden per request either. They encapsulate logic, overriding is only required for the data on which the logic operates.\n\ncheers,\n  Roland\n",
            "date": "2007-12-21T13:18:48.796+0000",
            "id": 3
        }
    ],
    "component": "",
    "description": "Some of the constructors of HttpRoute have three boolean parameters.\nUse enumerations to reduce the potential for confusion.\n\nThe flags for tunnelled and layered are not independent, since layered implies tunnelled.\nThese can be combined to a 3-valued enum.\n",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-712",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Trivial",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "improve HttpRoute API",
    "systemSpecification": true,
    "version": "4.0 Alpha 2"
}