{
    "comments": [
        {
            "author": "Oleg Kalnichevski",
            "body": "In order to avoid unnecessary overlap in efforts I want to inform you that I\nstarted working on this one. \n\n[sighing]\n\nOleg ",
            "date": "2004-06-22T02:19:04.000+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Created an attachment (id=12165)\nexception handling guide (take 1)\n",
            "date": "2004-07-20T02:23:18.000+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Folks,\nHere's the first draft version of the exception handling guide. Please let me\nknow how it is shaping up. \n\nOleg",
            "date": "2004-07-20T02:25:19.000+0000",
            "id": 2
        },
        {
            "author": "Michael Becke",
            "body": "Wow Oleg!  Nice work.  This is quite a thorough addition.  I read it mostly for content and it looks quite \ngood.  There were a few minor grammatical problems which we can fix once it's checked in. \n\nThe only error I noticed was a typo in the ProtocolException section where HttpException was \naccidentally used at the beginning of the paragraph. \n\nContent-wise the only part that stuck out to me was the inclusion of the many exceptions that users \nwill never see.  It's nice that they're documented, but being that it's a user guide I think it may confuse \npeople.  If we could separate the non-user exceptions somehow that would be good.  A separate \nsection may be enough.\n\nMike",
            "date": "2004-07-20T09:40:28.000+0000",
            "id": 3
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Mike,\nI am glad that several week of self-inflicted misery seem to have resulted in\nsomething useful. I think it now would make more sense if you took it over from\nme. Feel free to rearrange things to your liking and make corrections that you\ndeem necessary. \n\nMeanwhile I concentrate on drafting up the remaining documentation\n\nDo you think that would be OK with you?\n\nOleg",
            "date": "2004-07-20T21:57:11.000+0000",
            "id": 4
        },
        {
            "author": "Michael Becke",
            "body": "Sounds like a plan.  I'll make some edits and commit the docs.\n\nMike",
            "date": "2004-07-21T09:57:52.000+0000",
            "id": 5
        },
        {
            "author": "Michael Becke",
            "body": "Well, after much delay, this has finally been edited and committed.  Nice work on this Oleg!\n\nMike ",
            "date": "2004-09-05T00:06:59.000+0000",
            "id": 6
        }
    ],
    "component": "HttpClient (classic)",
    "description": "There should be more detailed documentation on HttpClient::executeMethod and\nHttpMethod::execute about exceptions thrown in which cases.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-324",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "[API Doc] Document exceptions thrown on execute methods",
    "systemSpecification": true,
    "version": "2.0 Final"
}