{
    "comments": [
        {
            "author": "Oleg Kalnichevski",
            "body": "Both HttpRequest and Cookie may be difficult to clone by means of standard Cloneable, #clone() partially due to the fact it is utterly broken. What we could do is to provide a Copyable interface that could be used to produce equivalent copies of complex compound objects. HTTP messages with streaming entities could buffer the content in order to make it copyable. \n\nThoughts?\n\nOleg",
            "date": "2007-12-16T14:26:05.212+0000",
            "id": 0
        },
        {
            "author": "David Byrne",
            "body": "Oleg,\n\nSorry for the slow response. I've been tied up with the holidays, etc. I'm not concerned if the classes aren't strictly \"cloneable\"; I just want to make a copy. I hadn't considered the  problems with streaming entities, but your idea makes sense.\n\nThanks,\nDavid\n\n",
            "date": "2007-12-30T18:17:48.846+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "It turned out some minor changes needed to be done to AbstractHttpMessage in core in order to resolve the issue (some instance variables are currently declared private final and therefore cannot be deep-copied). Pushing back to alpha4\n\nOleg  ",
            "date": "2008-02-10T15:10:56.119+0000",
            "id": 2
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Resolved in SVN trunk.\n\nOleg",
            "date": "2008-05-22T18:27:30.239+0000",
            "id": 3
        }
    ],
    "component": "HttpClient (classic)",
    "description": "It would be nice to have a clone method for some of the classes that don't have getters & setters exposed for all of their fields. Where relevant, the clone method could be in the interface, so that it doesn't matter which implementing class is being used. The main interfaces that I would like to clone are HttpRequest and Cookie. I know that HttpRequest is technically part of HttpCore, but the primary implementations of it are in HttpClient, so I thought I would post it here. \n\nThanks,\nDavid Byrne",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-719",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Clone support",
    "systemSpecification": true,
    "version": ""
}