{
    "comments": [
        {
            "author": "Johannes Koch",
            "body": "AFAIK, classes implementing Serializable must have a non-argument constructor and non-final member variables. This would have to be changed. However, I support this request. Or add a way to create serializable versions of Credentials (and Headers?).",
            "date": "2010-02-23T08:38:49.945+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "As far as I know a class does not have to comply with the Java Bean spec in order to be Serializable. Both HttpHost and HttpVersion are valid Serializable while they do not have a no arg constructor and have final fields.\n\nI always wanted to keep persistence aspects out of HttpClient but,  if there is popular demand for it, I can live with making BasicUserPrincipal, NTUserPrincipal, as well as BasicClientCookie, BasicClientCookie2, and BasicCookieStore Serializable.\n\nOleg",
            "date": "2010-02-23T12:33:09.470+0000",
            "id": 1
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Fixed in SVN trunk\n\nOleg",
            "date": "2010-02-26T12:19:19.715+0000",
            "id": 2
        },
        {
            "author": "Johannes Koch",
            "body": "Do you mind making BasicHeader and BufferedHeader also implement Serializable?",
            "date": "2010-02-26T13:14:29.733+0000",
            "id": 3
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I very much regret making HttpHost and HttpVersion serializable. In my opinion persistence aspects should be kept out of HttpCore. Why do you want those classes serializable?\n\nOleg",
            "date": "2010-02-26T13:24:46.854+0000",
            "id": 4
        }
    ],
    "component": "HttpClient (classic)",
    "description": "I've been working on upgrading the HtmlUnit library to use HttpClient 4, and I've realized that we could eliminate some hackish internal code if Credentials instances were Serializable. I don't really see a downside, and this would be a huge convenience for us.\n\nThe change would involve making the org.apache.http.auth.Credentials interface extend Serializable, and having org.apache.http.auth.BasicUserPrincipal and org.apache.http.auth.NTUserPrincipal implement Serializable (plus serialVersionUIDs where appropriate, I guess).",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-916",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "RFE: Make Credentials Serializable",
    "systemSpecification": true,
    "version": "4.0.1"
}