{
    "comments": [
        {
            "author": "Oleg Kalnichevski",
            "body": "ContentDescriptor was copied from mime4j and its javadocs are wrong with regards to nullability of mimeType and transferEncoding.\n\nOleg",
            "date": "2010-12-21T20:52:44.495+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I took a closer look at the classes that implement ContentDescriptor and they all return non-null values for mimeType and transferEncoding. I was wrong about javadocs being wrong. \n\nFormBodyPart is simply coded defensively. I do not think we have any problem at all. Feel free to change FormBodyPart or re-phrase javadocs of ContentDescriptor, if you deem it necessary.\n\nOleg",
            "date": "2010-12-21T20:59:19.110+0000",
            "id": 1
        },
        {
            "author": "Sebb",
            "body": "Fixed in r1051664",
            "date": "2010-12-21T21:45:53.052+0000",
            "id": 2
        }
    ],
    "component": "HttpClient (classic)",
    "description": "The FormBodyPart does not agree with ContentDescriptor Javadoc wrt nullability of mimeType and transferEncoding:\n\nThe code in FormBodyPart explicitly allows mimeType and transferEncoding to be null, in which case the relevant header is not generated.\nThis is useful behaviour, as the headers are not necessaruly needed.\n\nHowever the bahaviour disagrees with the Javadoc in the ContentDescriptor interface - null is not allowed.\nAlso, AbstractContentBody does not allow mime-type to be null.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-1037",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "FormBodyPart code does not agree with ContentDescriptor Javadoc wrt nullability of mimeType and transferEncoding",
    "systemSpecification": true,
    "version": ""
}