{
    "comments": [
        {
            "author": "Roland Weber",
            "body": "Hello Endre,\n\nyou are answering most of your suggestions yourself. Let's start with the last one, the different logger roots. That issue is known as HTTPCLIENT-497. Unfortunately, we missed it for 3.0 as well as 3.1 and can't change it now in 3.x without breaking compatibility. That's a clear wontfix.\n\nFor the rest, we have only two developer log levels to choose from, and we must use them carefully. For example, the wire log which you mention uses DEBUG for the status/response and header lines and TRACE for the message entities. That's because we want to be able to get a wire log of the headers without potentially dumping megabytes of binary data we're not interested in. Other parts of HttpClient may face similar tradeoffs.\nThe developer log levels are there so we, the developers, can get information we require to help users when debugging problems in various places throughout the HttpClient code. I think it is not undue that we are allowed to use two different developer log levels everywhere in order to reduce the logging noise where appropriate. If you decide to switch on DEBUG traces for _all_ of HttpClient, it's only fair that you suffer the consequences. I don't think we should have to restrain ourselves to all-or-nothing logging for DefaultHttpParams or HttpMethodBase or any other part of HttpClient because you're only interested in some of the log messages and don't want to bother with configuring your logging framework accordingly.\n\nSaying that, if you feel there are parts of the code where we _locally_ used the two developer log levels inappropriately, or where log message phrasing could be improved, we'll happily review, discuss, and accept patches :-) I'm afraid we don't have the personpower available to perform a review of log levels for the old code base just for the fun of it. HttpClient 3.x is on life support because we are focusing our efforts on HttpComponents 4.0.\n\ncheers,\n  Roland\n",
            "date": "2006-11-28T16:01:07.000+0000",
            "id": 0
        },
        {
            "author": "Endre Stølsvik",
            "body": "@Roland: I don't quite see what you're answering/commenting - did you read the entire description?!\n\nI did NOT at ANY POINT say that you should stop using DEBUG: I've however not seen a single log-line from httpclient that outputs on TRACE. (Full wire-dump doesn't belong in DEBUG, IM(F)O)\n\nIn my description, I try to point out that I'd appreciate IF you DID use TRACE \"somewhat more extensively\" (given that it isn't used at all now, AFAICS).\n\nAnd I came up with some quick candidates for which loglines that would be better sent to TRACE than DEBUG.\n\nGiven that I do not suggest that you delete one single log-statement, only \"downgrade\" some loglines from DEBUG to TRACE, I do not understand where you're coming from in your comment at all.\n\nAlso, I firmly believe that you folks should think of \"the developers\" not as yourself, but as the users of your library. There are many more of the latter than the former. However, given, again, that I do not suggest that you delete one single logline, I can't seem to get why not both camps could be pleased in this particular situation.",
            "date": "2006-11-29T13:54:52.000+0000",
            "id": 1
        },
        {
            "author": "Ortwin Glück",
            "body": "Endre,\n\nIt would help a lot if you attached to this issue a diff -u with your suggested trace logs.  It should generally not be a problem for us to move some of the log down to TRACE level. Personally I favour the finer level granularity especially in large systems that use lots of components (see JBoss for instance). It allows to dig deep into the inner workings if necessary but keeps log down normally.\n\nOrtwin",
            "date": "2006-11-29T14:06:29.000+0000",
            "id": 2
        },
        {
            "author": "Roland Weber",
            "body": "Hello Endre,\n\nyes, I read your entire description at least twice before answering. It does not mention anywhere that TRACE level is not used at all. If that is indeed the case (I haven't checked) I agree that this could be improved by making use of both log levels. Remember my invitation to provide patches?\nYour examples include wire logging, which is exactly the place where I know we've been using both levels. The other specific examples are not DEBUG statements that should be downgraded, but whole classes - which I interpreted as a request to downgrade all DEBUG statements in those classes. Just moving all log/trace statements of a whole class from DEBUG to TRACE is imho not an improvement. If all output is currently at DEBUG level, it's not a deterioration either, I'll grant you that. It's just work that somebody has to do.\nWhat you actually suggest is that we review all DEBUG level log statements and decide which of them should be downgraded. That is a _lot_ of work, and we already have more work on our list than can be achieved in a reasonable amount of time by those active developers we have. Remember my invitation to provide patches? Reviewing patches is work as well, but it's something I am willing to spend time on.\n\nI have adopted the terminology which is commonly used on our mailing lists and in our wiki. Developers are folks working on our code base, users are folks using our code base. We put a lot of effort into keeping our users happy and satisfied. Logging is one of the tools we require to do that. But it's not a core functionality that is broken and needs fixing. It could be improved all right. The question is: who's going to spend the time for doing that?\nSince you're probably not familiar with our staffing situation, here is a short overview. We have one and a half active developers. Since about a year ago, we are putting our efforts into a _complete_ overhaul of the API and code base, to become HttpComponents 4.0. We've made some progress, but we're still months if not years away from even a beta of HttpClient 4.0. There is a reason why we overhaul the API completely: the 3.x API is broken by design. We've put in as much functionality as can reasonably be put in (maybe even more), but we can't continue along that road. The code needs a complete rework, and that's what we're doing. Which means that 3.x is a legacy code base into which we'll put as much effort as needed, but as little effort as possible.\nWe are all quite willing to keep both camps happy. To keep \"our\" camp happy, all you have to do is find someone who's going to submit patches. Both Oleg and I, and probably also some of the less active committers, will gladly spend our time on reviewing such patches so they can be integrated into the code base. And we'll do that out of respect for the effort of whoever it is that comes up with the patches. What you can not expect Oleg or me to do is to spend our limited time on cosmetic improvements of the legacy code base, while the todo list for the new code base is growing from months to years. If something is broken in 3.x, we'll fix it. If somebody submits patches for improvements, we'll review them to get them in as quickly as possible. But we're not going to do code reviews for mere improvements.\n\nI hope this clarifies things a bit. My response was not meant to imply your suggestions are unreasonable. I rather wanted to point out that they are cosmetic in nature, have a minimal priority on our list, and there's nobody at hand to do the work. If anyone steps forward to help maintain the legacy code base, we'll gladly support such effort.\n\ncheers,\n  Roland\n",
            "date": "2006-11-29T19:00:28.000+0000",
            "id": 3
        },
        {
            "author": "Endre Stølsvik",
            "body": "Yes it clarifyes things a good bit. I guess I didn't realize the extent to which 3.x is \"abandoned\". Looking forward to a new'n'fresh 4.0, then! :)  (with new'n'fresh bugs?! :) )\n\nI guess simply coming up with an \"exact\" set of log-lines that could do with trace doesn't cut it? It has to be actual patches? (Setting up a new project just takes some time..)\n\nIf you'd just set the one log-line that dump the wire (Onto logger \"httpclient.wire.content\") to do log.trace(..) instead of log.debug(..) next time you're around that code, that would help a lot, I believe.\n  (Actually, the number of bytes read in one chunck could be nice to have output on debug, in addition to all the actual wire content ouput on trace - this would give a nice interleaving effect with the processing of the body of the response, so that _my_ debug or trace lines was interleaved with the actual TCP connection \"chunk\" fetching..).\n\nI'll try to come up with a patch for some more.\n\nNB/PS: Once again, I actually think that _extensive_ logging og httpclient rocks. Having the actual wire-content available in such a nice output is really nice. It's just \"a bit\" on the verbose side when things actually are working!\n\nThanks,\nEndre.",
            "date": "2006-11-30T09:01:56.000+0000",
            "id": 4
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Abandoned may be too strong a word. The point is further improvement of HttpClient is simply not feasible without fundamental changes in the core components (see [1]). HttpClient 3.x line will be supported until HttpClient 4.x is ready and well tested. This said, anyone how wants new features / non-critical fixes in HttpClient 3.x must be prepared to 'scratch his/her own itch'\n\nOleg\n\n[1] http://jakarta.apache.org/httpcomponents/commons-httpclient-lessons.html",
            "date": "2006-11-30T09:32:26.000+0000",
            "id": 5
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "No more annoying and completely useless TRACEs. HttpClient now produces much more conciser logs \n\nOleg",
            "date": "2007-05-12T11:02:26.992+0000",
            "id": 6
        }
    ],
    "component": "",
    "description": "[This is basically a copy of the Spring improvement request SPR-2873: http://opensource.atlassian.com/projects/spring/browse/SPR-2873 )\n\nGiven a developer situation: Much of the DEBUG information in the log of HttpClient is very un-interesting as long as it works. Some of these lines are however of much bigger importance than others (thus turning off DEBUG globally for HttpClient isn't good either).\n\nTRACE and DEBUG are the two developer-centric logging levels of log4j and commons logging (the rest are \"production levels\"). Since log4j-1.2.12, TRACE have existed. Clogging have always had trace, but before release 1.1 mapped Log.trace to log4j's DEBUG, but 1.1 (released May 9. 2006) now maps to log4j's TRACE.\n\nI think that HttpClient's logging would benefit a lot by using TRACE level extensively, in that developers could turn all of httpclient's logging down to DEBUG, but still see \"major developer events\" like connections being opened, the request being sent, and e.g. the response's status line, size of headers and body, keep-alive vs. closing of connection.\n\nCandidates for TRACE level include:\n  * httpclient.wire.*\n  * org.apache.commons.httpclient.params.DefaultHttpParams\n  * org.apache.commons.httpclient.HttpMethodBase\n  * .. and probably a bunch of others that doesn't bring the developer in the standard \"good flow mode\" any highly interesting information. \n\nPlease note that I do NOT view these lines as worthless. It is however in _normal_ developer circumstances not valuable information, and it would ease development if it was possible to turn these ultra-verbose loglines off easily. When things just aren't working out, and your exciting REST-based query doesn't work out, or your charset encodings just doesn't give what you're expecting, you'd turn on TRACE to really get down to the hard core. You'd find the problem, fix it, and set it to DEBUG again.\n\nIn addition, the lines that were left on the DEBUG level should obviously be as informative as possible, and thus maybe somewhat more verbose than now, trying to \"aggregate\" some pieces of information that now are output over several DEBUG lines..\n\nI do realize that I could achive a lot of this with a rather extensive log configuration, that also had to include raw text filters, but I do believe that this affects more developers than me!\n\nPS: it wouldn't hurt either if all of httpclient's log-lines came from a common root, e.g. \"HttpClient\", or \"org.apache.commons.httpclient\", instead of having several roots. This would however be a somewhat \"backward incompatible\" change, since it now has (at least?) two roots.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-609",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Use TRACE logging instead of DEBUG for the absolute nitty-gritties",
    "systemSpecification": true,
    "version": "3.1 Beta 1"
}