{
    "comments": [
        {
            "author": "Ortwin Glück",
            "body": "Created an attachment (id=17372)\nPatch by Jasper van Zandbeek\n",
            "date": "2006-01-09T23:23:43.000+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I respectfully remain -0.9 on this one. (just a bit short of vetoing it). Odi,\nare you still planning to check this one in?\n\nOleg",
            "date": "2006-05-06T20:03:17.000+0000",
            "id": 1
        },
        {
            "author": "Ortwin Glück",
            "body": "Yes, I am 100% +1 for this. Even if this is a corner use case it is compliant\nwith the specs and something we should support.",
            "date": "2006-05-06T20:13:53.000+0000",
            "id": 2
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "I do not want to start over that whole discussion whether this is spec compliant\nor not. Please do, however, review the entire code base to make sure \"virtual\"\nport value is used consistently with that of the virtual host. There is more\nthan a few occurrences where the virtual host value is being used, for instance\nto look up credentials and cookies.\n\nOleg ",
            "date": "2006-05-06T20:29:35.000+0000",
            "id": 3
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Pushed to 4.0\n\nOleg",
            "date": "2006-09-08T15:02:11.000+0000",
            "id": 4
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "Implemented in SVN trunk\n\nOleg",
            "date": "2007-05-21T13:33:47.151+0000",
            "id": 5
        }
    ],
    "component": "HttpClient (classic)",
    "description": "We use a load balancer that connects to the HTTP server and the HTTP server\nconnects to the application server. We use port translation in our load\nbalancer. So when e.g. a client connects to 90 of the load balancer, the load\nbalancer connects to port 100 of the HTTP server. The load balancer doesn't\nchange the Host request header, so in the host request header is still the\noriginal virtual host name and port, in this case port 90. For this reason, the\nvirtual hosts of the HTTP server and application server are configured based on\nthe external port numbers, so in this case port 90.\n \nFor test purposes, we sometimes want to connect directly to the HTTP server or\nthe application server, bypassing the load balancer. To do this, we need to\nconnect to the same port as the load balancer would, in this example port 100,\nbut the host header of this request should be the same as if the request would\ngo through the load balancer, so in this example port 90, because the HTTP\nserver and application server's virtual hosts are configured for this port.\n\nThe attached patch adds the possibility to specify the port number for virtual\nhosts.\n\nHere's a code snippet that uses the patched code:\n\nHttpClient httpClient = new HttpClient();\nHttpMethod method = new GetMethod();\nHostConfiguration hostConfiguration = new HostConfiguration();\nhostConfiguration.setHost(\"localhost\", 80, \"http\");\nHostParams params = new HostParams();\nparams.setVirtualHost(\"localhost\");\nparams.setVirtualHostPort(100);\nhostConfiguration.setParams(params);\nhttpClient.executeMethod(hostConfiguration, method);\nSystem.out.println(method.getResponseBodyAsString());\nmethod.releaseConnection();",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-547",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Provide access to port of Host header",
    "systemSpecification": true,
    "version": "3.0 Final"
}