{
    "comments": [
        {
            "author": "Jeff Dever",
            "body": "Should also add a method:\n\nvoid addParameter(NameValuePair parameter)\n",
            "date": "2002-07-08T21:51:36.000+0000",
            "id": 0
        },
        {
            "author": "Jeff Dever",
            "body": "The addParameter methods that are in the PostMethod should actually be moved \nout to the base class GetMethod and mabye even higher into HttpMethodBase.  It \ndoes make sense for a GET to have parameters: they are in the query string as \nopposed to a POST which are url encoded and send in the body.\n\nThe ease in which a form can be submitted in a html page using either GET or \nPOST should be parallel to the GetMethod and PostMethod.\n ",
            "date": "2002-07-08T21:56:46.000+0000",
            "id": 1
        },
        {
            "author": "Jeff Dever",
            "body": "\nOnly POST methods (afaik) take a x-www-form-urlencoded content header,\nwhich seems to be the purpose of the setParameter and such methods.   The\n\"parameters\" would be urlencoded (using URIUtil.encode presumably) and\nstuffed in the content body.   The query string, if any, remains part of\nthe URL.  The query string and the parameters are independant so it does\nmakes sense that there are different methods to handle them, as it is\ncurrently.\n\nIt would just be nice to add a bunch of parameters as a NameValuePair\narray in the same way that you already can with the query string.\n",
            "date": "2002-07-09T09:44:52.000+0000",
            "id": 2
        },
        {
            "author": "Jeff Dever",
            "body": "Created an attachment (id=2294)\nPatch file to add two new methods to PostMethod plus test cases\n",
            "date": "2002-07-10T09:07:07.000+0000",
            "id": 3
        }
    ],
    "component": "HttpClient (classic)",
    "description": "When posting a form a web page may have many parameters to post to the \nwebserver.  Currently in PostMethod, if you wanted to add multiple parameters, \nyou would have to call addParameter(name, value) for each one.\n\nA new convinence method should be added to allow for simpler client code by \ntaking an array of NameValuePair objects and adding all parameters in a single \nfunction call.\n\nvoid addParameters(NameValuePair[] parameters) \n\nAlso, the comments for PostMethod functions that deal with parameters \nstate \"Override method of HttpMethodBase ...\" which is incorrect.  More \ninformative comments should be added to this public API.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-41",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "New method to add an array of parameters to PostMethod",
    "systemSpecification": true,
    "version": ""
}