{
    "comments": [
        {
            "author": "Laura Werner",
            "body": "Created an attachment (id=6311)\nPatch, version 2\n",
            "date": "2003-05-11T04:44:52.000+0000",
            "id": 0
        },
        {
            "author": "Michael Becke",
            "body": "Looks good to me.  Nice work Laura.  Would you object to being added as an author for the various \nclasses?\n\nI will apply this patch tonight unless there are any objections.\n\nMike",
            "date": "2003-05-12T03:31:21.000+0000",
            "id": 1
        },
        {
            "author": "Laura Werner",
            "body": "Thanks.  Go ahead and add me as an author if you want.  I figured it would be\npresumptuous of me to do so after doing so little work.",
            "date": "2003-05-12T09:32:01.000+0000",
            "id": 2
        },
        {
            "author": "Michael Becke",
            "body": "Patch applied.\n\nYour code, regardless of the size, adds a valuable HttpClient feature.  I think you deserve some \ncredit.  You have been added as an author for the modified files.\n\nMike",
            "date": "2003-05-12T09:48:26.000+0000",
            "id": 3
        }
    ],
    "component": "HttpClient (classic)",
    "description": "On clustered or multi-homed systems, there's a need to specify the local bind\naddress of sockets, to ensure that they're created on the right interface.  To\ndo this, the local address needs to be passed to the 4-argument version of\nProtcolSocketFactory.createSocket.\n\nAfter discussion on the mailing list, the best approach for this seems to be\nadding the local address as a property on HostConfiguration and HttpConnection.  \n\nI've attached a patch which does the following:\n- Add public set/getLocalAddress methods to HostConfiguration and HttpConnection.\n- HttpConnection uses the local address when opening connections.\n- Modify HostConfiguration.equals and hostEquals to compare the local address too.\n- SimpleHttpConnectionManager uses the local address from the provided config. \nI also cleaned up its getConnection method a bit.\n- HttpClient.executeMethod uses the local address from its default\nHostConfiguration if the method's config doesn't specify one.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-209",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Add set/getLocalAddress methods to HostConfiguration",
    "systemSpecification": true,
    "version": "2.0 Alpha 3"
}