{
    "comments": [
        {
            "author": "Oleg Kalnichevski",
            "body": "Currently HttpClient offers only VERY limited support for Set-Cookie2 headers.\nIt basically treats them as RFC2109 style cookies. HttpClient has never been\nproperly tested for the RFC2965 compliance. RFC2965 support has been planned for\n3.0 release.\n\nYou are absolutely accurate in pointing out the flaw in the cookie handling\nlogic. We are committed to fixing this bug. The question is when \n\nFolks, any strong opinions regarding as to when this bug must be fixed?\n\nOleg ",
            "date": "2003-04-17T19:53:13.000+0000",
            "id": 0
        },
        {
            "author": "Oleg Kalnichevski",
            "body": "RFC2965 support implemented in the SVN trunk (to be released as HttpClient 3.1)\n\nOleg",
            "date": "2006-05-06T19:55:43.000+0000",
            "id": 1
        }
    ],
    "component": "HttpClient (classic)",
    "description": "Acording to RFC2965 9.1:\n                                                 User agents that\n   receive in the same response both a Set-Cookie and Set-Cookie2\n   response header for the same cookie MUST discard the Set-Cookie\n   information and use only the Set-Cookie2 information.\n\nthis is read that the header for a cetain cookie, but not all cookie.\nSo, Server can send only Set-Cookie header for some cookies and,\nfor cookies send Set-Cookie2,Set-cookie both.\n\nBut httpclient implementation handles this that if find any set-cookie2 header,\nthen ignores all Set-cookie header.\nI know some sites use set-cookie2 only for cookies which needs\n more flexible exiration handling, and for other cookies use only\nSet-Cookie. One of exmaples of such sites I know is \nTDNet Database service provided by Tokyo Stock Exchange.\n\nSo, the preferred implementation is that if set-cookie2 header\n found for a certain cookie then cookie value is set from set-cookie2 header, if\nnot, then from Set-Cookie header.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "HTTPCLIENT-189",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "HTTPCLIENT",
    "project": "HTTPCLIENT",
    "summary": "Set-Cookie2 and Set-Cookie",
    "systemSpecification": true,
    "version": "2.0 Alpha 3"
}