{
    "comments": [
        {
            "author": "Christian Moen",
            "body": "Find attached a patch for {{trunk}} that improves the heuristic.  Search segmentation tests/examples are in {{search-segmentation-tests.txt}} and is validated by {{TestSearchMode}}.\n\nNote that both the tests and the heuristic is tuned for IPADIC.  Hence, we need to revisit this when we add support for other dictionaries/models.\n\nI've also moved the ASF license header in {{TestExtendedMode.java}} to the right place.\n",
            "date": "2012-01-30T04:03:52.906+0000",
            "id": 0
        },
        {
            "author": "Christian Moen",
            "body": "If you want to try the new search mode, there's a simple Kuromoji web interface available on http://atilika.org/kuromoji that perhaps is useful.  After inputing some text and pressing enter, click \"normal mode\" to switch to \"search mode\" to test the various segmentation modes for the given input.",
            "date": "2012-01-30T04:15:33.570+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "Patch looks good to me... so the basics are we apply a different penalty based on\nwhether the text is kanji or not, rather than just a single penalty of 10000 (and some parameter tuning) ?\n\n{quote}\nNote that both the tests and the heuristic is tuned for IPADIC. Hence, we need to revisit this when we add support for other dictionaries/models.\n{quote}\n\nI think this is ok for now. \nLong term (if there end out being different values for other dictionaries), we can conditionalize these on dictionary type:\neither at build-time (recording these values into dictionary), or better, record the dictionary type itself and conditionalize\nthese at run-time based on dictionary type.\n\nBy recording the type, we would also be able to use e.g. assumeTrue(dictionaryType == IPADIC) in unit tests and things like that,\nand who knows what else, but lets not worry about it here.\n",
            "date": "2012-01-30T12:13:46.239+0000",
            "id": 2
        },
        {
            "author": "Christian Moen",
            "body": "{quote}\nPatch looks good to me... so the basics are we apply a different penalty based on\nwhether the text is kanji or not, rather than just a single penalty of 10000 (and some parameter tuning) ?\n{quote}\n\nThanks a lot, Robert.  That's correct.\n\nI agree completely regarding other dictionary support.",
            "date": "2012-02-01T10:12:14.599+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "Thanks Christian!\n",
            "date": "2012-02-01T11:07:52.577+0000",
            "id": 4
        }
    ],
    "component": "modules/analysis",
    "description": "Kuromoji has a segmentation mode for search that uses a heuristic to promote additional segmentation of long candidate tokens to get a decompounding effect.  This heuristic has been improved.  Patch is coming up.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3730",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Improved Kuromoji search mode segmentation/decompounding",
    "systemSpecification": true,
    "version": "3.6, 4.0-ALPHA"
}