{
    "comments": [
        {
            "author": "Cédrik LIME",
            "body": "new TRStringDistance implementation, as patch and as complete source file.",
            "date": "2008-02-21T11:22:17.920+0000",
            "id": 0
        },
        {
            "author": "Grant Ingersoll",
            "body": "It occurs to me that we apparently have two different implementations of Levenshtein, one in spellchecker and one for FuzzyQuery.  I haven't analyzed them individually to know for sure, but if this is a much better implementation, then we should think about using it for FuzzyQuery, too.  \n\nThe FuzzyQuery (FuzzyTermEnum) version claims to have a fast-fail mechanism, too:\n{quote}\n<p>Embedded within this algorithm is a fail-fast Levenshtein distance\n   * algorithm.  The fail-fast algorithm differs from the standard Levenshtein\n   * distance algorithm in that it is aborted if it is discovered that the\n   * mimimum distance between the words is greater than some threshold.\n   *\n   * <p>\n{quote}\n\nCedrik, since you seem to know about these things, would you have time to look at FuzzyTermEnum?  A 3x speedup there would be great for users, too.",
            "date": "2008-02-21T13:38:21.453+0000",
            "id": 1
        },
        {
            "author": "Cédrik LIME",
            "body": "You caught me while I was finalizing a patch for FuzzyTermEnum... :-) I'll add it to this bug report in the next few minutes.",
            "date": "2008-02-21T13:57:40.764+0000",
            "id": 2
        },
        {
            "author": "Cédrik LIME",
            "body": "Patch for FuzzyTermEnum.",
            "date": "2008-02-21T13:59:40.721+0000",
            "id": 3
        },
        {
            "author": "Karl Wettin",
            "body": "Also see LUCENE-691 if you are looking at optimizing FuzzyTermEnum.\n\n",
            "date": "2008-02-21T14:40:08.759+0000",
            "id": 4
        },
        {
            "author": "Cédrik LIME",
            "body": "Well spotted Karl! My version is very similar to LUCENE-691, except I kept some smallish optimisations out the the sake of readability. I'll incorporate some of his changes/ideas and publish a new patch.\nCan someone link those 2 issues together in the meantime? (There are too many options in the drop-down; don't know which one to choose.)",
            "date": "2008-02-21T15:05:41.966+0000",
            "id": 5
        },
        {
            "author": "Cédrik LIME",
            "body": "New patch for FuzzyTermEnum, incorporating most of LUCENE-691.",
            "date": "2008-02-21T15:27:22.766+0000",
            "id": 6
        },
        {
            "author": "Karl Wettin",
            "body": "on request by issue reporter",
            "date": "2008-02-21T15:39:58.413+0000",
            "id": 7
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Committed the TRStringDistance patch -- thank you!\n\nCommitted revision 659016.\n\n\nI'll leave the FuzzyTermEnum patch for a later date.  Is there anything in Bob's FuzzyTermEnum that is not in this patch?  Anything that you'd want to add, Cédrik?\n",
            "date": "2008-05-22T06:29:40.841+0000",
            "id": 8
        },
        {
            "author": "Cédrik LIME",
            "body": "All of Bob's FuzzyTermEnum patch is in my patch. I only left some smallish optimizations that didn't bring much but did hurt code readability. In other words, should you commit my patch, you will have most of (99.9%) LUCENE-691.\nI think this is an important patch for Lucene 2.4, as it brings vast performance improvements in fuzzy search (no hard numbers, sorry).",
            "date": "2008-05-26T09:39:59.034+0000",
            "id": 9
        },
        {
            "author": "Cédrik LIME",
            "body": "Any news on the landing of this patch?\nNow that Lucene 2.9 is out, the vastly better memory usage and speed-up would be a welcome addition to Lucene 3.0's fuzzy search!",
            "date": "2009-10-20T13:17:33.241+0000",
            "id": 10
        },
        {
            "author": "Michael McCandless",
            "body": "Cédrik, could you update the patch to trunk?  It sounds like a compelling improvement.  We should get it in.",
            "date": "2009-10-20T14:56:21.103+0000",
            "id": 11
        },
        {
            "author": "Cédrik LIME",
            "body": "Thanks Michael.\nFuzzyTermEnum.java has not changed for more than 2 years. The uploaded patch (FuzzyTermEnum.patch) is still valid for trunk.",
            "date": "2009-10-20T20:21:13.671+0000",
            "id": 12
        },
        {
            "author": "Michael McCandless",
            "body": "OK I had 2 hunks fail but I managed to apply them.",
            "date": "2009-10-20T20:50:24.577+0000",
            "id": 13
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Cédrik!",
            "date": "2009-10-20T21:23:06.065+0000",
            "id": 14
        },
        {
            "author": "Robert Muir",
            "body": "these improvements only made it into fuzzyTERMenum but somehow didnt make it into fuzzyTERMSenum on flex branch, and aren't in trunk!",
            "date": "2010-08-07T13:34:42.414+0000",
            "id": 15
        },
        {
            "author": "Robert Muir",
            "body": "here is the patch for FuzzyTermsEnum in trunk",
            "date": "2010-08-07T14:21:20.328+0000",
            "id": 16
        },
        {
            "author": "Robert Muir",
            "body": "while I'm here, here is a little patch for 3x_branch to eliminate some useless charAt bounds checks.\n",
            "date": "2010-08-07T14:34:24.531+0000",
            "id": 17
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 983298 (trunk) and small optimizations 983299 (3x)",
            "date": "2010-08-07T19:50:34.085+0000",
            "id": 18
        }
    ],
    "component": "modules/other",
    "description": "The implementation of TRStringDistance is based on version 2.1 of org.apache.commons.lang.StringUtils#getLevenshteinDistance(String, String), which uses an un-optimized implementation of the Levenshtein Distance algorithm (it uses way too much memory). Please see Bug 38911 (http://issues.apache.org/bugzilla/show_bug.cgi?id=38911) for more information.\n\nThe commons-lang implementation has been heavily optimized as of version 2.2 (3x speed-up). I have reported the new implementation to TRStringDistance.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1183",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "TRStringDistance uses way too much memory (with patch)",
    "systemSpecification": true,
    "version": "1.9, 2.0.0, 2.1, 2.2, 2.3"
}