{
    "comments": [
        {
            "author": "Earwin Burrfoot",
            "body": "Lets reuse IW.deleteUnusedFiles() ?\nNo need to multiply confusion )",
            "date": "2010-04-19T09:14:15.313+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Lets reuse IW.deleteUnusedFiles() ?\n\n+1",
            "date": "2010-04-20T01:07:14.073+0000",
            "id": 1
        },
        {
            "author": "Shai Erera",
            "body": "Patch changes deleteUnusedFiles to call IFD.checkpoint and also adds a testDeleteUnusedFiles2 to TestIndexWriter.\n\nCurrently, TestIndexWriterReader.testDuringAddIndexes fails, if deleteUnusedFiles is coded like this:\n{code}\npublic synchronized void deleteUnusedFiles() throws IOException {\n  deleter.checkpoint(segmentInfos, true);\n}\n{code}\n\nThe failure happens in CommitPoint's ctor in the assert statement which verifies the SegmentInos does not have external Directory. When I debug-traced the test, it passed and so I concluded it's a concurrency issue (and indeed testDuringAddIndexes spawns several threads.\n\naddIndexesNoOptimize does change SegmentInfos as it adds indexes, however at the end it 'fixes' their Directory reference. I wondered how is regular commit() works when addIndexesNoOptimize is called, but couldn't find any synchronization block where one blocks the other. Eventually, I've changed deleteUnusedFiles to this:\n{code}\npublic synchronized void deleteUnusedFiles() throws IOException {\n  synchronized (commitLock) {\n    deleter.checkpoint(rollbackSegmentInfos, true);\n    // deleter.checkpoint((SegmentInfos) segmentInfos.clone(), true);\n  }\n}\n{code}\n\nI've tried to sync on commitLock (which seems good anyway), but the test kept failing. Even cloning SI did not work because it might have changed just before the clone. Only when passing rollbackSI to checkpoint does the test pass. But I'm not sure if that's the right solution, as when I debug-traced it and put a break point just before the call to checkpoint, SI included one segment w/ a different name than rollbackSI ...\n\nBTW, the test fails on DirReader.doClose, where it checks if writer != null and then calls deleteUnusedFiles. So I guess it's a NRT problem only.\n\nIn general, that that addIndexesNoOptimize messes w/ SI seems dangerous to me, because that's undocumented and unprotected - e.g. if someone extends IW and adds some logic which requires reading SI ... I'm not sure how to solve it, but that seems unrelated to that issue (probably much more complicated to solve).",
            "date": "2010-04-21T06:06:56.297+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "bq. The failure happens in CommitPoint's ctor in the assert statement which verifies the SegmentInos does not have external Directory.\n\nUrgh.... indeed we must protect against one thread doing addIndexes\nand another thread calling deleteUnusedFiles.\n\nThe way things work today (and I agree we should fix this) is\naddIndexes* immediately modify the in memory segments to include\nforeign (external Dir) segments, then proceed to target these foreign\nsegments by merging them away.\n\nbq. I've tried to sync on commitLock (which seems good anyway), but the test kept failing.\n\nThis isn't strictly necessary, I think?  The two ops (ongoing commit\n-- takes time since fync can be so slow -- and deleting unused files)\nare orthogonal.  They both invoke IDP/IFD, but this is still protected\n(sync'd on IW)...\n\nbq. Only when passing rollbackSI to checkpoint does the test pass.\n\nIn fact this is the right track, I think...  rollbackSI is a clone of\nthe last committed segments, whereas the \"live\" segments contains all\nuncommitted stuff that's happened since.  We really should not be\ntreating these pending changes as if they were a commit point... so\nusing rollbackSI makes sense.\n\nBut, the problem is, IFD.checkpoint will hold a new commit point when\nyou pass isCommit=true, which is no good.  I think we need to open up\na new package private method in IFD, eg \"revisitPolicy\" or some such, which\njust does:\n{code}\nif (infoStream != null) {\n  message(\"now visit...\");\n}\ndeletePendingFiles();\npolicy.onCommit(commits);\ndeleteCommits();\n{code}\n\nIe, most of what IFD.checkpoint does when isCommit=true, minus the\nincRef (which has already been done, in the past, for this segments)\nand the commits.add of a new commit point.\n\nInvoking IDP.onCommit still isn't quite right (no new commit was done)\nbut I think it's OK for now?  (Adding some kind of \"visit\" method\nfeels like overkill...).\n\nbq. BTW, the test fails on DirReader.doClose, where it checks if writer != null and then calls deleteUnusedFiles. So I guess it's a NRT problem only.\n\nHmm the problem should be wider than just NRT.  Any time one thread\ncalls deleteUnusedFiles while another is doing addIndexes*, this bug\nshould be hit-able.\n\nbq. In general, that that addIndexesNoOptimize messes w/ SI seems dangerous to me, because that's undocumented and unprotected\n\nI agree.\n\nI'd love to [eventually] change addIndexes*, so that it does all its\nwork \"privately\" and only in the end atomically \"checks in\" the\n(not-foreign) segments it produced.  It gets tricky, though, since\n\"normal\" segment merging, and flushing, is still ongoing, and we'd not\nwant to do redundant merging work.\n\nThis also messes up NRT, ie, if you open an NRT reader during an\naddIndexes*, you can see some segments already added and some now --\nie NRT violates the advertised atomicity of addIndexes* (the javadocs\nnote this).\n\nI think we really need to factor IW apart:\n\n  # Indexer (add/update/delete), also flushes new segments\n\n  # Keeper of the segments file (exposes API to make atomic changes to\n    segments file, does commits, interacts w/ IDP/IFD)\n\n  # Merger (normal merging, optimize, expungeDeletes, addIndexes)\n\n  # Reader pool\n",
            "date": "2010-04-21T14:28:05.921+0000",
            "id": 3
        },
        {
            "author": "Shai Erera",
            "body": "bq. I think we need to open up a new package private method in IFD, eg \"revisitPolicy\" or some such\n\nSo maybe reuse deletePendingFiles? I.e. this method does not accept anything, and so seems that revisitPolicy won't (just pass on to IDP its 'commits' member). IFD is anyway an internal API ... I'll give it a try. deletePendingFiles would just do what it does, then in the end call policy.onCommit(commits) and deleteCommits() ... what do you think? And then IW does not need to change.",
            "date": "2010-04-21T14:44:08.095+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "bq. So maybe reuse deletePendingFiles?\n\nHmm I think this is too much?  EG we call that on every checkpoint call... so this'd mean the IDP gets 2 onCommit calls per commit (one \"fake\" one and one \"real\")?\n\nI think it's better if the \"fake\" onCommit only arrives when IW.deleteUnusedFiles is invoked?",
            "date": "2010-04-21T14:53:43.045+0000",
            "id": 5
        },
        {
            "author": "Shai Erera",
            "body": "Ok I understand. About the name, revisitPolicy is not exactly accurate (I think?) because it also deletes the pending files (and not just revisit the policy). Unless IW.deleteUnusedFiles will invoke both deletePendingFiles and revisitPolicy ... the latter will just do\n{code}\nif (commits.size() > 0) {\n  policy.onCommit(commits);\n  deleteCommits();\n}\n{code}\n\nWhat do you think?",
            "date": "2010-04-21T15:14:14.227+0000",
            "id": 6
        },
        {
            "author": "Michael McCandless",
            "body": "+1, I think that's a good approach.",
            "date": "2010-04-21T15:21:16.738+0000",
            "id": 7
        },
        {
            "author": "Shai Erera",
            "body": "Adds revisitPolicy to IFD (package-private) and also calls it from IW.deleteUnusedFiles. All tests pass",
            "date": "2010-04-21T15:41:24.423+0000",
            "id": 8
        },
        {
            "author": "Michael McCandless",
            "body": "Patch looks good Shai!\n\nBut you can remove the \" ...\" in the message output -- I had put into my code thinking there may be details we put instead of that \"...\", but, I think there are no further details.",
            "date": "2010-04-21T15:55:05.674+0000",
            "id": 9
        },
        {
            "author": "Shai Erera",
            "body": "ok I'll remove them before commit. Will commit this later - giving chance for more people to review.",
            "date": "2010-04-21T16:20:48.969+0000",
            "id": 10
        },
        {
            "author": "Shai Erera",
            "body": "Committed revision 936605.",
            "date": "2010-04-22T03:46:00.540+0000",
            "id": 11
        },
        {
            "author": "Shai Erera",
            "body": "Backport to 3.1",
            "date": "2010-05-05T17:34:41.965+0000",
            "id": 12
        },
        {
            "author": "Shai Erera",
            "body": "Committed revision 941417.",
            "date": "2010-05-05T18:35:02.193+0000",
            "id": 13
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:50:12.709+0000",
            "id": 14
        }
    ],
    "component": "core/index",
    "description": "Today, if one uses an IDP which holds onto segments, such as SnapshotDeletionPolicy, or any other IDP in the tests, those segments are left in the index even if the IDP no longer references them, until IW.commit() is called (and actually does something). I'd like to add a specific method to IW which will invoke the IDP's logic and get rid of the unused segments w/o forcing the user to call IW.commit(). There are a couple of reasons for that:\n\n* Segments take up sometimes valuable HD space, and the application may wish to reclaim that space immediately. In some scenarios, the index is updated once in several hours (or even days), and waiting until then may not be acceptable.\n* I think it's a cleaner solution than waiting for the next commit() to happen. One can still wait for it if one wants, but otherwise it will give you the ability to immediately get rid of those segments.\n* TestSnapshotDeletionPolicy includes this code, which only strengthens (IMO) the need for such method:\n{code}\n// Add one more document to force writer to commit a\n// final segment, so deletion policy has a chance to\n// delete again:\nDocument doc = new Document();\ndoc.add(new Field(\"content\", \"aaa\", Field.Store.YES, Field.Index.ANALYZED, Field.TermVector.WITH_POSITIONS_OFFSETS));\nwriter.addDocument(doc);\n{code}\n\nIf IW had an explicit method, that code would not need to exist there at all ...\n\nHere comes the fun part - naming the baby:\n* invokeDeletionPolicy -- describes exactly what is going to happen. However, if the user did not set IDP at all (relying on default, which I think many do), users won't understand what is it.\n* deleteUnusedSegments - more user-friendly, assuming users understand what 'segments' are.\n\nBTW, IW already has deleteUnusedFiles() which only tries to delete unreferenced files that failed to delete before (such as on Windows, due to e.g. open readers). Perhaps instead of inventing a new name, we can change IW.deleteUnusedFiles to call IndexFileDeleter.checkpoint (instead of deletePendingFiles) which deletes those files + calls IDP.onCommit().",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2402",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Add an explicit method to invoke IndexDeletionPolicy",
    "systemSpecification": true,
    "version": ""
}