{
    "comments": [
        {
            "author": "Ning Li",
            "body": "Just got around to do the patch:\n  - The patch includes changes to IndexWriter and DocumentsWriter to provide the flexibility to turn on/off any flush triggers.\n  - Necessary changes to a couple of unit tests.\n  - Also remove some unused imports.\n  - All unit tests pass.\n\nOne question: Should we count buffered delete terms towards ram buffer used? Feel like we should. On the other hand, numBytesUsed only counts ram space which can be recycled.",
            "date": "2007-09-27T21:04:13.437+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Ning!  I will have a look at the patch.\n\n> One question: Should we count buffered delete terms towards ram\n> buffer used? Feel like we should. On the other hand, numBytesUsed\n> only counts ram space which can be recycled.\n\nI think we should still count this ram usage with numBytesUsed?  Even\nthough it's not directly recycled, this memory usage does still \"last\"\nfor a very long time (ie longer than a single document's processing,\nuntil flush happens), so I think it should be counted.\n",
            "date": "2007-09-27T22:00:07.996+0000",
            "id": 1
        },
        {
            "author": "Ning Li",
            "body": "Take2 counts buffered delete terms towards ram buffer used. A test case for it is added.",
            "date": "2007-09-28T02:41:38.242+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "This patch looks good, thanks Ning!  I made a few small changes,\nincluding how RAM usage of buffered delete term is calculated.\nAttached take3.\n\nI plan to commit in a day or two.",
            "date": "2007-09-30T11:31:02.724+0000",
            "id": 3
        },
        {
            "author": "Ning Li",
            "body": "One more thing about the approximation of actual bytes used for buffered delete term: just remember Integer.SIZE returns the number of bits used, should convert it to number of bytes.",
            "date": "2007-10-01T14:04:17.191+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "Whoa, good catch!  OK I'll divide by 8.",
            "date": "2007-10-01T14:24:38.877+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "I just committed this.  Thanks Ning and Doron!",
            "date": "2007-10-02T19:23:14.877+0000",
            "id": 6
        }
    ],
    "component": "core/index",
    "description": "See discussion at http://www.gossamer-threads.com/lists/lucene/java-dev/53186\n\nProvide the flexibility to turn on/off any flush triggers - ramBufferSize, maxBufferedDocs and maxBufferedDeleteTerms. One of ramBufferSize and maxBufferedDocs must be enabled.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1007",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Flexibility to turn on/off any flush triggers",
    "systemSpecification": true,
    "version": ""
}