{
    "comments": [
        {
            "author": "Marvin Humphrey",
            "body": "+1\n\nThis approach addresses all of my concerns about \naction-at-a-distance behaviors.\n\nNice work, Mike.",
            "date": "2009-06-11T14:55:37.542+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Marvin; I think the approach works very well.  I plan to commit in a day or two...",
            "date": "2009-06-13T09:50:20.833+0000",
            "id": 1
        }
    ],
    "component": "modules/analysis",
    "description": "I think we should add a matchVersion arg to StandardAnalyzer.  This\nallows us to fix bugs (for new users) while keeping precise back\ncompat (for users who upgrade).\n\nWe've discussed this on java-dev, but I'd like to now make it concrete\n(patch attached).  I think it actually works very well, and is a\nsimple tool to help us carry out our back-compat policy.\n\nI coded up an example with StandardAnalyzer:\n\n  * The ctor now takes a required arg (Version matchVersion).  You\n    pass Version.LUCENE_CURRENT to always get lates & greatest, or eg\n    Version.LUCENE_24 to match 2.4's bugs/settings/behavior.\n\n  * StandardAalyzer conditionalizes the \"replace invalid acronym\" and\n    \"enable position increment in StopFilter\" based on matchVersion.\n\n  * It also prevents creating zillions of ctors, over time, as we need\n    to change settings in the class.  EG StandardAnalyzer now has 2\n    settings that are version dependent, and there's at least another\n    2 issues open on fixing some more of its bugs.\n\nThe migration is also very clean: we'd only add this to classes on an\n\"as needed\" basis.  On the first release that adds the arg, the\ndefault remains back compatible with the prior release.  Then, going\nforward, we are free to fix issues on that class and conditionalize by\nmatchVersion.\n\nThe javadoc at the top of StandardAnalyzer clearly calls out what\nversion specific behavior is done:\n\n{code}\n * <p>You must specify the required {@link Version}\n * compatibility when creating StandardAnalyzer:\n * <ul>\n *   <li> As of 2.9, StopFilter preserves position\n *        increments by default\n *   <li> As of 2.9, Tokens incorrectly idenfied as acronyms\n *        are corrected (see <a href=\"https://issues.apache.org/jira/browse/LUCENE-1068\">LUCENE-1608</a>\n * </ul>\n *\n{code}\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1684",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Add matchVersion to StandardAnalyzer",
    "systemSpecification": true,
    "version": ""
}