{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "I will start merging IndexSearcher and FilteredQuery changes to 3.x soon.",
            "date": "2011-10-25T12:44:33.115+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "My problem is that this backport is almost impossible: Searchable and Searcher abstract class prevent this from being done.\n\nWe have several choices:\n- we can heavily break backwards and maybe nuke Searcher and Searchable earlier\n- we keep API intact, only call FilteredQuery.weight() from inside IndexSaercher instead of duplicating code\n- close issue as won't fix\n\nAny comments?",
            "date": "2011-10-25T15:00:23.618+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "i dont think we should heavy-break in a minor release, especially since we cannot use random access Bits.\n",
            "date": "2011-10-25T15:06:10.700+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "I tend to the second solution, as the whole issue was about removing the code duplication between IS and FQ (which also have different implementations of the same code).",
            "date": "2011-10-25T15:08:23.537+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "for the second solution, we get some benefits of cleanup, without breaks right? Sounds good to me.",
            "date": "2011-10-25T15:24:22.151+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "Here the easy implementation, that simply removes code duplication and uses the same scorer for both implementations (IS and FQ).\n\nThis patch uses a hack, to provide access to the wrapped scorer from inside IndexSearcher.\n\nThis is all with no public API change at all.",
            "date": "2011-10-25T15:58:53.824+0000",
            "id": 5
        },
        {
            "author": "Uwe Schindler",
            "body": "Small optimization, as in 3.x we dont need to move the filter to first doc, so the scorer has one less if-check.\n\nAlso the previous patch was missing the deprecated similarity pass-through to Scorer.\n\nI think thats ready to commit, any comments?",
            "date": "2011-10-25T16:47:08.621+0000",
            "id": 6
        },
        {
            "author": "Robert Muir",
            "body": "+1, i prefer the hackedy-häck-hack over duplicated code :)",
            "date": "2011-10-25T16:51:20.721+0000",
            "id": 7
        },
        {
            "author": "Uwe Schindler",
            "body": "hey, there was an umlaut!",
            "date": "2011-10-25T16:53:07.389+0000",
            "id": 8
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. Robert Muir added a comment - 25/Oct/11 16:51 - *edited*\n\nMuch better! I will commit soon and move forward to nuking SpanFilters :-)",
            "date": "2011-10-25T17:05:42.758+0000",
            "id": 9
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed 3.x revision: 1188805",
            "date": "2011-10-25T17:15:01.581+0000",
            "id": 10
        },
        {
            "author": "Uwe Schindler",
            "body": "Bulk close after release of 3.5",
            "date": "2011-11-27T12:29:34.057+0000",
            "id": 11
        }
    ],
    "component": "",
    "description": "Spinoff from LUCENE-1536: We simplified the code in IndexSearcher to no longer do the filtering there, instead wrap all Query with FilteredQuery, if a non-null filter is given. The conjunction code would then only exist in FilteredQuery which makes it easier to maintain. Currently both implementations differ in 3.x, in trunk we used the more optimized IndexSearcher variant with addition of a simplified in-order conjunction code.\n\nThis issue will backport those changes (without random access bits).",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3534",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Backport FilteredQuery/IndexSearcher changes to 3.x: Remove filter logic from IndexSearcher and delegate to FilteredQuery",
    "systemSpecification": true,
    "version": ""
}