{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Patch.\n\nI renamed static DR.getCurrentVersion -> DR.getLastCommitVersion,\nstatic DR.getCommitUserData -> DR.getLastCommitUserData, removed\nDR.getCommitUserData (it's redundant w/\nDR.getIndexCommit().getUserData()), and cleaned up the javadocs.\n",
            "date": "2012-02-08T16:47:21.025+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "Thanks, nice cleanup :)\n\n+1 no complaints from the DR refactorer :-)",
            "date": "2012-02-08T18:31:43.948+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "Just curiosity: what are the high-level use-cases for these static methods?\n\nAlso: \n* (as mentioned on the list), I like the improvements to the javadocs,\n  but shouldn't we do the same for getLastCommitUserData(Directory)? (if we keep it)\n* Should we fix the getCurrentXXX methods in SegmentInfos.java for consistency?\n\n",
            "date": "2012-02-08T19:12:37.065+0000",
            "id": 2
        },
        {
            "author": "Ryan McKinley",
            "body": "thanks mike -- much more clear\n",
            "date": "2012-02-08T19:31:10.436+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "bq. what are the high-level use-cases for these static methods?\n\nWell, they let you get the version and commit userData w/o having to open the full index... it's a nice \"freedom\" (much lower cost than opening a reader), but how applications actually make use of that freedom specifically, I'm not sure?\n\n{quote}\n(as mentioned on the list), I like the improvements to the javadocs,\n but shouldn't we do the same for getLastCommitUserData(Directory)? (if we keep it)\n{quote}\n\nWoops, I'll fix...\n\nbq. Should we fix the getCurrentXXX methods in SegmentInfos.java for consistency?\n\nAhh right I will...",
            "date": "2012-02-08T22:51:47.020+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "{quote}\nWell, they let you get the version and commit userData w/o having to open the full index... it's a nice \"freedom\" (much lower cost than opening a reader), but how applications actually make use of that freedom specifically, I'm not sure?\n{quote}\n\nIf we don't know of or cannot imagine any real use cases, then I propose we make them deprecated and package private.\n\nIf someone has a real use case: then they can still do it (we didnt hurt them). If no one speaks up for a whole release cycle, they are gone.",
            "date": "2012-02-08T23:00:30.037+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "Patch, folding on Robert's suggestions...",
            "date": "2012-02-08T23:31:46.666+0000",
            "id": 6
        },
        {
            "author": "Eks Dev",
            "body": "I have a use case for CommitUserData and I think standard solr DIH could benefit from it as well. \nI use it to persist current status of the max Document id (user id, not lucene docid) to know what I have indexed so far (all update commands are stored in the database and have simple incrementing counter). This makes incremental update process \"restart- and rollback- safe\" as it gets written on lucene commit and read on startup. I do not index this field (not to pollute term dictionary) and I need only to keep max value of it. \n\nI find it hugely useful, but if you have better ideas on how to safely persist max/min value of the field I am all ears. \n\nLast time I checked, solr DIH used its own file in cfg directory to persist max(timestamp), which is kind of risky as it is not in sync with lucene commit point under all scenarios. \n\nI think I even opened an isue on solr jira to expose \"user commit data\"  feature to solr, but I am missing good ideas on how to expose it to solr users (max/min/avg field tracking maybe)...\n\nCheers, eks",
            "date": "2012-02-09T16:47:27.909+0000",
            "id": 7
        },
        {
            "author": "Michael McCandless",
            "body": "Eks, do you mean you use the IR/DR static methods to look at the last commit's userData?\n\nOr that you use commit userData from an already opened IndexReader...?",
            "date": "2012-02-09T17:59:50.884+0000",
            "id": 8
        },
        {
            "author": "Eks Dev",
            "body": "whoops, before putting mouth to action, one should use brain... just quickly skimmed over this issue and stumbled on \" ...If no one speaks up for a whole release cycle, they are gone...\" out of context, so I concluded user data is gone.\n\nOf course, they do not have to be static, I read it only on restart so even if I do not need open IR, it is not an issue to open it once... \nsorry for the noise",
            "date": "2012-02-09T20:00:16.589+0000",
            "id": 9
        },
        {
            "author": "Uwe Schindler",
            "body": "+1 to commit",
            "date": "2012-02-10T18:51:45.051+0000",
            "id": 10
        },
        {
            "author": "Shai Erera",
            "body": "Sorry guys for not following the issue more closely. We use IndexReader.getCommitUserData in many places across our code.\n\nOne place is when we addIndexes(Directory). We have a need to merge the input Directory's commit data with the target index's commit data. Since we use the optimized writer.addIndexes method, it is a waste to open an IndexReader to retrieve the commit data.\n\nAnother place is where we just need to read the commit data to extract information, without actually needing an IndexReader instance.\n\nIn short, this method is very useful to us, and I don't see the advantage of making it deprecated. I don't mind if we move it to a DirectoryUtil class if it bothers anyone that it's on IndexReader.\n\nWe don't use IndexReader.getVersion so I don't mind if it becomes deprecated, but I wonder, if there's no real advantage, what's the harm of keeping it?",
            "date": "2012-02-15T08:44:29.084+0000",
            "id": 11
        },
        {
            "author": "Uwe Schindler",
            "body": "You don't need to open IR:\n- use the static IR.listCommits(Directory dir)\n- take the last IndexCommit in the list (the newest one)\n- call getCommitUserData()\n",
            "date": "2012-02-15T08:56:31.288+0000",
            "id": 12
        },
        {
            "author": "Uwe Schindler",
            "body": "By the way: Why is the return value of listCommits() Collection<IndexCommit> and not List<IndexCommit>. There is only one implementation, that already uses a List, so for things like getting newest Commit quickly, it might be better to have a List or SortedSet.\n\nChange is easy (maybe in separate issue). In 4.0 we should change this (3.x is also possible because of backwards using return type overloading).",
            "date": "2012-02-15T09:03:24.687+0000",
            "id": 13
        },
        {
            "author": "Shai Erera",
            "body": "The method that you proposes is not very efficient -- why do I need to list all commits just to retrieve the latest's commitData?\n\nbq. By the way: Why is the return value of listCommits() Collection<IndexCommit> and not List<IndexCommit>\n\nIt is like that for API back-compat. The return value of a method is part of its signature. I don't remember on which issue, but I wanted to do that once, and discovered that it breaks either the backwards tests, or current running code (with the new .jar). That's why the method documents that in practice it returns a sorted List.",
            "date": "2012-02-15T09:23:14.813+0000",
            "id": 14
        },
        {
            "author": "Uwe Schindler",
            "body": "But we can change that in 4.0?",
            "date": "2012-02-15T09:37:08.516+0000",
            "id": 15
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. The method that you proposes is not very efficient – why do I need to list all commits just to retrieve the latest's commitData?\n\nIf you only have 1 commit it does not matter.",
            "date": "2012-02-15T09:37:33.823+0000",
            "id": 16
        },
        {
            "author": "Shai Erera",
            "body": "bq. But we can change that in 4.0?\n\nYes, in 4.0, DirReader.listCommits returns List<>.\n\nbq. If you only have 1 commit it does not matter.\n\nYes, that's right. But I cannot guarantee that (because we sometimes maintain few index commits). What's wrong with just undeprecating the method? It's not like it was deprecated for technical reasons. As said above, nobody thought of a useful scenario to use it, so it was deprecated. But I have a useful scenario.\n\nDo you agree that I simply undeprecate them?",
            "date": "2012-02-15T09:48:15.438+0000",
            "id": 17
        },
        {
            "author": "Robert Muir",
            "body": "I don't think we should: I don't understand the use case behind these static methods.\n\nIs it really faster? Do you have any benchmarks showing the gain?\n",
            "date": "2012-02-15T09:55:59.188+0000",
            "id": 18
        },
        {
            "author": "Shai Erera",
            "body": "You mean if IndexReader.getCommitUserData() is faster than IndexReader.open().getIndexCommit().getUserData()? Do I really need to benchmark this !?\n\nThe static method just reads the SegmentInfos and returns the commitData. Opening an IndexReader at least opens its all sub-segments, loads norms, deleted docs and what not.\n\nLook, it's not like I'm trying to add a new API. It existed for a long time, and it happens to be that I'm using it (and maybe others who didn't speak up). So why deprecate it?\n\nI'm also using it in the SearcherTaxoManager (not yet uploaded to LUCENE-3786) to inspect the commit data on the taxonomy directory before I create a new DirTaxoReader, which is very expensive. So why nuke it?",
            "date": "2012-02-15T10:16:30.754+0000",
            "id": 19
        },
        {
            "author": "Robert Muir",
            "body": "{quote}\nYou mean if IndexReader.getCommitUserData() is faster than IndexReader.open().getIndexCommit().getUserData()? Do I really need to benchmark this !?\n{quote}\n\nNope, but thats not really the question. I mean in the full picture of the application, is there another way?\n\n{quote}\nThe static method just reads the SegmentInfos and returns the commitData. Opening an IndexReader at least opens its all sub-segments, loads norms, deleted docs and what not.\n{quote}\n\nwait, i dont think thats totally true. Opening the static method may or may not also read in fieldinfos (as they are tied to segmentinfos in trunk currently). Opening an indexreader doesnt load norms until you ask for them, for example.\n\n{quote}\nLook, it's not like I'm trying to add a new API. It existed for a long time, and it happens to be that I'm using it (and maybe others who didn't speak up). So why deprecate it?\n{quote}\n\nWell I thought the API was confusing, especially the overloaded names, but when looking into it, I started to question why it needs to exist.\n\nI think this is ok: we can't keep adding and adding, I think its good to try to hide some of this stuff.\n\nEspecially in Lucene's trunk: lots of things in o.a.l.index (SegmentInfos, public ctors to SegmentReader, etc) don't really need to be public anymore IMO, \nsome of this was expert workarounds for the fact we didn't have an extensible codecs package. We shouldn't try to support 2 \"apis\" from this perspective,\naccessing parts of the index through expert methods and at the same time having a codec api.\n\n{quote}\nI'm also using it in the SearcherTaxoManager (not yet uploaded to LUCENE-3786) to inspect the commit data on the taxonomy directory before I create a new DirTaxoReader, which is very expensive. So why nuke it?\n{quote}\n\nWell its still available in 3.x as deprecated methods... were you planning on making a patch against 3.x for LUCENE-3786 initially?\n\nhere's an idea: how about we defer this discussion until we see your patch? If it makes sense for LUCENE-3786, then we have a valid use case?\n",
            "date": "2012-02-15T11:28:50.445+0000",
            "id": 20
        },
        {
            "author": "Shai Erera",
            "body": "bq. I mean in the full picture of the application, is there another way?\n\nOne of my use cases is a distributed system which receives 'delta' indexes that need to be merged with a bigger one. There, I open FSDirectory and use IndexWriter.addIndexes(dir). I don't need to load the IndexReader. What I do need though is read some time stamps and other metadata that I put in the index's commit data and merge that with the target index's commit data.\n\nbq. Opening an indexreader doesnt load norms until you ask for them, for example\n\nThis is from SegmentReader's ctor. I followed IndexReader.open() and reached it, without any 'ifs' (unless I missed something):\n\n{code}\n      instance.core = new SegmentCoreReaders(instance, dir, si, readBufferSize, termInfosIndexDivisor);\n      if (doOpenStores) {\n        instance.core.openDocStores(si);\n      }\n      instance.loadDeletedDocs();\n      instance.openNorms(instance.core.cfsDir, readBufferSize);\n{code}\n\nIt does load the norms and deleted docs (and maybe even doc stores).\n\nbq. Well its still available in 3.x as deprecated methods... were you planning on making a patch against 3.x for LUCENE-3786 initially?\n\nThere are two questions here:\n\n(1) Was I planning to support SearcherTaxoManager in 3.x -- YES\n(2) Was I planning to start with a patch against 3.x -- Not Necessarily.\n\nbq. here's an idea: how about we defer this discussion until we see your patch? If it makes sense for LUCENE-3786, then we have a valid use case?\n\nWhy? Isn't the scenario that I described above enough? Maybe you tell me -- if all you need to do is addIndexes(Directory) and merge the Directory's commitUserData, would you agree to open an IndexReader just for reading the commit data? Don't you think it's too much?",
            "date": "2012-02-15T11:40:54.469+0000",
            "id": 21
        },
        {
            "author": "Shai Erera",
            "body": "You also made that comment:\n\nbq. If someone has a real use case: then they can still do it (we didnt hurt them). If no one speaks up for a whole release cycle, they are gone.\n\nI can still use them in 3.x, but won't in trunk (they're gone from IR there already). And I did speak up before the release :).",
            "date": "2012-02-15T11:48:18.101+0000",
            "id": 22
        },
        {
            "author": "Robert Muir",
            "body": "{quote}\nIt does load the norms and deleted docs (and maybe even doc stores).\n{quote}\n\nnorms are lazy-loaded and cached, when you first ask for them. That just opens the file.\n\nBut still, i dont get it, if you are really worried about these costs, whats wrong with Uwe's suggested method?\n",
            "date": "2012-02-15T11:48:26.276+0000",
            "id": 23
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. I can still use them in 3.x, but won't in trunk (they're gone from IR there already)\n\nIR does no longer know Directory at all, I think your speak about DirectoryReader in trunk. But there you still can use listCommist()[last]. And thats cheap, just because it creates an ArrayList it is not expensive? ",
            "date": "2012-02-15T11:51:40.843+0000",
            "id": 24
        },
        {
            "author": "Shai Erera",
            "body": "You're right Uwe, I can do that. But it's still expensive to list all the commits if one just wants the latest's commitData.",
            "date": "2012-02-15T11:57:31.716+0000",
            "id": 25
        },
        {
            "author": "Uwe Schindler",
            "body": "In that case, SegmentInfos is public, so you can use this expert API and read the segmentinfos yourself and ask for anything you want. The code in DR.getCommitUserData is only like 3 lines.",
            "date": "2012-02-15T12:11:46.109+0000",
            "id": 26
        },
        {
            "author": "Shai Erera",
            "body": "Yes, I know that I can write it. But it means I'll need to write it in every project that I work on. And so will other people. I really don't get it -- what's the problem with having such utility method. If we move it to a DirectoryUtils, will that be better? If we move it to DirectoryReader (on trunk) will that be better?\n\nI don't understand since when we decided to drop API that our users need, because some people \"don't understand the scenario\". Is there a technical reason to remove the method? Is it badly implemented? Is it buggy? Is it hard to maintain?",
            "date": "2012-02-15T16:39:02.001+0000",
            "id": 27
        },
        {
            "author": "Shai Erera",
            "body": "Resolving back ... looks like I'm the only one that it bothers.",
            "date": "2012-02-16T13:01:07.504+0000",
            "id": 28
        }
    ],
    "component": "",
    "description": "Spinoff from Ryan's dev thread \"DR.getCommitUserData() vs DR.getIndexCommit().getUserData()\"... these methods are confusing/dups right now.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3760",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Cleanup DR.getCurrentVersion/DR.getUserData/DR.getIndexCommit().getUserData()",
    "systemSpecification": true,
    "version": ""
}