{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "+1 for the IndexWriterConfig with chaining method calls\n\nWe had a discussion about this a while ago on the mailinglist: [http://www.lucidimagination.com/search/document/19e1a19f4d340b8c/lucene_2_9_and_deprecated_ir_open_methods]",
            "date": "2010-03-04T09:58:57.326+0000",
            "id": 0
        },
        {
            "author": "Shai Erera",
            "body": "Thanks Uwe for the pointer.\n\nI suppose that MaxFieldLength should now move to IndexWriterConfig, only it is public and therefore needs to be deprecated. Otherwise it will look strange that in order to set MFL on IWC you need to reference IW. So deprecate and duplicate? To IW it doesn't matter because it just takes the limit (int) from MFL ...",
            "date": "2010-03-04T10:24:15.473+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "In my opinion the whole class is unneeded, so only deprecate in IW but not add it to IWConfig. For me a constant in IWConfig would be enough that defines UNLIMITED and everything else is just an integer. +1 for defaulting to \"static final UNLIMITED=Integer.MAX_VALUE\". I am not sure why this limitation is there at all. In my opinion it should be left to the apploication to limit the number of tokens if needed, but not silently drop tokens. If somebody gets an OOM, he can adjust the value and knows that mayabe some tokens get lost.\n",
            "date": "2010-03-04T10:31:06.556+0000",
            "id": 2
        },
        {
            "author": "Shai Erera",
            "body": "Yeah I don't like it either (makes my code unnecessarily long). And I always use UNLIMITED, and the LIMITED=10,000 is really just a guess, and so if anyone wants to limit it, he needs to do new MaxFieldLength(otherLimit) which is unnecessarily long as well ...\n\nI like it - I'll deprecate on IW and introduce UNLIMITED on IWC.",
            "date": "2010-03-04T10:35:11.666+0000",
            "id": 3
        },
        {
            "author": "Shai Erera",
            "body": "I was wondering if perhaps instead of allowing to pass a create=true/false, we should use an enum with 3 values: CREATE, APPEND, CREATE_OR_APPEND. The current meaning of create is a bit unclear. I.e. if it is true, then overwrite. But if it is false, don't attempt to create, but just open an existing one. However if the directory is empty, it throws an exception. I think an enum would someone to pass CREATE_OR_APPEND in case he doesn't know if there is an index there ... but I don't want to complicate things unnecessarily ... what do you think?",
            "date": "2010-03-04T11:14:04.902+0000",
            "id": 4
        },
        {
            "author": "Shai Erera",
            "body": "IndexingChain is one of the things that can be set on IW, however I don't see any implementations of it besides the default, and the class itself is package-private, so no app could actually set it on IW (unless it puts its code under o.a.l.index). Therefore I'm thinking of not introducing it on IWC, or turn it to a public class?\nIs it really something we expect any application out there to set, or can we simply make DocsWriter impl one for itself internally, and don't declare this class as abstract etc.?",
            "date": "2010-03-04T11:53:01.946+0000",
            "id": 5
        },
        {
            "author": "Shai Erera",
            "body": "I'm thinking to make this whole IWC a constructor only parameter to IW, without the ability to set it afterwards. I don't see any reason why would anyone change the RAM limit, Similarity etc while IW is running. What's the advantage vs. say close the current IW and open a new one with the different settings? I know the latter is more expensive, and I write it deliberately - I think those settings are really ctor-only settings. Otherwise you might get inconsistent documents (like changing the Similarity or max field length).\n\nThis will also simplify IWC, because now I need to distinguish between settings that cannot be altered afterwards, like changing IndexDeletionPolicy, create, IndexCommit, Analyzer ... if IWC will be a ctor only object, I can have only the default ctor (to init to default settings) and provide the setters otherwise.\n\nAny objections?",
            "date": "2010-03-04T12:23:56.208+0000",
            "id": 6
        },
        {
            "author": "Michael McCandless",
            "body": "+1 -- this is great!\n\nbq. I am not sure why MaxFieldLength is required in all IW ctors, yet IW declares a DEFAULT (which is an int and not MaxFieldLength). \n\nThis is because it's a dangerous setting (you silently lose content\nwhile indexing), a trap.  So we want to force the user to make the\nchoice, up front, so they realize the implications.\n\nBut, if we change the default to UNLIMITED (which we should do under\nVersion), then I agree you should not have to specify it.\n\nbq. In my opinion it should be left to the apploication to limit the number of tokens if needed, but not silently drop tokens\n\nI like that approach -- we could make a TokenFilter to do this?  Then\nwe don't need MFL at all in IWC (and deprecate in IW).\n\nbq. I was wondering if perhaps instead of allowing to pass a create=true/false, we should use an enum with 3 values: CREATE, APPEND, CREATE_OR_APPEND\n\n+1\n\nbq. I'm thinking to make this whole IWC a constructor only parameter to IW, without the ability to set it afterwards.\n\n+1 in general, though we should go setting by setting to confirm this is OK.  I\ndon't know of \"real\" use cases where apps eg want to change RAM buffer\nor mergeFactor... but maybe there are some interesting usages out\nthere.\n",
            "date": "2010-03-04T13:12:18.485+0000",
            "id": 7
        },
        {
            "author": "Shai Erera",
            "body": "bq. But, if we change the default to UNLIMITED\n\nToday there is no DEFAULT .. IW forces you to pass MFL so whoever moves to the new API can define whatever he wants. We'll default to UNLIMITED but there won't be any back-compat issue ...\n\nbq. we could make a TokenFilter to do this?\n\nI'm afraid that will result in changing all Analyzers to work properly? Or you mean DW (or somewhere) will wrap whatever TS an Analyzer returns w/ this filter? That could work, but as soon as that becomes a filter, people may use it, and wrapping their TS w/ that filter will be unnecessary (and slow 'em down?). Also, if I'd use such a filter myself, I wouldn't put it last in the chain, so that I can avoid doing any processing on a term that is not going to end up in the index. Although that's not too critical because I'll be doing this for just one term ...\n\nI guess I'd like to keep it as it is now, not turning the issue into a bigger thing ... and a filter alone won't solve it - we'd still need to provide a way to configure it, or otherwise everyone will need to wrap their Analyzers with such filter?",
            "date": "2010-03-04T13:29:20.944+0000",
            "id": 8
        },
        {
            "author": "Mark Miller",
            "body": "I can see the value in this - there are a bunch of IW constructors - but personally I still think I prefer them.\n\nCreating config classes to init another class is its own pain in the butt. Reminds me of windows C programming and structs. When I'm just coding away, its so much easier to just enter the params in the cnstr. And it seems like it would be more difficult to know whats *required* to set on the config class - without the same cstr business ...\n\n*edit*\n\nThough I suppose the chaining *does* makes this more swallowable...\n\nnew IW(new IWConfig(Analyzer).set().set().set()) isn't really so bad ...",
            "date": "2010-03-04T13:39:10.507+0000",
            "id": 9
        },
        {
            "author": "Shai Erera",
            "body": "I wouldn't worry about what's required - Directory will be left out, MFL is useless and a pain anyway, so what's left is Analyzer. I can put Analyzer on IWC's ctor, but I personally think we can default to a simple one (such as Whitespace) encouraging the people to set their own. I find it very annoying today when I want to test something about IW and I need to pass all these things to IW ...\n\nThe way I see it, those who want to rely on Lucene's latest and greatest can just do: IndexWriter writer = new IndexWriter(dir, new IWC()); Well maybe except for the Analyzer, but I really don't think it matters that much. And like you wrote, someone can chain the setters. So win-win? If you don't care about anything, just wants to open a writer, index something and that's it, you don't need to specify anything .. otherwise you just chain calls?\n\nOne thing I should add to IWC so far (I hope to post a patch even today) is a Version parameter. For now it will be ignored, but as a placeholder to change settings in the future.",
            "date": "2010-03-04T13:50:46.660+0000",
            "id": 10
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Today there is no DEFAULT .. IW forces you to pass MFL so whoever moves to the new API can define whatever he wants. We'll default to UNLIMITED but there won't be any back-compat issue ..\n\nAhh sorry right.  In the \"olden days\", 10000 was the default.\n\n{quote}\nbq. we could make a TokenFilter to do this?\n\nI'm afraid that will result in changing all Analyzers to work properly? Or you mean DW (or somewhere) will wrap whatever TS an Analyzer returns w/ this filter? That could work, but as soon as that becomes a filter, people may use it, and wrapping their TS w/ that filter will be unnecessary (and slow 'em down?). \n{quote}\n\nHmm yeah quite a hassle to fix all analyzers.  Hmmm.\n\nbq. I guess I'd like to keep it as it is now, not turning the issue into a bigger thing ... and a filter alone won't solve it - we'd still need to provide a way to configure it, or otherwise everyone will need to wrap their Analyzers with such filter?\n\nMaybe one solution is to wrap any other analyzer?  Ie, create a StopAfterNTokensAnalyzer,  taking another analyzer that it delegates to, and then sticking on this StopAfterNTokensFilter to each token stream.\n\nBut yeah maybe break this out as a separate issue...\n\nbq. Also, if I'd use such a filter myself, I wouldn't put it last in the chain, so that I can avoid doing any processing on a term that is not going to end up in the index. Although that's not too critical because I'll be doing this for just one term ...\n\nActually it ought to be 0 terms wasted, with the filter @ the end -- with this StopAfterNTokensFilter, it'll immediately return false w/o asking for the 10001th token.\n\nbq. One thing I should add to IWC so far (I hope to post a patch even today) is a Version parameter. For now it will be ignored, but as a placeholder to change settings in the future.\n\n+1",
            "date": "2010-03-04T15:39:32.295+0000",
            "id": 11
        },
        {
            "author": "Shai Erera",
            "body": "There are some settings on IW that go directly to the MergePolicy used (well ... only if it's LogMergePolicy). At first I wanted to move them, together w/ MP, to IWC, but this isn't possible, because MP requires IW to be passed to its ctor, and when IWC is created, there is no IW ... So there are couple of options I can think of:\n\n* Add all to IWC, and expose on MP a final setIndexWriter, package-private, as well as an empty ctor. IW will later set MP's IW. It will also allow applications to pass their  own MP after IW has been created (like they can do today). IWC will delegate all set/get to MP, like IW does today. The only downside is that the IW member of MP won't be final anymore ...\n\n* Keep the get/set on IW, like it is today. It will split the configuration of IW to two places ... I prefer to keep it all in one place.\n\n* Remove all the set/get from IW and let applications interface directly with MP. It will remove the bizarre situation where someone could pass a non LogMergePolicy to IW, however when he'll try to set anything on it from IW, it will fail ... If we remove the get/set from IW and let folks interface w/ their MP directly, we won't have this problem:\n** They'll need to declare the MP of type LogMP, or otherwise the API won't be there.\n** if they use their own MP, with special API, they'll interface w/ MP's configuration from one place ...\n\nBetween the three, I like (3) the best as it will get rid of the inconsistency in IW today (expecting only LogMP, but requiring MP). But if those set/get are important to keep together with the other configuration, I prefer (1). What do you think?",
            "date": "2010-03-04T21:28:18.688+0000",
            "id": 12
        },
        {
            "author": "Earwin Burrfoot",
            "body": "I voted for killing these delegating methods some time ago. It ended in nothing, so I vote again, #3 :)",
            "date": "2010-03-04T22:35:46.230+0000",
            "id": 13
        },
        {
            "author": "Yonik Seeley",
            "body": "Yay, we'll be able to remove SolrIndexConfig and use this :-)",
            "date": "2010-03-04T23:09:08.502+0000",
            "id": 14
        },
        {
            "author": "Shai Erera",
            "body": "Ok, then I'll proceed w/ #3.",
            "date": "2010-03-05T04:05:24.882+0000",
            "id": 15
        },
        {
            "author": "Michael McCandless",
            "body": "So this will affect these methods in IW, right:\n{code}\nget/setMergeFactor(...)\nget/setUseCompoundFile(...)\nget/setMaxMergeDocs(...)\n{code}\nIe, we'd deprecate them.  Instead you'd have to interact /w the MergePolicy.  IW will still default its merge policy, so with this change, instead of:\n{code}\nwriter.setMergeFactor(7);\n{code}\nYou'd have to do:\n{code}\n((LogMergePolicy) writer.getMergePolicy()).setMergeFactor(7));\n{code}\n\n(And take the risk of runtime cast yourself/explicitly, which IW was already doing under the hood anyway).\n",
            "date": "2010-03-05T10:46:01.671+0000",
            "id": 16
        },
        {
            "author": "Shai Erera",
            "body": "Exactly !\n\nOnly I hope that if people will interact w/ their MP to set stuff on it, they would interact with it to query its settings. Calling IW.getMergePolicy will become redundant, or at least will be avoidable. Maybe only when you rely on the default MP, you'll perform the last code example you gave above. Actually, I've already done 98% of the change. I need to finish some stuff on IW and then I'll post the patch.\n\nOn the MFL/Analyzer - I like the approach of wrapping an Analyzer with a MFLAnalyzer. The beauty is that if I don't want to limit anything, I don't need to do anything and the code won't need to keep track of how many tokens were indexed for that field ... I still think it should be done in a separate issue, as it involves introducing some code in the lower levels to wrap any Analyzer with it, for back-compat. If we do it, let's do it before 3.1 is out, so we can remove it from IWC right away w/o deprecating anything ...\n\nI'll open an issue for it.",
            "date": "2010-03-05T11:22:52.894+0000",
            "id": 17
        },
        {
            "author": "Shai Erera",
            "body": "Patch includes:\n* IndexWriterConfig + Test\n* Changes to IndexWriter to use IWC\n* Changes to DocumentsWriter - removed IndexingChain from its ctor and always use default.\n\nIndexingChain is package-private and so was the ctor on IndexWriter which allowed to set it. If that's important (e.g. used by SOLR maybe?), then I can add a package-private setting to IndexWriterConfig which will allow setting this. But since I haven't found any calls in Lucene (tests nor java), and no implementations of this class besides the default that is in DW, I thought this can be removed.\n\nI would like to have this patched reviewed, before I go about changing all the code to use the new IWC (tests + java). If we agree on the details and how it looks and used, I'll do it - should be straightforward.",
            "date": "2010-03-05T14:01:56.591+0000",
            "id": 18
        },
        {
            "author": "Michael McCandless",
            "body": "Ha, I see TODO 4.0 comments now.  Sheesh ;)\n\nPatch looks great Shai!\n\nA few comments:\n\n  * Hmm... I think we should still allow package private specification\n    of the indexing chain?  Not long ago Michael B. explicitly opened\n    this up (while keeping it package private).  I think for\n    way-expert users we should keep it extensible?\n\n  * For IWC.setAnalyzer(null), instead of silently swapping in\n    WhitespaceAnalyzer, can we throw IllegalArgE?\n\n  * Should we disallow all setters on IWC after it's been consumed by\n    an IW?  (Though one may want to re-use to make another IW).\n    Or... make it very clear that IW fully consumes the IWC on\n    creation and never again looks at it...?  (OK, I do see this in\n    IW.getConfig and IWC).  Should IW just clone the IWC and reference\n    it internally, instead of copying to private fields?  Or... IW\n    marks the IWC readOnly (and setters on it then fail), and you must\n    clone it if you will re-use?\n\n  * In IWC we call it \"scheduler\" but seems like we should keep the\n    name \"mergeScheduler\"?  (And in toString, too).\n\n  * Why can't MergePolicy also live in IWC?  Seems odd to move\n    MergeScheduler to it but not MP.  (And deprecate set/getMP in IW)\n\n  * Nit-picky, but, IW.messageState will have a space before each of\n    its entries but then IWC's entries have no space -- looks not so\n    nice on enabling infoStream?\n\n  * Need small jdoc for the new IW ctor\n",
            "date": "2010-03-05T20:42:56.159+0000",
            "id": 19
        },
        {
            "author": "Shai Erera",
            "body": "bq. Hmm... I think we should still allow package private specification of the indexing chain?\n\nOk, I'll add it back.\n\nbq. For IWC.setAnalyzer(null)\n\nI preferred not to (it's not just setAnalyzer, but also MS, Similarity and IndexDeletionPolicy). I specifically documented on each what happens if one passes null. I think it's better service - you're not expected to pass null, and so if you do, instead of throwing an exception, we revert to default. I thought at some point to add a restoreDefaults() method, but then realized that doing new IWC() is not that expensive ...\nI think - if someone uses IWC but receives any of those settings from the outside, instead of asking him to always check for null, we tell him \"pass null, we revert to default\" ...\n\nbq. In IWC we call it \"scheduler\"\n\nWoops, fixed that !\n\nbq. Why can't MergePolicy also live in IWC?\n\nI've commented on it in this issue - MP requires an IW instance to be passed to its ctor.(see my comment from 04/Mar/10 09:28 PM).\n\nbq. IW.messageState will have a space before each of its entries \n\nIWC.toString() includes '\\n' between settings. I thought it'd be more readable that way because otherwise it'd be a long line. The output for me looks like that:\n{code}\nIW 0 [main]: dir=org.apache.lucene.store.RAMDirectory@2ca22ca2 mergePolicy=org.apache.lucene.index.LogByteSizeMergePolicy@6ca06ca index= version=3.1-dev config=matchVersion=LUCENE_31\nanalyzer=org.apache.lucene.analysis.WhitespaceAnalyzer\ndelPolicy=org.apache.lucene.index.KeepOnlyLastCommitDeletionPolicy\ncommit=null\nopenMode=CREATE_OR_APPEND\nmaxFieldLength=2147483647\nsimilarity=org.apache.lucene.search.DefaultSimilarity\ntermIndexInterval=128\nmergeScheduler=org.apache.lucene.index.ConcurrentMergeScheduler\ndefault WRITE_LOCK_TIMEOUT=1000\nwriteLockTimeout=1000\nmaxBufferedDeleteTerms=-1\nramBufferSizeMB=16.0\nmaxBufferedDocs=-1\n{code}\n\nPerhaps I'll print \"config=\\n\" so that all config parameters start on the new line, and not all but the first. Is that acceptable, or you still prefer all to be on one line, space separated?\n\nbq. Need small jdoc for the new IW ctor\n\nI'll add that. That one slipped :).\n\nbq. Should we disallow all setters on IWC after it's been consumed by an IW?\n\nI've thought about all the options that you raise, and decided to keep the situation as-is, to let others also comment on that. So I'm glad you commented :).\n\n* I've documented on IW.getConfig() that setting anything on the returned object has no effect on IW instance, and if one needs to do it, one should re-instantiate IW.\n* I also thought to turn off setters (setting IWC to read-only by IW), but then someone won't be able to reuse an IWC\n* Removing the fields from IW is not good, because then someone could really call getConfig().setMaxBufferedDocs and that will affect IW, unlike what the comment says. If we want to really keep everything in IWC, we need to clone on ctor and getConfig() time. Seems a waste to me.\n\nI think I'll just clone the incoming IWC on IW and leave the rest as-is?",
            "date": "2010-03-06T04:03:25.622+0000",
            "id": 20
        },
        {
            "author": "Shai Erera",
            "body": "Patch with applied comments. I'll start moving the code to use the new ctor, class etc.",
            "date": "2010-03-06T04:40:58.270+0000",
            "id": 21
        },
        {
            "author": "Michael McCandless",
            "body": "OK let's keep the semantics of \"if you pass null that means restore to default\".\n\nShould we rename UNLIMITED_FIELD_LENGTH -> DEFAULT_MAX_FIELD_LENGTH?  (Though w/ the new issue this should be going away from IWC anyway).\n\nbq. IWC.toString() includes '\\n' between settings\n\nAhh, I misread it (I thought IW was doing \\n followed by single space).  I agree multiple lines is much better.  How about making IW also do multiple lines for its non-IWC settings that are messaged?  And then removing the config= from the output?  Ie all I see is a bunch of settings.  I don't think [in this debug printout] that we need to message which setting was on IW and which was from the IWC.\n\nbq. I've commented on it in this issue - MP requires an IW instance to be passed to its ctor.(see my comment from 04/Mar/10 09:28 PM).\n\nAhh, sorry, right.  Annoying we moved IW as required into MP :(  Hrmph.\n\nbq. I think I'll just clone the incoming IWC on IW and leave the rest as-is?\n\nOK, I think this is fine, for starters.  The API semantics are clearly defined, so, if at a later date we harden the enforcement (say throw IllegalStateEx if you try to change anything after IWC has been consumed by IW, that's fair game).\n\nMaybe clearly state in the jdocs that presently no settings are version dependent, so it's just a placeholder?  (Basically, elevate the code comment that already says this, into the jdocs).  Whenever a class in Lucene takes a Version, we should strongly document how Version alters settings, even if it's a no-op placeholder.   (And I agree we should have it here as placeholder).\n\nPatch looks good Shai, thanks!",
            "date": "2010-03-06T10:44:51.619+0000",
            "id": 22
        },
        {
            "author": "Shai Erera",
            "body": "bq. UNLIMITED_FIELD_LENGTH\n\nI deliberately named it like that. There is currently IW.DEFAULT_MAX_FIELD_LENGTH which is set to 10,000. I didn't want to keep the same name so as to not confuse. The default, UNLIMITED, is documented on setMaxFieldLength.\n\nBut like you said, it may go entirely away in LUCENE-2295.\n\nbq. Annoying we moved IW as required into MP\n\nI think I'm to blame for this :).\n\nbq. How about making IW also do multiple lines for its non-IWC setting\n\nDone.\n\nThanks for the comments. Continuing with converting the code. I'm flying to the US tonight, so I may not finish it before I leave. And then I'll be gone for ~30 hours before I can ping again :).",
            "date": "2010-03-06T13:49:40.812+0000",
            "id": 23
        },
        {
            "author": "Shai Erera",
            "body": "While I'm converting the tests to use the new IWC, and getting rid of deprecated methods, I think it'll be useful to add a MergePolicyConfig. But since most of the setters used today assume a LogMergePolicy, and since it's also unrelated to IW, I prefer to leave it for a separate issue. Doing that, w/ the methods chaining approach, will simplify usage even more.",
            "date": "2010-03-07T20:19:18.048+0000",
            "id": 24
        },
        {
            "author": "Shai Erera",
            "body": "Patch with all tests and code converted to not use the deprecated API, and move to use IWC. All except CreateIndexTask in benchmark, which looks a bit more complicated to change, I left it out for now.\n\nAnother thing - I deprecated *QueryParserWrapperTest and did not convert them to use the new IWC API, as those tests will be removed when *QueryParserWrapper will be removed.\n\nAll tests pass.",
            "date": "2010-03-08T20:10:50.365+0000",
            "id": 25
        },
        {
            "author": "Michael McCandless",
            "body": "Patch looks good -- thanks Shai!\n\nI'll commit in a day or two.",
            "date": "2010-03-08T21:48:58.168+0000",
            "id": 26
        },
        {
            "author": "Michael McCandless",
            "body": "Phew!  Thanks Shai...",
            "date": "2010-03-10T17:56:41.343+0000",
            "id": 27
        },
        {
            "author": "Michael McCandless",
            "body": "Robert raised a concern on java-dev: maybe we should not have a default analyzer....?  Ie force the user to make an explicit choice.\n",
            "date": "2010-03-10T18:37:49.400+0000",
            "id": 28
        },
        {
            "author": "Robert Muir",
            "body": "Here's my elaboration a bit:\n\nI like the concept of good, versioned defaults, but i think this is just a decision point that\na user should have to make, like it is now.\n\nA practical concern that I have: Whitespace really sucks, we will get lots of questions\non java-user because \"lucene doesnt search upper/lowercase by default\". This is because\nbeginner users will only do what work is necessary for their application to compile.\n",
            "date": "2010-03-10T18:42:43.184+0000",
            "id": 29
        },
        {
            "author": "Shai Erera",
            "body": "I disagree, but obviously I'm on the minority side. It is clearly documented what's the default Analyzer used is, and that you should change it if you want to get more meaningful analysis. When I created IWC I really wanted to simplify how IW is created. If we force IWC to accept both a Version AND an Analyzer, instantiating IW will look like this: new IndexWriter(dir, new IndexWriterConfig(matchVersion, analyzer));\n\nWe don't accomplish anything with it, took away the MFL argument and replace it w/ IWC ... Remember - those that used to set all kind of parameters, using the other ctors, anyway care about how their IW is instantiated. The others that used IW(dir, analyzer, MFL) don't care about all other attributes. MFL is just annoyance, so we removed it. I just don't feel that a default Analyzer, which is Whitespace, is bad. It's easy to understand what your analysis looks like, and since it's well documented, nobody can say \"hey, what didn't you warn me\". IW defaults to all other bunch of settings, so why is Analyzer different?\n\nIf we say Analyzer is mandatory, what will stop us tomorrow from saying IndexDeletionPolicy is mandatory? And then we'll get into whole bunch of ctors, only now on IWC? If we're documenting things clearly, and IWC documents clearly all its defaults, I see no reason why to require an Analyzer to be specified up front. At least to me, that will make this entire change useless. When I create my IW for serious indexing, I take care of all its settings. Otherwise I just instantiate it to check something completely not related to its defaults. If I test those, I define them (otherwise I cannot test them).\n",
            "date": "2010-03-10T19:20:19.346+0000",
            "id": 30
        },
        {
            "author": "Mark Miller",
            "body": "bq. If we say Analyzer is mandatory, what will stop us tomorrow from saying IndexDeletionPolicy is mandatory?\n\nNothing ;) But I think Analyzer should be mandatory and that IndexDeletionPolicy should not be mandatory, looking at them case by case.",
            "date": "2010-03-10T19:23:35.547+0000",
            "id": 31
        },
        {
            "author": "Shai Erera",
            "body": "This doesn't help much Mark :).\n\nQuestion - does SOLR requires everyone to specify an Analyzer, or does it come w/ a default one?",
            "date": "2010-03-10T19:26:58.090+0000",
            "id": 32
        },
        {
            "author": "Michael McCandless",
            "body": "I'll revert the commit while we discuss...",
            "date": "2010-03-10T19:27:35.383+0000",
            "id": 33
        },
        {
            "author": "Robert Muir",
            "body": "bq. IW defaults to all other bunch of settings, so why is Analyzer different?\n\nJust my opinion, but what makes it different is that breaking text into tokens\nand indexing them is what search is all about.\n\nDeletions is an optional feature, and if someone got rid of it alltogether, I wouldn't\neven comment on the issue, I could care less.",
            "date": "2010-03-10T19:28:56.439+0000",
            "id": 34
        },
        {
            "author": "Mark Miller",
            "body": "bq. Question - does SOLR requires everyone to specify an Analyzer, or does it come w/ a default one?\n\nHmm... SOLR doesn't really use Lucene analyzers.\n\nIt comes with a default Schema.xml that defines FieldTypes. Then field names can be assigned to FieldTypes. So technically speaking, no, Solr does not - but because most\npeople build off the example, you could say that it does have defaults for example FieldTypes and defaults of what field names map to those. But it also only accepts certain example fields with the example Schema - you really\nhave to go in and customize it to your needs - its setup to basically show off what options are available and work with some demo stuff.\n\nSolr comes with almost no defaults in a way - but it does ship with an example setup that is meant to show you how to set things up, and what is available. You could consider those defaults since most will build off it.\n\nexample of Solr analyzer declaration:\n\n{code}\n    <!-- A general unstemmed text field - good if one does not know the language of the field -->\n    <fieldType name=\"textgen\" class=\"solr.TextField\" positionIncrementGap=\"100\">\n      <analyzer type=\"index\">\n        <tokenizer class=\"solr.WhitespaceTokenizerFactory\"/>\n        <filter class=\"solr.StopFilterFactory\" ignoreCase=\"true\" words=\"stopwords.txt\" enablePositionIncrements=\"true\" />\n        <filter class=\"solr.WordDelimiterFilterFactory\" generateWordParts=\"1\" generateNumberParts=\"1\" catenateWords=\"1\" catenateNumbers=\"1\" catenateAll=\"0\" splitOnCaseChange=\"0\"/>\n        <filter class=\"solr.LowerCaseFilterFactory\"/>\n      </analyzer>\n      <analyzer type=\"query\">\n        <tokenizer class=\"solr.WhitespaceTokenizerFactory\"/>\n        <filter class=\"solr.SynonymFilterFactory\" synonyms=\"synonyms.txt\" ignoreCase=\"true\" expand=\"true\"/>\n        <filter class=\"solr.StopFilterFactory\"\n                ignoreCase=\"true\"\n                words=\"stopwords.txt\"\n                enablePositionIncrements=\"true\"\n                />\n        <filter class=\"solr.WordDelimiterFilterFactory\" generateWordParts=\"1\" generateNumberParts=\"1\" catenateWords=\"0\" catenateNumbers=\"0\" catenateAll=\"0\" splitOnCaseChange=\"0\"/>\n        <filter class=\"solr.LowerCaseFilterFactory\"/>\n      </analyzer>\n    </fieldType>\n{code}",
            "date": "2010-03-10T19:38:14.395+0000",
            "id": 35
        },
        {
            "author": "Michael McCandless",
            "body": "Really, eventually, I'd like a stronger separation of analysis and\nindexing, so that IndexWriter never even gets an analyzer.\n\nIe, the fields in the doc that need to be indexed should only present\nan attr source, and IW pulls from that.\n\nIW is then fully agnostic to how that attr source was created -- one\nneed not even use analyzers/tokenizer/tokenfilter approach\nat all (create something custom).\n\nIW now has a lot of embedded logic to figure out how to get the attr\nsource -- not analyzed fields, analyzed but it's a Reader vs a String\nvs pre-analyzed, etc.\n\nBut until then I agree it's dangerous to default the analyzer -- user\nshould be explicit.  It's similar to how we promoted field truncation\n(max field length) to be an explicit choice, because it's a dangerous\ndefault (because it silently alters what makes it into your index).\n",
            "date": "2010-03-10T19:42:54.877+0000",
            "id": 36
        },
        {
            "author": "Shai Erera",
            "body": "bq. what makes it different is that breaking text into tokens and indexing them is what search is all about.\n\nI agree, and Whitespace is easy to explain and understand. Who said that Standard or Simple is better, for example (I know you don't say it)? I just don't understand why we should force everyone to select an Analyzer even when they don't want to, or care.\n\nRemember that all the people out there today already set an Analyzer, so when they port to the new API they'll continue setting it (unless they didn't care but were forced to do it). New users ... well I hope they read jdocs.\n\nIt's good that SOLR doesn't force people to specify the Analyzer ... smart decision, for play/example purposes.",
            "date": "2010-03-10T20:07:33.647+0000",
            "id": 37
        },
        {
            "author": "Shai Erera",
            "body": "Mike - regarding getting rid of Analyzer on IW. Today it's very convenient that I can specify my default Analyzer for all ANALYZED fields, for all documents. I don't understand how a Field can introduce an Analyzer - do I now set an Analyzer on every field I add to a Document? Wouldn't that be extremely inconvenient?\n\nIf you want to get rid of Analyzer on IW I'm fine. We can throw away the addDocument(Doc) method and always force a user to pass an Analyzer. Much better than requiring him to pass it on every field he adds to a document ...",
            "date": "2010-03-10T20:12:11.350+0000",
            "id": 38
        },
        {
            "author": "Mark Miller",
            "body": "I'm assuming you would set an Analyzer for the document - and then you could override per field - or something along those lines.",
            "date": "2010-03-10T20:26:35.356+0000",
            "id": 39
        },
        {
            "author": "Michael McCandless",
            "body": "I opened LUCENE-2309 for decoupling IW from analysis.  IW would only need to know about attr source.",
            "date": "2010-03-10T20:37:08.064+0000",
            "id": 40
        },
        {
            "author": "Michael McCandless",
            "body": "If we did LUCENE-2309 then IWC wouldn't need an Analyzer, default or otherwise ;)",
            "date": "2010-03-10T20:37:36.907+0000",
            "id": 41
        },
        {
            "author": "Shai Erera",
            "body": "bq. I'm assuming you would set an Analyzer for the document - and then you could override per field - or something along those lines.\n\nIsn't that like calling IW.addDocument(Doc, Analyzer) where some of the fields have pre-defined TokenStream? What's the difference then? Why change the current API (besides getting rid of the addDoc(Doc) method)?",
            "date": "2010-03-10T21:37:04.407+0000",
            "id": 42
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Isn't that like calling IW.addDocument(Doc, Analyzer) where some of the fields have pre-defined TokenStream?\n\nWell, where all of the fields have pre-defined TokenStream, or, can produce it on demand with no other args (ie that field instance knows its analyzer).\n\nbq. What's the difference then? Why change the current API (besides getting rid of the addDoc(Doc) method)?\n\nWell it'd simplify your work here, for one :)\n\nBut it'd also put distance between IW and analysis, which I think is useful for others to use Lucene with their own \"means\" of producing tokens.  Tying IW to less concrete impls also increases our independence which makes cross-version compatibility easier, over time.  The more independent the various parts of Lucene are the more we can factor things out...",
            "date": "2010-03-10T22:05:23.931+0000",
            "id": 43
        },
        {
            "author": "Shai Erera",
            "body": "bq. Well it'd simplify your work here, for one\n\nI'm afraid that's too late no? I've already completed that work ... it's that late realization that forces me to re-do it again ... \n\nI don't mind if IW does not know about Analyzers, I'm perfectly fine w/ it (and even like it).\n\nSuggestion: since re-doing all that work, meaning adding Whitespace to the instantiation in all the places that really don't care, is very expensive and time consuming on my part, if LUCENE-2309 is resolved before 3.1, can we keep IWC as-is, and as part of 2309 remove setAnalyzer from IWC? It will keep the ctor's signature as it is now, and we won't need to change all of these classes again in 2309. Only those that explicitly call setAnalyzer.\n\nIs that acceptable?",
            "date": "2010-03-10T23:21:36.992+0000",
            "id": 44
        },
        {
            "author": "Shai Erera",
            "body": "Patch w/ IWC requiring an Analyzer in its ctor. All tests pass",
            "date": "2010-03-11T08:34:56.535+0000",
            "id": 45
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Shai!  I'll look through it...",
            "date": "2010-03-11T10:15:27.895+0000",
            "id": 46
        },
        {
            "author": "Michael McCandless",
            "body": "Patch looks good Shai -- that was fast adding back in the analyzers :)\n\nA few things:\n\n  * Should we also move MergedSegmentWarmer to IWC?\n\n  * This adds more Version.LUCENE_CURRENTs in contrib... but I don't\n    see any way around that (and it's good to add the placeholder to\n    IWC).\n\n  * There were some tests that previously passed null as analyzers,\n    that you changed to WhitespaceAnalyzer, which seems OK.\n\n  * I see you cleaned some stuff up in the process (fixed \"extends\n    TestCase\" -> extends \"LuceneTestCase\", use TEST_VERSION_CURRENT\n    consistently instead using class member, added Version to ctor for\n    analyzers that now require them, noting that test is deprecated\n    since it only tests deprecated class, fixed places where tests\n    passed null as analyzer) -- good!\n\n  * There are a number of tests where the analyzers were changed, eg\n    Simple -> Whitespace or Standard -> Whitespace -- I attached\n    check.py (run it w/ 1 arg which is path to the patch file).  Note\n    that not all things it finds are actually changed (ie it has some\n    false pos's, but I think not too many).  Tests still pass... but\n    it makes me a bit nervous.  Shouldn't we just keep the same\n    analyzer?\n",
            "date": "2010-03-11T19:48:41.443+0000",
            "id": 47
        },
        {
            "author": "Shai Erera",
            "body": "bq. Should we also move MergedSegmentWarmer to IWC?\n\nI guess it could ... wonder how I missed it ...\n\nbq. This adds more Version.LUCENE_CURRENTs in contrib... \n\nI added it on purpose, so we know to convert these places when we remove LUCENE_CURRENT. We can also do this gradually in LUCENE-2305.\n\nbq. There were some tests that previously passed null as analyzers\n\nThose were exactly the cases I wanted to move Analyzer out of the mandatory list. Whatever you pass will work for those tests, because they obviously don't rely on analysis ... otherwise they'd had been hit by NPE.\nHmm ... I wonder if I can still pass 'null' for them. I used eclipse search/replace tool to add the Analyzer to IWC calls. The null argument disappeared completely because they used the default, so the search/replace tool replaced that w/ Whitespace. I prefer to keep it that way, to avoid re-changing them again.\n\nbq. There are a number of tests where the analyzers were changed ...\n\nI thought that that's ok, because those tests don't rely on the output of analysis, or otherwise they should have tested/asserted it. Since they don't, it shouldn't matter to them. But I'll revert that change.\n\nSo two things I need to do:\n# revert the changes to those tests\n# add warmer to ",
            "date": "2010-03-11T20:05:26.183+0000",
            "id": 48
        },
        {
            "author": "Shai Erera",
            "body": "Patch updated w/:\n# Move setMergedSegmentWarmer to IWC.\n# Revert the changes reported by check.py\n\nNote, check.py still alerts on some changes, though I don't see any relevant change in the patch file. Should I ignore them?",
            "date": "2010-03-12T06:11:13.006+0000",
            "id": 49
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Shai, I'll look...\n\nbq. Note, check.py still alerts on some changes, though I don't see any relevant change in the patch file. Should I ignore them?\n\nYes if they are indeed false positives...",
            "date": "2010-03-12T10:59:18.728+0000",
            "id": 50
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Note, check.py still alerts on some changes, though I don't see any relevant change in the patch file. Should I ignore them?\n\nHmm some of these (at least TestAtomicUpdate was changed from Simple -> Whitespace) were in fact real changes.... I'll fix & post a new patch.",
            "date": "2010-03-12T11:21:37.734+0000",
            "id": 51
        },
        {
            "author": "Michael McCandless",
            "body": "Attached new patch, just fixing a couple tests where analyzer had changed.\n\nI it's ready to commit (take 2)!  I'll wait a day or two...",
            "date": "2010-03-12T11:44:20.225+0000",
            "id": 52
        },
        {
            "author": "Shai Erera",
            "body": "Thanks Mike. I ran the tool once, fix all that it complained. Then 2nd time it found some more (probably some I missed in the 1st pass), only this time really few more. So I fixed them as well. But I didn't run it 3rd time :) ...\n\nI can't wait for this to be in ... an exhausting issue ;).",
            "date": "2010-03-12T14:26:16.359+0000",
            "id": 53
        },
        {
            "author": "Robert Muir",
            "body": "bq. I can't wait for this to be in ... an exhausting issue\n\nShai, thanks for taking the time to redo this massive patch. I'm sorry \nagain I dropped the ball and didn't notice till the commit, forcing you \nto redo a lot of work.\n\n+1",
            "date": "2010-03-13T15:09:05.575+0000",
            "id": 54
        },
        {
            "author": "Shai Erera",
            "body": "Thanks a lot Robert for reviewing this. No harm done ... I've had the chance to exercise some of Eclipse tricks in the process or re-doing. Unfortunately it introduced some changes, but luckily we have Mike and his mighty-python-scripting-ability to protect us :).\n\nNow I have a bunch of other issues I need to open, that were waiting for this guy to go in. Stay tuned",
            "date": "2010-03-13T15:18:54.319+0000",
            "id": 55
        },
        {
            "author": "Michael McCandless",
            "body": "Take 2!  Thanks Shai.",
            "date": "2010-03-13T15:35:40.400+0000",
            "id": 56
        }
    ],
    "component": "core/index",
    "description": "I would like to factor out of all IW configuration parameters into a single configuration class, which I propose to name IndexWriterConfiguration (or IndexWriterConfig). I want to store there almost everything besides the Directory, and to reduce all the ctors down to one: IndexWriter(Directory, IndexWriterConfiguration). What I was thinking of storing there are the following parameters:\n* All of ctors parameters, except for Directory.\n* The different setters where it makes sense. For example I still think infoStream should be set on IW directly.\n\nI'm thinking that IWC should expose everything in a setter/getter methods, and defaults to whatever IW defaults today. Except for Analyzer which will need to be defined in the ctor of IWC and won't have a setter.\n\nI am not sure why MaxFieldLength is required in all IW ctors, yet IW declares a DEFAULT (which is an int and not MaxFieldLength). Do we still think that 10000 should be the default? Why not default to UNLIMITED and otherwise let the application decide what LIMITED means for it? I would like to make MFL optional on IWC and default to something, and I hope that default will be UNLIMITED. We can document that on IWC, so that if anyone chooses to move to the new API, he should be aware of that ...\n\nI plan to deprecate all the ctors and getters/setters and replace them by:\n* One ctor as described above\n* getIndexWriterConfiguration, or simply getConfig, which can then be queried for the setting of interest.\n* About the setters, I think maybe we can just introduce a setConfig method which will override everything that is overridable today, except for Analyzer. So someone could do iw.getConfig().setSomething(); iw.setConfig(newConfig);\n** The setters on IWC can return an IWC to allow chaining set calls ... so the above will turn into iw.setConfig(iw.getConfig().setSomething1().setSomething2()); \n\nBTW, this is needed for Parallel Indexing (see LUCENE-1879), but I think it will greatly simplify IW's API.\n\nI'll start to work on a patch.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2294",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Create IndexWriterConfiguration and store all of IW configuration there",
    "systemSpecification": true,
    "version": ""
}