{
    "comments": [
        {
            "author": "Alan Woodward",
            "body": "Trivial fix - we just check if the passed in fieldname is null, and if it is, return null.",
            "date": "2012-02-28T11:32:38.027+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "Hmm I don't think the Fields.terms API should be expected to accept null (eg I don't know if the other codecs will NPE).\n\nI'd rather fix span queries to not pass the null field.  Is this happening in SpanTermQuery.getSpans()?",
            "date": "2012-02-28T13:41:17.877+0000",
            "id": 1
        },
        {
            "author": "Alan Woodward",
            "body": "Here's a test case.  The error is thrown in SpanQuery.createWeight() when it's called on a bare SpanMultiTermQueryWrapper.\n\nIt looks as though a simple workaround is to always wrap SpanMultiTermQueryWrapper in a SpanOrQuery.  \n\nMaybe SpanOrQuery should not have a default constructor, but should require a fieldname if no clauses are supplied?",
            "date": "2012-02-28T14:28:41.146+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks for the test cases Alan!\n\nI folded those into a patch, added a few {{assert field != null}},\nand then fixed SpanWeight to detect when its .getField() is\nnull and return a null scorer in that case.\n\nI'd like to avoid the API break (changing Span*Query API to force\nup-front providing of the field) if we can...\n",
            "date": "2012-02-28T15:23:26.956+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Alan.\n\nI couldn't provoke an NPE on 3.x but I still fixed SpanWeight to not pass on a null field to IR.norms.",
            "date": "2012-03-07T19:38:41.848+0000",
            "id": 4
        }
    ],
    "component": "core/index",
    "description": "I found this when querying a MemoryIndex using a RegexpQuery wrapped by a SpanMultiTermQueryWrapper.  If the regexp doesn't match anything in the index, it gets rewritten to an empty SpanOrQuery with a null field value, which then triggers the NPE.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3831",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Passing a null fieldname to MemoryFields#terms in MemoryIndex throws a NPE",
    "systemSpecification": true,
    "version": "4.0-ALPHA"
}