{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Patch.",
            "date": "2011-04-11T10:58:40.819+0000",
            "id": 0
        },
        {
            "author": "Dawid Weiss",
            "body": "Ehm... an automaton with zero-arc nodes that are not final is no no longer an automaton, but a graph of some sort... I mean -- what is the interpretation of an empty non-final node? \"There is no sequence in the input that corresponds to this path and it is a prefix of some path in the input that you can't get from this automaton\", right? \n\nThis slowly becomes very confusing... the patch looks all right, but I'm thinking if the API overall is still clear.",
            "date": "2011-04-11T11:08:07.909+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "Well... for LUCENE-2948, I need this to handle term prefixes that are\nin the terms index and are also valid terms.\n\nFor example, I could have term \"foo\", a prefix of many other terms\n(\"foobar\", \"foobaz\", etc), and so the path f-o-o is in the terms index\n(pointing to a block that has all these other terms), ie ending on a\nzero-arc node.\n\nIf that ending zero-arc node is final, I know \"foo\" is a valid term\nand I must seek to the block to load it, but if it's not final, I know\nit cannot exist in the index, and I can fail-fast (return NOT_FOUND\nfrom seek(\"foo\")).\n",
            "date": "2011-04-11T15:55:14.064+0000",
            "id": 2
        },
        {
            "author": "Dawid Weiss",
            "body": "I know. I was just pointing out the fact that it does get fairly complex, but I don't have any constructive ideas how to make it simpler, so I'll simply shut up now :)",
            "date": "2011-04-11T19:03:53.556+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "I hear you :)\n\nI think Lucene's needs put \"pressure\" on the traditional FST bounds... so we need to stretch things a bit.",
            "date": "2011-04-12T12:55:19.689+0000",
            "id": 4
        }
    ],
    "component": "",
    "description": "I'm breaking out this one improvement from LUCENE-2948...\n\nCurrently, if a node has no outgoing edges (a \"stop node\") the FST\nforcefully marks this as a final node, but it need not do this.  Ie,\nwhether that node is final or not should be orthogonal to whether it\nhas arcs leaving or not.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3017",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "FST should differentiate between final vs non-final stop nodes",
    "systemSpecification": true,
    "version": ""
}