{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "simple patch, but will need to warn in CHANGES.txt that folks should reindex, if they are using non-Arabic stopwords.",
            "date": "2009-10-08T16:09:49.154+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "if no one objects, I'd like to commit this for 3.0 at the end of the day.",
            "date": "2009-10-08T16:24:39.664+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "here also update the javadocs to reflect the new order of what is going on in ArabicAnalyzer, to prevent any confusion to users.",
            "date": "2009-10-08T16:33:33.683+0000",
            "id": 2
        },
        {
            "author": "DM Smith",
            "body": "can you commit it to 2.9.1 too? (For those stuck on Java 1.4, there is no 3.0).",
            "date": "2009-10-08T16:40:56.150+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "bq. can you commit it to 2.9.1 too? (For those stuck on Java 1.4, there is no 3.0). \n\ncan someone comment on this one for me. \nI don't think its too much of a stretch to consider this a bug, even if it does not affect Arabic text.\n",
            "date": "2009-10-08T17:07:06.455+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 823534.\n(if it is ok to apply this to 2.9 branch as DM requested, we should reopen)\n",
            "date": "2009-10-09T12:59:59.746+0000",
            "id": 5
        },
        {
            "author": "Mark Miller",
            "body": "Your issue - if you can stretch it to bugish territory, I'd +1 it. I'd be wary of getting into porting features to 2.9.1 - but I wouldn't have a problem with this one myself.",
            "date": "2009-10-09T13:16:18.044+0000",
            "id": 6
        },
        {
            "author": "Robert Muir",
            "body": "Mark, I think the problem is really that I overlooked this use case in LUCENE-1758, because Arabic is not case sensitive.\n\nIt won't affect the default usage of the Analyzer (where all the stopwords are in Arabic and lowercase is a no-op).\n\nI am going to also set fix for 2.9.1 and give a day or two for people to comment if they disagree with applying to 2.9 branch.",
            "date": "2009-10-09T13:22:53.159+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "its been a few days, no one objected to applying this fix to the branch.\n\nbut I do not have permissions to commit to the branch... can someone commit this for me? Attached is the patch.",
            "date": "2009-10-14T14:27:23.416+0000",
            "id": 8
        },
        {
            "author": "Michael McCandless",
            "body": "Committed on 2.9.x.  Thanks Robert!",
            "date": "2009-10-14T23:01:17.308+0000",
            "id": 9
        },
        {
            "author": "Michael McCandless",
            "body": "Bulk close all 2.9.1 issues.",
            "date": "2009-11-07T14:57:30.304+0000",
            "id": 10
        }
    ],
    "component": "modules/analysis",
    "description": "ArabicAnalyzer lowercases text in case you have some non-Arabic text around.\nIt also allows you to set a custom stopword list (you might augment the Arabic list with some English ones, for example).\n\nIn this case its helpful for these non-Arabic stopwords, to lowercase before stopfilter.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1963",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Trivial",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "ArabicAnalyzer: Lowercase before Stopfilter",
    "systemSpecification": true,
    "version": "2.9"
}