{
    "comments": [
        {
            "author": "Simon Willnauer",
            "body": "Display the attached images\n\nbefore:\n\n!before.png!\n\nafter:\n\n!after.png!",
            "date": "2011-05-13T15:17:45.393+0000",
            "id": 0
        },
        {
            "author": "Dawid Weiss",
            "body": "This looks good to me. And even if it doesn't affect performance it definitely should help those poor souls wishing to actually understand this algorithm :)",
            "date": "2011-05-13T18:53:39.420+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "+1 -- we shouldn't create these scary states.",
            "date": "2011-05-13T18:54:06.246+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "Thanks guys, I'll add a test for this and commit.",
            "date": "2011-05-13T19:16:46.545+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 1102875.",
            "date": "2011-05-13T19:20:03.558+0000",
            "id": 4
        }
    ],
    "component": "",
    "description": "in our lev automata algorithm, we compute an upperbound of the maximum possible states (not the true number), and\ncreate some \"useless\" unconnected states \"floating around\".\n\nthis isn't harmful, in the original impl we did the Automaton is simply a pointer to the initial state, and all algorithms\ntraverse this list, so effectively the useless states were dropped immediately. But recently we changed automaton to\ncache its numberedStates, and we set them here, so these useless states are being kept around.\n\nit has no impact on performance, but can be really confusing if you are debugging (e.g. toString). Thanks to Dawid Weiss\nfor noticing this. \n\nat the same time, forcing an extra traversal is a bit scary, so i did some benchmarking with really long strings and found\nthat actually its helpful to reduce() the number of transitions (typically cuts them in half) for these long strings, as it\nspeeds up some later algorithms. \n\nwon't see any speedup for short terms, but I think its easier to work with these simpler automata anyway, and it eliminates\nthe confusion of seeing the redundant states without slowing anything down.\n",
    "hasPatch": true,
    "hasScreenshot": true,
    "id": "LUCENE-3094",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "optimize lev automata construction",
    "systemSpecification": true,
    "version": ""
}