{
    "comments": [
        {
            "author": "Guillaume Blain",
            "body": "Here's waht the PrefixQuery.java should be like modified the revsision 201453 valid as of 20051011, also added hashcode() which I forgot to mention in the previous message",
            "date": "2005-10-12T06:15:37.000+0000",
            "id": 0
        },
        {
            "author": "Erik Hatcher",
            "body": "Thank you for this patch!  I'm in the process of applying it right now.   Your use of the boost factor was nice to see, but points out that we have ignored it in other .equals methods (e.g. WildcardQuery).  If you're interested, we'd accept patches to correct all of the other .equals methods to incorporate the boost factor :)",
            "date": "2005-10-12T21:44:27.000+0000",
            "id": 1
        },
        {
            "author": "Erik Hatcher",
            "body": "Resolved",
            "date": "2005-10-12T21:56:24.000+0000",
            "id": 2
        },
        {
            "author": "Guillaume Blain",
            "body": "I'd just like to say that I simply copied and changed the class casting of the TermQuery's equals and hashcode to the PrefixQuery's internals which suggest they might in fact have a common ancestor class with those two methods (and perharps other Query classes as well). I'm happy to see this promptly resolved, but I wouldn't like to take credit that isn't mine :)",
            "date": "2005-10-13T00:59:51.000+0000",
            "id": 3
        }
    ],
    "component": "",
    "description": "The PrefixQuery is inheriting the java.lang.Object's object default equals method. This makes it hard to have test working of PrefixFilter or any other task requiring equals to work proerply (insertion in Set, etc.). The equal method should be very similar, not to say identical except for class casting, to the equals() of TermQuery. ",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-452",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "PrefixQuery is missing the equals() method",
    "systemSpecification": false,
    "version": "1.9"
}