{
    "comments": [
        {
            "author": "Shai Erera",
            "body": "Adds VERBOSE to LuceneTestCase and LuceneTestCaseJ4, as well as changes TestQualityRun (contrib/benchmark) to use that. I didn't find any other tests which check that property directly.",
            "date": "2010-03-13T08:13:36.620+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "Looks good!\n\n(I did not even know this property, but we can add this VERBOSE check to more tests, too. The first that come to my mind are NumericRange, Highlighter, Spatial)",
            "date": "2010-03-13T08:37:01.538+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "This is great",
            "date": "2010-03-13T10:09:50.842+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 922525\n\nI only changed the protected to public, to enable helper classes outside util to access the setting.",
            "date": "2010-03-13T11:06:01.923+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "As a first test with removed verbosity see revision 922528 (NumericRange tests no longer prints the term statistics per default)",
            "date": "2010-03-13T11:11:21.722+0000",
            "id": 4
        },
        {
            "author": "Shai Erera",
            "body": "bq. I only changed the protected to public, to enable helper classes outside util to access the setting.\n\nMakes sense Uwe - Thanks ! I went for protected to encourage tests to extend either of the two. Helper classes however are different indeed :).",
            "date": "2010-03-13T12:29:58.186+0000",
            "id": 5
        }
    ],
    "component": "",
    "description": "component-build.xml allows to define tests.verbose as a system property when running tests. Both LuceneTestCase and LuceneTestCaseJ4 don't read that property. It will be useful for overriding tests to access one place for this setting (I believe currently some tests do it on their own). Then (as a separate issue) we can move all tests that don't check the parameter to only print if VERBOSE is true.\n\nI will post a patch soon.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2313",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Add VERBOSE to LuceneTestCase and LuceneTestCaseJ4",
    "systemSpecification": true,
    "version": ""
}