{
    "comments": [
        {
            "author": "Paul Elschot",
            "body": "As just discussed on java-dev, the creation of an object during the call to sort could well be due to the creation\nof a new comparator for each call to sort This might be fixed by keeping a single comparator around.\nI wouldn't expect any java library sort to create a copy of its argument, but I'm not sure.\n\nAnyway, when sorting code is going to be inlined here, I'd prefer to have it non quadratic.\n\n",
            "date": "2006-10-23T23:07:17.000+0000",
            "id": 0
        },
        {
            "author": "Yonik Seeley",
            "body": "It occures to me that we shouldn't even need to sort anything!\nStay tuned... I'm coming up with a patch.",
            "date": "2006-10-24T02:46:45.000+0000",
            "id": 1
        },
        {
            "author": "Yonik Seeley",
            "body": "Here's a patch that:\n1) nails things down in the constructor (removes incremental add code)\n2) removes sorting\n3) always skips to the highest docid seen as opposed to \"target\"\n\nIt should be faster in almost all cases, but I'll make a performance test to verify tomorrow.\n\nNotes: the docs[] array could be removed... I started out with it because you can't currently depend on doc() to tell you the position because the javadoc says it's undefined at first (as opposed to -1).  So I switched to using a docs[] array and initialized that to -1, but then learned that calling skipTo() before calling next() doesn't always work.",
            "date": "2006-10-24T05:16:25.000+0000",
            "id": 2
        },
        {
            "author": "Peter Keegan",
            "body": "Yonik,\n\nI tried out your patch, but it causes an exception on some boolean queries.\nThis one occurred on a boolean query with 3 required terms:\n\njava.lang.ArrayIndexOutOfBoundsException: 2147483647\n    at org.apache.lucene.search.TermScorer.score(TermScorer.java:129)\n    at org.apache.lucene.search.ConjunctionScorer.score(\nConjunctionScorer.java:97)\n    at org.apache.lucene.search.BooleanScorer2$2.score(BooleanScorer2.java\n:186)\n    at org.apache.lucene.search.BooleanScorer2.score(BooleanScorer2.java\n:318)\n    at org.apache.lucene.search.BooleanScorer2.score(BooleanScorer2.java\n:282)\n    at org.apache.lucene.search.IndexSearcher.search(IndexSearcher.java:132)\n    at org.apache.lucene.search.Searcher.search(Searcher.java:116)\n    at org.apache.lucene.search.Searcher.search(Searcher.java:95)\n\nIt looks like the doc id has the sentinel value (Integer.MAX_VALUE).\nNote: one of the terms had no occurrences in the index.\n\nPeter\n\n",
            "date": "2006-10-24T14:02:33.000+0000",
            "id": 3
        },
        {
            "author": "Yonik Seeley",
            "body": "Thanks for trying it out Peter.\nOdd it could fail after passing all the Lucene unit tests... I assume this was the lucene trunk you were trying?\nSo the query was just a boolean query with three required term queries?",
            "date": "2006-10-24T14:16:48.000+0000",
            "id": 4
        },
        {
            "author": "Yonik Seeley",
            "body": "Ah, I see the problem... in the constructor I have\n      boolean more = scorers[i].next();\nfor each scorer... but note that the local \"more\" is masking the member \"more\".  Doh!\nYou can just remove \"boolean\" from \"boolean more\" in the ConjunctionScorer constructor, and I'll try to see why this was never reproduced by any test cases in the meantime.",
            "date": "2006-10-24T14:24:25.000+0000",
            "id": 5
        },
        {
            "author": "Yonik Seeley",
            "body": "I'm not sure how it's possible, but my version is *solwer* in the performance test I came up with.\nVery odd... I'm not sure why.",
            "date": "2006-10-24T15:11:52.000+0000",
            "id": 6
        },
        {
            "author": "Yonik Seeley",
            "body": "Here is my current patch and test code (which currently seems to be slower with this patch).",
            "date": "2006-10-24T15:24:16.000+0000",
            "id": 7
        },
        {
            "author": "Peter Keegan",
            "body": "Well, I'm seeing a good 7% increase over the trunk version. Conjunction\nscorer time is mostly in 'skipto' now, which seems reasonable.\n\nDo the test cases try queries with non-existent terms? My failed query\ncontained 3 required terms, but one of the terms was misspelled and didn't\nexist in the index.\n\nPeter\n\n",
            "date": "2006-10-24T16:22:36.000+0000",
            "id": 8
        },
        {
            "author": "Yonik Seeley",
            "body": "> Well, I'm seeing a good 7% increase over the trunk version.\n\nYay!  Now only if I could get my random synthetic tests to show an improvement too...\nWere you testing with -server?  My -client showed a speedup and -server showed a slowdown.\n\nI think the difference is on *which* scorers I'm skipping on, even though I'm always skipping to the highest doc yet seen.  Skipping on denser scorers will be a waste of time, and if the list is sorted one is more likely to be skipping on the sparse scorers.  My code is optimal when the density of the scorers is similar.\n\nThink of the case of two sparse scorers and a dense scorer... you really want to be skipping on the two sparse scorers until they happen to agree.  Until they agree, skipping on the dense scorer is a waste.  My code round robins and throws the dense scorer into the mix.\n\nThe question is, what are the real world usecases like, and what is important to speed up.\nI'd argue that the case of all dense scorers, while more rare, is more important (sparse scorers\nwill cause the queries to be faster anyway).\n\n> Do the test cases try queries with non-existent terms? \n\nThey will.... I was able to reproduce by earlier bug with the new TestScorerPerf.testConjunctions() included in the last patch.\n",
            "date": "2006-10-24T16:38:51.000+0000",
            "id": 9
        },
        {
            "author": "Yonik Seeley",
            "body": "This version removes the docs[] array and seems to be slightly faster.\nStill slower on the synthetic random ConstantScoreQuery tests though.\n\nIf anyone else as real-world benchmarks they can try, I'd appreciate the data.",
            "date": "2006-10-24T17:17:02.000+0000",
            "id": 10
        },
        {
            "author": "Peter Keegan",
            "body": "fwiw, my tests were done using 'real world' queries and index. Most queries\nhave several required clauses. The jvm is 1.6 beta2 with -server. I would be\ninterested to see results from others, too.\n\nthanks Yonik!\n\nPeter\n\n",
            "date": "2006-10-24T17:52:33.000+0000",
            "id": 11
        },
        {
            "author": "Paul Elschot",
            "body": "Yonik,\n\nyou wrote: \n> but then learned that calling skipTo() before calling next() doesn't always work.\n\nCould you describe a case in which skipTo() before next()  does not work?\n\nskipTo() as first call on a scorer should work. ReqExclScorer and ReqOptSumScorer depend on that for the excluded and optional scorers.\n\nRegards,\nPaul Elschot\n",
            "date": "2006-10-24T20:13:52.000+0000",
            "id": 12
        },
        {
            "author": "Yonik Seeley",
            "body": "> Could you describe a case in which skipTo() before next() does not work?\n\nI don't recall, but my attempt to speed up ConjunctionScorer flushed them out.\nI'll move back to an older version of that to see what failed and put\ndetails here: http://issues.apache.org/jira/browse/LUCENE-696",
            "date": "2006-10-24T20:34:33.000+0000",
            "id": 13
        },
        {
            "author": "Yonik Seeley",
            "body": "conjunction.patch.nosort1 is a slightly more elegant solution that does\nnot require any initial setup of the scorers (no calling next() in the constructor).\nIt's one of the fastest yet, but still slower in some cases, and I've figured out why.\n\nWith a conjunction at the top-level only (like my synthetic tests), only next() is called, so the sort is only done once.  The existing next() logic is simpler, and hence faster.  If a conjunction is nested somewhere, skipTo may be called on it, and that's when the current version is much faster since it avoids the sort.\n\nnosort1_time / trunk_time for certain tests (relative perf, lower is better)\ntestConjunctionPerf : 1.22   (slower, only next is called)\ntestNestedConjunctionPerf: 0.35 (much faster, skipTo() is exercized)\ntestConjunctionTerms: 1.00 (only next() called, but term scorer dominates time anyway)\ntestNestedConjunctionTerms: 0.97 (slight improvement, masked by term scorer time)\n\nThis may not be the final version, but I think it's good to have it available anyway.",
            "date": "2006-10-26T03:03:43.000+0000",
            "id": 14
        },
        {
            "author": "Mike Klaas",
            "body": "Paul wrote:\n> As just discussed on java-dev, the creation of an object during the call to sort could well be due to the creation\n> of a new comparator for each call to sort This might be fixed by keeping a single comparator around.\n> I wouldn't expect any java library sort to create a copy of its argument, but I'm not sure.\n\nAccording to http://java.sun.com/j2se/1.5.0/docs/api/java/util/Arrays.html#sort(java.lang.Object[]) , java is using mergesort for this method.  I can't imagine it copying the individual _elements_, but mergesort does require 2N space in general and so some array copying takes place.\n\nUnfortunately, top-level conjunctions are an important case.\n\nPerhaps one way to proceed is to incorporate some of the refactoring improvements (namely, determining all scorers at constructor-time) and do some trivial optimizations to the existing sortScorers method (lift out the ad-hoc Comparator, use insertion sort for N < 5, etc.).  It might be worthwhile to code versions for common cases, like N=2, with a factory to choose among them.",
            "date": "2007-11-07T22:28:40.635+0000",
            "id": 15
        },
        {
            "author": "Yonik Seeley",
            "body": "Whew... I'd forgotten about this issue.  I brushed up one of the last versions I had lying around from a year ago (see lastest conjunction.patch), fixed up my synthetic tests a bit, and got some decent results:\n\n1% faster in top level term conjunctions (wheee)\n49% faster in a conjunction of nested term conjunctions (no sort per call to skipTo)\n5% faster in a top level ConstantScoreQuery conjunction\n144% faster in a conjunction of nested ConstantScoreQuery conjunctions\n\nA sort is done the first time, and the scorers are ordered so that the highest will skip first (the idea being that there may be a little info in the first skip about which scorer is most sparse).\n\nMichael Busch recently brought up a related idea... that one could skip on low df terms first... but that would of course require some terms in the conjunction.",
            "date": "2007-11-21T07:15:29.290+0000",
            "id": 16
        },
        {
            "author": "Mike Klaas",
            "body": "Yonik: this is great!  I applied and tested the patch and everything looks good.\n\nRunning the tests on my system (FC5/java 6.0.01), I got\n\ntestConjunctionPerf: 20% faster\ntestNestedConjunction: 60% faster / 2.5x speed up\ntestConjunctionTerms: 18% faster\ntestNestedConjunction: 50% faster / 2x speed up\n\n(where XX% faster = (difference in times/old time*100))",
            "date": "2007-11-21T23:04:32.640+0000",
            "id": 17
        },
        {
            "author": "Yonik Seeley",
            "body": "Cool, I guess the differences are probably  due to a different processor type (I was using a P4).\n",
            "date": "2007-11-23T17:01:31.899+0000",
            "id": 18
        },
        {
            "author": "Yonik Seeley",
            "body": "committed.",
            "date": "2007-11-23T17:01:53.604+0000",
            "id": 19
        }
    ],
    "component": "core/search",
    "description": "(See also: #LUCENE-443)\nI did some profile testing with the new ConjuctionScorer in 2.1 and discovered a new bottleneck in ConjunctionScorer.sortScorers. The java.utils.Arrays.sort method is cloning the Scorers array on every sort, which is quite expensive on large indexes because of the size of the 'norms' array within, and isn't necessary. \n\nHere is one possible solution:\n\n  private void sortScorers() {\n// squeeze the array down for the sort\n//    if (length != scorers.length) {\n//      Scorer[] temps = new Scorer[length];\n//      System.arraycopy(scorers, 0, temps, 0, length);\n//      scorers = temps;\n//    }\n    insertionSort( scorers,length );\n    // note that this comparator is not consistent with equals!\n//    Arrays.sort(scorers, new Comparator() {         // sort the array\n//        public int compare(Object o1, Object o2) {\n//          return ((Scorer)o1).doc() - ((Scorer)o2).doc();\n//        }\n//      });\n  \n    first = 0;\n    last = length - 1;\n  }\n  private void insertionSort( Scorer[] scores, int len)\n  {\n      for (int i=0; i<len; i++) {\n          for (int j=i; j>0 && scores[j-1].doc() > scores[j].doc();j-- ) {\n              swap (scores, j, j-1);\n          }\n      }\n      return;\n  }\n  private void swap(Object[] x, int a, int b) {\n    Object t = x[a];\n    x[a] = x[b];\n    x[b] = t;\n  }\n \nThe squeezing of the array is no longer needed. \nWe also initialized the Scorers array to 8 (instead of 2) to avoid having to grow the array for common queries, although this probably has less performance impact.\n\nThis change added about 3% to query throughput in my testing.\n\nPeter\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-693",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "ConjunctionScorer - more tuneup",
    "systemSpecification": true,
    "version": "2.1"
}