{
    "comments": [
        {
            "author": "Shai Erera",
            "body": "Good catch Gilad ! Do you intend to prepare a patch?\n\nAlso, we probably shouldn't close the directory in close(), since it was given to us from the outside. So it's whoever created the directory responsibility to close it. We should however eliminate the two deprecated ctors which take a File -- no need to have them around anymore, and we're not bound to back-compat in this module, yet :).",
            "date": "2011-10-04T15:53:43.749+0000",
            "id": 0
        },
        {
            "author": "Gilad Barkai",
            "body": "Thanks for the comment Shai.\n\nThe only Directory that is closed is the one that is NOT given - but rather wrapped around a given File.\nI agree that this constructor should be removed, I did not take care of it just yet...\n\nAttached a patch - Moving closer to IndexReader's ref counting paradigm, also introducing ensureClose().",
            "date": "2011-10-04T15:56:12.756+0000",
            "id": 1
        },
        {
            "author": "Gilad Barkai",
            "body": "Removed deprecated constructors, no private directory to close now.\n\nAlso fixed a small bug from the previous patch.",
            "date": "2011-10-04T16:16:36.712+0000",
            "id": 2
        },
        {
            "author": "Shai Erera",
            "body": "Patch looks good ! Few minor comments:\n\n* I think that it's better to set closed=true in the end of doClose(), after everything succeeds.\n* In doClose, perhaps nullify the two caches? this can come instead of, or in addition to, clear()-ing them\n* doClose is package-private: is that on purpose, or did you mean to make it protected/private? Seems to me like it should be private, because you don't want to call it more than once.",
            "date": "2011-10-04T19:06:26.380+0000",
            "id": 3
        },
        {
            "author": "Shai Erera",
            "body": "I had another look at the patch, and something bothers me about ensureOpen() and how close is set to true. Currently, if I call close(), and another thread has an instance of TR, any operations he'll try to do will fail by ensureOpen().\n\nI think that we should remove 'close' and check on IR.refCount(). When it's <= 0, we're closed for business, otherwise the TR should not be marked close().\n\nI looked at IndexReader and two things:\n# Its ensureOpen checks refCount()\n# Its close looks entirely redundant ...",
            "date": "2011-10-05T04:23:21.902+0000",
            "id": 4
        },
        {
            "author": "Gilad Barkai",
            "body": "Thanks Shai, you are right, 'closed' should only be used inside close().\nAbout your previous comment on nullifying the caches, those are 'final' at the moment and i'm not sure it worthwhile unfinaling them just to be nullified - IIRC there are optimizations that may benefit from final variables, and those caches could be hotspots.\n\nI'll modify the ensureOpen and post a new patch.",
            "date": "2011-10-05T04:40:59.461+0000",
            "id": 5
        },
        {
            "author": "Shai Erera",
            "body": "I'm fine with not null-ing the caches then. It's not a big deal.\n\nAbout close(), we should keep closed so that calling close() multiple times has no side-effects, but we should change ensureReopen().",
            "date": "2011-10-05T09:22:10.301+0000",
            "id": 6
        },
        {
            "author": "Gilad Barkai",
            "body": "New patch as per Shai's comments.",
            "date": "2011-10-05T09:47:46.445+0000",
            "id": 7
        },
        {
            "author": "Shai Erera",
            "body": "I removed some copy-paste errors from the test you added, and moved 'closed=true' to after indexReader.close().\n\nCommitted revision 1179183 (3x).\nCommitted revision 1179194 (trunk).\n\nThanks Gilad !",
            "date": "2011-10-05T12:24:47.383+0000",
            "id": 8
        },
        {
            "author": "Uwe Schindler",
            "body": "Bulk close after release of 3.5",
            "date": "2011-11-27T12:29:29.536+0000",
            "id": 9
        }
    ],
    "component": "modules/facet",
    "description": "TaxonomyReader which supports ref-counting, has a decRef() method which delegates to an inner IndexReader and calls its .decRef(). The latter may close the reader (if the ref is zeroes) but the taxonomy would remain 'open' which will fail many of its method calls.\n\nAlso, the LTR's .close() method does not work in the same manner as IndexReader's - which calls decRef(), and leaves the real closing logic to the decRef(). I believe this should be the right approach for the fix.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3485",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "LuceneTaxonomyReader .decRef() may close the inner IR, renderring the LTR in a limbo.",
    "systemSpecification": true,
    "version": "3.4"
}