{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "A first version, some tests may use old API, which therefore not compile.\n\nThis is a very tricky pert, because you can do lots of errors. Things from 2.9 which were not 100% correct:\n- CompoundFileReader.list() was there (deprec), but no listAll(). Renamed function. Does listAll/list difference has any effect in CFR?\n- There was one class to list() in SegmentInfos, replaced by listAll()\n\nThis patch also makes FSDir abstract and removes all deprecated methods and also the hell of reflection and the system properties.\n\nPatch still needs fine-tuning and test adaption.",
            "date": "2009-10-03T10:15:33.138+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Does listAll/list difference has any effect in CFR?\n\nThis should be fine; we don't normally put non-index files into a CFS.",
            "date": "2009-10-03T10:22:44.680+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Updated patch, works with current trunk and backwards branch (after tag was added, not yet done). The previous poatch had some errors because of init() methods and previous closeDir parameter (wrong method was called in some cases)\n\nContrib tests not yet functional, but test-core works.",
            "date": "2009-10-03T18:13:09.473+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Here are the fixes for contrib to not use the deprecated IndexReader/IndexWriter/FSDir/IndexSearcher methods/ctors.\n\nNow this issue is ready for the final commit.\n\nIt would be good, if somebody other would again look over the original patch.",
            "date": "2009-10-03T22:48:26.537+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "I think, I have to commit this now. The current tests in trunk do not compile, as there is now a problem with abstract methods in the MockFSDirectory and FaultyFSDirectory (I was too fast in modifying them and tested only with my changes from this patch).",
            "date": "2009-10-03T23:20:46.170+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 821446\n\nIf there are any problems caused by this, let me know!",
            "date": "2009-10-03T23:29:51.432+0000",
            "id": 5
        }
    ],
    "component": "core/index, core/search, core/store",
    "description": "This patch removes primarily the deprecated Directory stuff. This also removes parts of the ctor/open hell in IR and IW. IndexModifier is completely removed as deprecated, too.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1944",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Remove deprecated Directory stuff and IR/IW open/ctor hell",
    "systemSpecification": true,
    "version": "2.9"
}