{
    "comments": [
        {
            "author": "Hoss Man",
            "body": "If a user costructs a Query instance that rewrites to a BooleanQuery we have to assume they wanted the scoring factors to come into play -- implicitly falling back to a ConstantScoreQuery implentation is not a good idea -- the user can choose to do that themselves if they catch a TooManyClauses.",
            "date": "2006-05-28T02:25:55.000+0000",
            "id": 0
        },
        {
            "author": "Eric Jain",
            "body": "If you want to be able to \"rescue\" the query, I believe the catching has to be done in the rewrite method, which means you need to subclass the PrefixQuery and WildcardQuery classes... I wonder how many people would be disappointed if Lucene returned a less well scored list of results rather than failing, and how many developers actually get around to implement this kind of fallback strategy?\n",
            "date": "2006-05-28T04:10:18.000+0000",
            "id": 1
        },
        {
            "author": "Yonik Seeley",
            "body": "Any fallback strategy should attempt to score the same way.  If it doesn't it's brittle and will lead to surprises (e.g. when I add one more document to my index, I don't want scoring to radically change).\n\nI did some work in the direction of using a scorer with a byte per document to keep track of scores:\nhttp://www.mail-archive.com/java-dev@lucene.apache.org/msg03178.html\n\nA variation of norms 8 bit float is already checked into lucene... see lucene.util.SmallFloat.",
            "date": "2006-05-28T04:29:25.000+0000",
            "id": 2
        },
        {
            "author": "Mark Miller",
            "body": "Debating Fixed or Won't Fixed - won't fix because we won't fall back, but fixed because if you use constantscore mode you won't get a too many clauses exception anymore. Fixed it is I guess.",
            "date": "2008-11-13T00:04:45.377+0000",
            "id": 3
        }
    ],
    "component": "core/search",
    "description": "I wonder if it would make sense to fall back to a ConstantScoreQuery instead of throwing a TooManyClauses exception?",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-582",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Don't throw TooManyClauses exception",
    "systemSpecification": true,
    "version": "2.0.0"
}