{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Thanks Simon, I just committed this!  I added a deprecated note to CharacterCache to remind us to move to the 1.5 APIs, and replaced the <= 127 with < cache.length.",
            "date": "2009-06-30T10:51:45.478+0000",
            "id": 0
        },
        {
            "author": "Simon Willnauer",
            "body": "Michael, I wonder why hudson does still not catch this. Who is the hudson admin? We should change the JVM to a 1.4 VM on hudson if possible. If we need to send a request to infrastructure I could do so.\n\nsimon",
            "date": "2009-06-30T11:37:44.431+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "The problem is, some contribs must be build with 1.5. So you need to use at least 1.5 for the whole build. The core and anaylsis javac are parametrized with -source and -target to 1.4 which generates 1.4 java classes out of only 1.4 compatible source code.\n\nThe problem here is, that the java compiler has no possibility to check if a *method/class* is available in 1.4, as it only knows his own rt.jar (normally it could e.g. use the @since javadoc tag, but this is not includedin the rt.jar and an annotation is not available). This is a well known problem to all java developers.",
            "date": "2009-06-30T11:44:13.216+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "A possible solution would be LUCENE-718.",
            "date": "2009-06-30T11:48:25.103+0000",
            "id": 3
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. A possible solution would be LUCENE-718. \nEither this way (I use setting boot classpath all the time for different rt.jar) or we split the build procedure into two steps. Frist step: build core with 1.4 JDK Second Step: build contrib with 1.5 JDK. That way we need two hudson \"Jobs\" with dependencies to each other. I guess hudson lets you define this quite flexible. \n\nsimon",
            "date": "2009-06-30T11:54:20.636+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. Second Step: build contrib with 1.5 JDK\n\nOnly those with 1.5, all other contribs  together with core. So add something -Djavac.target to ant, that specifies what to compile and test. If it is 1.4, all 1.5 contribs are left out.\n\nIn my opinion, this is too late to change. After 2.9 will come 3.0 with Java 1.5 support. As noted in the mailing lists before, I would suggest, that the release process should simply include a test-compilation with 1.4 (I think it is noted in the Wiki, that this must be done before packaging the artifacts).",
            "date": "2009-06-30T12:00:44.200+0000",
            "id": 5
        }
    ],
    "component": "modules/analysis",
    "description": "I found compile errors when I tried to compile trunk with 1.4 JVM.\norg.apache.lucene.analysis.NormalizeCharMap\norg.apache.lucene.analysis.MappingCharFilter\n\nuses Character.valueOf() which has been added in 1.5.\nI added a CharacterCache (+ testcase) with a valueOf method as a replacement for that quite useful method.\n\norg.apache.lucene.analysis.BaseTokenTestCase\n\nuses StringBuilder instead of the synchronized version StringBuffer (available in 1.4)\n\nI will attach a patch shortly.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1724",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Analysis package calls Java 1.5 API",
    "systemSpecification": true,
    "version": ""
}