{
    "comments": [
        {
            "author": "Grant Ingersoll",
            "body": "Attached is a new file FileDocument that lives under the Test structure, and changes to the appropriate Tests (TestDoc and IndexTest) that use this class.",
            "date": "2006-01-11T07:11:50.000+0000",
            "id": 0
        },
        {
            "author": "Doug Cutting",
            "body": "Why should we replicate this file in the t est tree?  I don't see the need to make unit tests independent of the demo code.  Why do you remove the demo code?",
            "date": "2006-01-11T07:34:05.000+0000",
            "id": 1
        },
        {
            "author": "Grant Ingersoll",
            "body": "I am not happy with the replication thing, but if you can't build something in the main source tree without having the \"demo\" code then that just doesn't feel right.  What happens when someone changes the demo?  Now we have to keep this demo code exactly the same lest we also want to update the dependencies in the main source as well.  I suppose it isn't a big deal since it is only one file, but it just seems like an unnecessary dependency.  Ideally, the FileDocument would live in some common place, but I am not sure where that would be.\n\nI don't include the demo source under my source tree in intellij, so it always complains at me (I hate those red squiggly marks),  but I suppose I can get over it for this one file.",
            "date": "2006-01-11T08:40:36.000+0000",
            "id": 2
        },
        {
            "author": "Erik Hatcher",
            "body": "I concur with Grant on this - the dependency from test to demo has caused me annoyance as well.   I'm in favor of a fix to it, but haven't looked at Grant's solution yet.",
            "date": "2006-01-11T20:34:36.000+0000",
            "id": 3
        },
        {
            "author": "Doug Cutting",
            "body": "Grant, the test code is not in the \"main\" source tree, it's in the \"test\" source tree, which depends on \"core\" and \"demo\".  I still don't see what harm that dependency causes, aesthetically or otherwise.  Perhaps such dependencies are awkward in intellij?  Is that the issue?",
            "date": "2006-01-12T02:46:34.000+0000",
            "id": 4
        },
        {
            "author": "Grant Ingersoll",
            "body": "Doug,\n\nThe intellij thing is just a symptom.  I think the bigger issues are the consequences of the demo being changed and that it just doesn't feel right.  \n  \nIn my mind, the Test code is for testing the core, not the demo.  The demo, in my mind is a sample application using the core and has nothing to do with testing the core.  To me the demo feels more akin to the contrib area then the core area and I think you would agree that the core tests should not be depend on anything in contrib, right?\n\nAt any rate, I am not trying to create an aesthetics war here, so at this point I will leave it to the committers to decide.\n",
            "date": "2006-01-12T03:49:29.000+0000",
            "id": 5
        },
        {
            "author": "Doug Cutting",
            "body": "The more stuff that's regularly compiled & tested, the better.  We don't want the demo or contrib code to become neglected.  Removing dependencies from the core is important.  But I don't see that as a priority for test code.\n\nMy primary objection to making tests dependent on contrib would be that it might substantially slow the compile & test loop, to the degree that folks would run tests less frequently.  The demo is small enough that I don't think this is a concern.\n",
            "date": "2006-01-12T04:05:52.000+0000",
            "id": 6
        },
        {
            "author": "Grant Ingersoll",
            "body": ">The more stuff that's regularly compiled & tested, the better. \n\nCouldn't agree more.\n\n>We don't want the demo or contrib code to become neglected. Removing dependencies from the \n>core is important. But I don't see that as a priority for test code. \n\nHence, me giving this bug a priority of Minor\n\n",
            "date": "2006-01-12T04:48:52.000+0000",
            "id": 7
        },
        {
            "author": "Michael Busch",
            "body": "I still think we should remove the dependency that test has on demo. Looking into the code you can replace the call of FileDocument in TestDoc with just 2 lines:\n{code}\nDocument doc = new Document();\ndoc.add(new Field(\"contents\", new FileReader(file)));\n{code}\n\nWith this change alone we could remove the dependency. I think we should do that because it makes the build cleaner and I don't think we'll pay less attention to the demo code in the future just because we remove this classpath dependency. Any objections? Otherwise I'll reopen this issue and attach a patch.",
            "date": "2009-09-23T12:26:12.329+0000",
            "id": 8
        },
        {
            "author": "Grant Ingersoll",
            "body": "+1",
            "date": "2009-09-23T12:35:16.306+0000",
            "id": 9
        },
        {
            "author": "Michael Busch",
            "body": "Will have to commit the change in TestDoc also to the compatibility tests branch.",
            "date": "2009-10-06T00:04:31.529+0000",
            "id": 10
        },
        {
            "author": "Michael Busch",
            "body": "Committed revision 822139.",
            "date": "2009-10-06T06:07:06.267+0000",
            "id": 11
        }
    ],
    "component": "general/build",
    "description": "The TestDoc.java Test file has a dependency on the Demo FileDocument code.  Some of us don't keep the Demo code around after downloading, so this breaks the build.\n\nPatch will be along shortly",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-486",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Trivial",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Core Test should not have dependencies on the Demo code",
    "systemSpecification": true,
    "version": "1.4"
}