{
    "comments": [
        {
            "author": "Chris Male",
            "body": "I'm not sure what the better alternative is, but +1 to removing this class.",
            "date": "2011-09-24T15:28:13.759+0000",
            "id": 0
        },
        {
            "author": "Simon Willnauer",
            "body": "+1",
            "date": "2011-09-24T18:25:57.750+0000",
            "id": 1
        },
        {
            "author": "Chris Male",
            "body": "Hey Robert,\n\nAre you putting something together on this, or should I give it a shot?",
            "date": "2011-09-25T03:11:17.322+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "please take it! it was just an idea after some discussion with Andrzej, who was experimenting in Luke (I think if you are not careful its easy to get norms with your indexdocvaluesfield?)\n\nalso I noticed in the tests that the added dv fields were hitting up Similarity... \n\nI have no ideas on naming or api, maybe UNINVERTED?",
            "date": "2011-09-25T03:20:41.266+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "+1\n\nAnother spookiness I noticed but didn't yet make a test for to confirm: if you try to add a Document that has the same field w/ docValues twice, you get a scary non-obvious exception.",
            "date": "2011-09-25T10:43:23.657+0000",
            "id": 4
        },
        {
            "author": "Chris Male",
            "body": "I find it a little unclear how we want users to use DocValues during indexing.  \n\nDo we want people to mark any Field as also being DocValues? In which case it becomes as Robert said, an attribute of a field and kind of an indexing strategy.  Or we do see DocValues fields being more standalone? in which case IndexDocValuesField probably makes sense, just like we have NumericField.",
            "date": "2011-09-25T11:11:31.446+0000",
            "id": 5
        },
        {
            "author": "Chris Male",
            "body": "Okay so a battle plan:\n\nDocValues is basically an attribute of a Field and is a way of processing that Field's value.  So to remove the need for IndexDocValues, lets:\n\n- Move ValueType to FieldType.  FieldType is the appropriate place for that kind of metadata.  This forces the user to define the ValueType of their DocValues when they initialize the FT.\n- Remove PerFieldDocValues docValues() from Field as its implicit when you consider the ValueType in combination with the actual value.\n- Change DocValuesConsumer to consume an IndexableField.  It'll be responsible for then creating the PerFieldDocValues by looking at the ValueType.\n\nWhen we get round to introducing StorableField/Type, the DocValues ValueType will go over to StorableFieldType, more closely aligning DocValues and traditional value storing.",
            "date": "2011-09-25T13:30:37.648+0000",
            "id": 6
        },
        {
            "author": "Michael McCandless",
            "body": "That sounds great!\n\nThis makes our expert APIs (direct Field/FieldType construction) much\ncleaner for creating a index doc values field.\n\nAfter this we can separately take up what sugar classes/methods we can\nadd to make it easy for non-expert users to create doc values.  Maybe\nstatic methods like NumericField.newIntValueField(17) and\nBinaryField.newFixedValueField(bytes) for example...\n\nI'll open a new issue about accidentally adding same DV field twice...",
            "date": "2011-09-25T13:37:52.046+0000",
            "id": 7
        },
        {
            "author": "Michael McCandless",
            "body": "I opened LUCENE-3461 for catching accidental multi-valued DV fields.",
            "date": "2011-09-25T14:04:46.849+0000",
            "id": 8
        },
        {
            "author": "Simon Willnauer",
            "body": "hey chris what is the status here?",
            "date": "2011-11-14T10:28:13.232+0000",
            "id": 9
        },
        {
            "author": "Michael McCandless",
            "body": "I'm taking a stab at this one... here's an initial rough patch\n(tons of nocommits!).  I moved docValueType from IndexableField to\nIndexableFieldType, simplified DocValuesField somewhat and cleaned up\na few things... I'll make a branch so we can iterate there.\n",
            "date": "2012-01-11T16:42:53.557+0000",
            "id": 10
        },
        {
            "author": "Michael McCandless",
            "body": "Applyable patch; I still need to go through it more closely but I\nthink it's basically ready.  I'd like to commit it soon... it's a big\npatch so it's going to quickly get stale/conflict.  We can further\niterate on trunk...\n\nI ended up keeping (but simplifying) DocValuesField, as sugar, and\nmaking a number of other simplifications:\n\n  * Removed custom Comparator from DocValuesField, meaning sort is\n    always by unsigned byte (UTF8/unicode) order now.\n\n  * Moved numeric field type information out of IndexableField into\n    FieldType.\n\n  * LUCENE-3682: added in \"transition layer\" to construct Field using\n    the pre-4.0 enums (Store, Index, TermVector)\n\n  * LUCENE-3694: moved all setXXX methods in NumericField and\n    DocValuesField up into Field.java (as setValue methods)\n\n  * Renamed/generalized BinaryField to StoredField, so that you can\n    use it to store any value, including numerics.  I generalized the\n    codecs so they mark a stored field as numeric if its\n    .numericValue() is non-null, and at document load time they now\n    always create a StoredField instance.  This also means you have to\n    call .numericValue (not .stringValue()) on the returned\n    StoredField, after indexing a NumericField.\n\n  * LUCENE-3616: fail if you try to create a TokenStream field that's\n    stored.\n\n  * Added numerics to Field ctor/setValue/numericValue; this is used\n    by DocValuesField, NumericField, StoredField\n\n  * You can still reuse a Field (change its value), however I madte\n    this more strict: you can only change the value to another value\n    of the same type.\n",
            "date": "2012-01-13T23:24:45.886+0000",
            "id": 11
        },
        {
            "author": "Chris Male",
            "body": "{quote}\nLUCENE-3694: moved all setXXX methods in NumericField and\nDocValuesField up into Field.java (as setValue methods)\n{quote}\n\nI like this idea, but I wonder if it could be a source of confusion.  People who are indexing numerical content need to use NumericField or DocValuesField ideally.  Having it appear as though they can use Field and get the same indexing behavior as from NumericField could lead to bugs, right?\n\n{quote}\nRenamed/generalized BinaryField to StoredField, so that you can\nuse it to store any value, including numerics. I generalized the\ncodecs so they mark a stored field as numeric if its\n.numericValue() is non-null, and at document load time they now\nalways create a StoredField instance. This also means you have to\ncall .numericValue (not .stringValue()) on the returned\nStoredField, after indexing a NumericField.\n{quote}\n\nPretty cool idea I have to say.  Somewhere during all these discussion we talked about allowing bytes to be indexed, I guess when/if we ever get to that, we'll need to re-create a BinaryField?\n\n{quote}\nYou can still reuse a Field (change its value), however I madte\nthis more strict: you can only change the value to another value\nof the same type.\n{quote}\n\nGood idea.  Could we make this cleaner by having a more general DataType enum?  Each constructor with its typed parameter could then set the DataType.  In each of the setXXX methods we can just check if the DataType is appropriate, rather than using instanceof/isBinary() etc.   This could be internal to Field at the moment but could prove useful down the line.",
            "date": "2012-01-14T00:26:46.188+0000",
            "id": 12
        },
        {
            "author": "Michael McCandless",
            "body": "{quote}\nbq. LUCENE-3694: moved all setXXX methods in NumericField and DocValuesField up into Field.java (as setValue methods)\n\nI like this idea, but I wonder if it could be a source of confusion. People who are indexing numerical content need to use NumericField or DocValuesField ideally. Having it appear as though they can use Field and get the same indexing behavior as from NumericField could lead to bugs, right?\n{quote}\n\nIn fact you can simply use Field directly to index a numeric field or\na doc values field, ie, DocValuesField/NumericField are truly just\nsugar now.  You can do everything with Field (expert) that you can do\nwith these sugar classes... or at least I think so :)\n\nbq. Pretty cool idea I have to say. Somewhere during all these discussion we talked about allowing bytes to be indexed, I guess when/if we ever get to that, we'll need to re-create a BinaryField?\n\nYeah I think we'd address that if/when we somehow allow indexing of\nbyte[] valued fields... even so, expert apps could code directly to\nIF/IFT (or even subclass Field possibly) if they have some way to\n\"index\" byte[] content...\n\n{quote}\nbq. You can still reuse a Field (change its value), however I madte  this more strict: you can only change the value to another value of the same type.\n\nGood idea. Could we make this cleaner by having a more general DataType enum? Each constructor with its typed parameter could then set the DataType. In each of the setXXX methods we can just check if the DataType is appropriate, rather than using instanceof/isBinary() etc. This could be internal to Field at the moment but could prove useful down the line.\n{quote}\n\nWe could explore that (making Field's fieldData more strongly typed),\ninstead of dynamically checking types.  Field has been dynamically\ntyped forever...\n\nBut I think we can/should do that after committing this first cleanup?\nI suspect that could be a major change just by itself...\n\nThis would clean up tokenStream creation too -- instead of probing\ndynamically for string/reader/pre-tokenized we'd switch on the type.\n",
            "date": "2012-01-14T11:52:42.743+0000",
            "id": 13
        },
        {
            "author": "Chris Male",
            "body": "{quote}\nIn fact you can simply use Field directly to index a numeric field or\na doc values field, ie, DocValuesField/NumericField are truly just\nsugar now. You can do everything with Field (expert) that you can do\nwith these sugar classes... or at least I think so \n{quote}\n\nWow, I hadn't explored the patch deeply enough.  Big +1 to this!\n\n{quote}\nBut I think we can/should do that after committing this first cleanup?\nI suspect that could be a major change just by itself...\n{quote}\n\nYeah definitely, the more I've thought about it the more impact it could have.  Definitely worth another issue.",
            "date": "2012-01-14T12:00:06.929+0000",
            "id": 14
        }
    ],
    "component": "",
    "description": "Its confusing how we present CSF functionality to the user, its actually not a \"field\" but an \"attribute\" of a field like  STORED or INDEXED.\n\nOtherwise, its really hard to think about CSF because there is a mismatch between the APIs and the index format.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3453",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "remove IndexDocValuesField",
    "systemSpecification": true,
    "version": "4.0-ALPHA"
}