{
    "comments": [
        {
            "author": "Mark Miller",
            "body": "Chris Male mentioned to me that he thinks Uwe has fixed this?",
            "date": "2010-03-21T15:08:23.599+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "This is fixed!\n\nBut some of the threads use a \"own\" exception handler calling ex.printStackTrace(), and so those bugs are not detected. But all asserts in foreign threads are fine now!",
            "date": "2010-03-21T15:18:58.074+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. so unless a failure is caused later from the thread termination, the Asserts are invalid\n\nThis is one small problem: The exceptions from external threads are collected on tearDown(). So the assert message is only printed and the test failing in tearDown(). So this does not prevent failures in the main thread before the failures in other thread's assert statements are detected. But one is sure: The failures are detected and the test is failing.",
            "date": "2010-03-21T15:21:55.287+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Duplicate of LUCENE-2274.",
            "date": "2010-03-21T16:03:43.790+0000",
            "id": 3
        }
    ],
    "component": "",
    "description": "There are a few cases in Lucene tests where JUnit Asserts are used inside a new threads run method - this won't work because Junit throws an exception when a call to Assert fails - that will kill the thread, but the exception will not propagate to JUnit - so unless a failure is caused later from the thread termination, the Asserts are invalid.\n\nTestThreadSafe\nTestStressIndexing2\nTestStringIntern",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-1814",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Some Lucene tests try and use a Junit Assert in new threads",
    "systemSpecification": true,
    "version": ""
}