{
    "comments": [
        {
            "author": "Samphan Raruenrom",
            "body": "ThaiAnalyzer which simply return a TokenFilter chain with ThaiWordFilter in the middle",
            "date": "2006-04-12T12:18:12.000+0000",
            "id": 0
        },
        {
            "author": "Samphan Raruenrom",
            "body": "ThaiWordFilter which use java.text.BreakIterator to break Thai words into tokens",
            "date": "2006-04-12T12:19:47.000+0000",
            "id": 1
        },
        {
            "author": "Samphan Raruenrom",
            "body": "I've changed the code to use java.text.BreakIterator instead of ICU4j to remove the dependency on ICU4j. The ThaiAnayzer is tested intensively by several groups of developers in at least two production systems (by To-Be-One Technology, who support the development) so it is quite stable. The code is rather small cause I try to make it as efficient and easy to read as possible. It's tested in Lucece 1.4 and lately in Lucene 1.9.1.",
            "date": "2006-04-12T13:15:14.000+0000",
            "id": 2
        },
        {
            "author": "Daniel Naber",
            "body": "Thanks for your contribution. We're currently preparing Lucene 2.0 and as feature updates are only planned for the release after 2.0 it will take some more time to integrate this. \n\nTwo remarks:\n\n-It uses the english stop words, does that make sense?\n-Could you write some test cases, similar maybe to those for the French analyzer?\n",
            "date": "2006-04-29T16:50:56.000+0000",
            "id": 3
        },
        {
            "author": "Samphan Raruenrom",
            "body": "> -It uses the english stop words, does that make sense?\n\nYes. Thai usually mix English words in Thai text here and there. So English stop words should apply but this is arguable. I'll consull with the developer community.\n\n> -Could you write some test cases, similar maybe to those for the French analyzer? \n\nOK. I'm thinking of writing them.",
            "date": "2006-05-01T10:48:17.000+0000",
            "id": 4
        },
        {
            "author": "Arthit Suriyawongkul",
            "body": "related projects/implementations:\n\n\nSansarnLook\nbased on Lucene, with additional ThaiAnalyzer\n  ref: http://sansarn.com/look/technique/ \n  file: http://sansarn.com/look/download/\n\n\nPichai Ongvasith's ThaiAnalyzer\n  ref: http://mail-archives.apache.org/mod_mbox/lucene-java-dev/200402.mbox/%3C20040218004604.61360.qmail@web41501.mail.yahoo.com%3E\n  file: http://pichai.netfirms.com/thai_analyzer.zip\n",
            "date": "2006-05-29T16:38:46.000+0000",
            "id": 5
        },
        {
            "author": "Samphan Raruenrom",
            "body": "Add TestThaiAnalyzer junit test, modified from TestFrenchAnalyzer. The Thai words are picked so that changing the dictionary (or algorithm in JDK) should not affect the test.",
            "date": "2006-05-30T11:36:28.000+0000",
            "id": 6
        },
        {
            "author": "Samphan Raruenrom",
            "body": "All the code have been tested with Lucene 2.0.0.\nThanks Art for the info/URL. I've never known about Pichai's work before I started this project. However I heard about NECTEC's SansarnLook when I visit them and talk about my ThaiAnalyzer. My goal for this job is for the code to be included in Lucene for Thai to work out-of-the-box. So no more wheel reinventing.",
            "date": "2006-05-30T11:50:40.000+0000",
            "id": 7
        },
        {
            "author": "Hoss Man",
            "body": "I don't know anything about the Thai language ... but this code is clean, fairly easy to follow, and has tests that pass.\n\nIf no one (who knows something about Thai) sees anything wrong with this implimentation and objects i'll commit it sometime this weekend.\n\n",
            "date": "2006-06-03T08:01:13.000+0000",
            "id": 8
        },
        {
            "author": "Hoss Man",
            "body": "commited",
            "date": "2006-06-06T00:28:41.000+0000",
            "id": 9
        }
    ],
    "component": "modules/analysis",
    "description": "Thai text don't have space between words. Usually, a dictionary-based algorithm is used to break string into words. For Lucene to be usable for Thai, an Analyzer that know how to break Thai words is needed.\n\nI've implemented such Analyzer, ThaiAnalyzer, using ICU4j DictionaryBasedBreakIterator for word breaking. I'll upload the code later.\n\nI'm normally a C++ programmer and very new to Java. Please review the code for any problem. One possible problem is that it requires ICU4j. I don't know whether this is OK.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-503",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Contrib: ThaiAnalyzer to enable Thai full-text search in Lucene",
    "systemSpecification": false,
    "version": "1.4"
}