{
    "comments": [
        {
            "author": "Shai Erera",
            "body": "I didn't find a way to check if an Ant directory is empty, and even if there is a way, the extract process can still fail in the middle. So maybe an alternative solution is to extract the files in ExtractReuters to a tmp directory first, and rename it if everything succeeds. Also, always delete the target dir at startup. That way, if extraction fails, the directory doesn't exist, and if it does exist, we know it's ok (unless manually tempered, but that's not for us to solve).\n\nWhat do you think?",
            "date": "2011-01-26T04:52:26.535+0000",
            "id": 0
        },
        {
            "author": "Doron Cohen",
            "body": "Seems ok to me.\n\nbq. .. ExtractReuters to a tmp directory first, and rename it if everything succeeds. Also, always delete the *target* dir at startup\n\nshould be \"always delete the *tmp* dir at start\" ?",
            "date": "2011-01-26T07:04:05.883+0000",
            "id": 1
        },
        {
            "author": "Shai Erera",
            "body": "yes you're right :). If the target exists, the code should fail - we're not supposed to call it from Ant anyway, and so if it's indeed called, it may discover a bug in the build.xml, and if it's called by a standalone program, I think it'd be better to fail so as to indicate the caller that the dir exists - maybe he'll want to delete and re-create it.",
            "date": "2011-01-26T08:12:24.338+0000",
            "id": 2
        },
        {
            "author": "Shai Erera",
            "body": "Since ExtractReuters deletes all the files under the outputDir in its ctor, I didn't fail its main() if the directory exists. I've done some re-formatting to the class, but the relevant changes are under main().\n\nCommitted revision 1063640 (3x).\nCommitted revision 1063647 (trunk).\n\nThanks Doron and Grant !",
            "date": "2011-01-26T09:11:39.365+0000",
            "id": 3
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:49:59.524+0000",
            "id": 4
        },
        {
            "author": "Grant Ingersoll",
            "body": "Note, this fix this doesn't work if the output dir has a trailing slash.  See MAHOUT-694.",
            "date": "2011-05-20T15:43:52.284+0000",
            "id": 5
        },
        {
            "author": "Doron Cohen",
            "body": "bq. Note, this fix this doesn't work if the output dir has a trailing slash\n\nI think this is a separate issue - I mean not handling a trailing slash. \nCreated LUCENE-3137 for handling this.",
            "date": "2011-05-24T10:59:10.014+0000",
            "id": 6
        },
        {
            "author": "Doron Cohen",
            "body": "There's now a simple patch for this in LUCENE-3137. \nI think this one can be closed?",
            "date": "2011-05-24T11:02:02.910+0000",
            "id": 7
        },
        {
            "author": "Grant Ingersoll",
            "body": "Doron, that's fine to open a new issue and close this one, but it was this issue's fix that introduced the bug.",
            "date": "2011-05-24T13:02:26.103+0000",
            "id": 8
        },
        {
            "author": "Doron Cohen",
            "body": "bq. Doron, that's fine to open a new issue and close this one, but it was this issue's fix that introduced the bug.\n\nThanks for clarifying!\nOkay, so I will fix this in LUCENE-3137 (it makes sense to me at this time since this one was resolved 4 months ago and fixed something else) and resolve this one.",
            "date": "2011-05-25T08:22:36.966+0000",
            "id": 9
        },
        {
            "author": "Uwe Schindler",
            "body": "Bulk close after release of 3.1",
            "date": "2011-11-27T12:34:00.652+0000",
            "id": 10
        }
    ],
    "component": "modules/benchmark",
    "description": "The contrib/benchmark build does not properly handle checking to see if the content (such as Reuters coll.) is properly extracted.  It only checks to see if the directory exists.  Thus, it is possible that the directory gets created and the extraction fails.  Then, the next time it is run, it skips the extraction part and tries to continue on running the benchmark.\n\nThe workaround is to manually delete the extraction directory.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-929",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "contrib/benchmark build doesn't handle checking if content is properly extracted",
    "systemSpecification": true,
    "version": ""
}