{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "prototype patch that adds 'DirectSpellChecker', with some tests showing use with IndexWriter.getReader()\n\nFor now I only implemented Levenshtein, since its for free :) But it would be good to support re-ranking against the existing StringDistance metrics, etc.\n\nThe larger problem is that the existing APIs are really built around this idea of a separate index, so I'm open to suggestions as to how this can be better integrated.\n\n",
            "date": "2010-06-22T03:01:06.009+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "there was a bug in conversion between fuzzy term enum's scaling.\n\ni ran some simple perf tests, this is essentially just as fast as the existing code\nwith setMaxEdits(1). but with setMaxEdits(2) is much slower.\n\ni'll try to think of ways to speed it up... one idea would be to add lev automata with transposition\nsupport instead of using higher distances, etc.\n",
            "date": "2010-06-22T06:10:23.677+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "we have sped up this seeking a lot recently, and i improved this patch some:\n* avoid calling docfreq on the suggestions, by using the TermsEnum's docfreq\n* Mike had the idea that we should actually try lower edit distances first. The \n  general use case here is a small number of suggestions (e.g. 1), so \n  we actually try edit distance=1 first... only if this doesn't give enough suggestions \n  do we then try higher distances. \n\nI think this is a good approach here, because we are getting levenshtein directly, \nso we don't have the problem the n-gram based spellchecker has... (for reference below)\n\n{noformat}\n   * <p>As the Lucene similarity that is used to fetch the most relevant n-grammed terms\n   * is not the same as the edit distance strategy used to calculate the best\n   * matching spell-checked word from the hits that Lucene found, one usually has\n   * to retrieve a couple of numSug's in order to get the true best match.\n   *\n   * <p>I.e. if numSug == 1, don't count on that suggestion being the best one.\n   * Thus, you should set this value to <b>at least</b> 5 for a good suggestion.\n{noformat}\n\nSince we are actually doing levenshtein, you can safely use lower values for numSug,\nsuch as numSug=1\n",
            "date": "2010-09-28T17:44:18.881+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "I improved the quality and performance of this spellchecker, integrated it with the other spellchecker APIs,\nand did the Solr side. I think minus some more tests and docs (especially on the various options) its good to go.\n",
            "date": "2010-09-30T20:52:35.469+0000",
            "id": 3
        },
        {
            "author": "Chris Male",
            "body": "Hey Robert,\n\nDo you have any benchmarks for this spellchecker? I notice you mention a few times that you improved the performance.  Do you know how it compares against the separate index approach? \n\nEqually, is this spellchecker a conceptual drop in replacement? By that I mean, are the suggestions it generates radically different to the separate index spellcheckers or are they along the same lines?",
            "date": "2010-10-01T01:24:02.584+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "bq. Do you have any benchmarks for this spellchecker? I notice you mention a few times that you improved the performance. Do you know how it compares against the separate index approach?\n\nIn general I think the performance is fine. I did a lot of testing against the geonames database (> 2 million unique terms).\nBut, it completely depends upon the parameters you set. Here are some that can affect performance and quality:\n* avoid doing work if the query term is already spelled correctly:\n** minQueryLength (example: 4), query words of 3 characters or less are not checked. \nIn general, with any metric, the candidates here will mostly be nonsense anyway.\n** maxQueryFrequency (example: 1% or 1):  if the query word is high frequency (e.g. appears in more \nthan 1% of the documents its assumed to be correct, and no suggestions are given.\nYou can also set this to something like 1, if say you have a small product database \nand you feel all your products are spelled completely correct in your index, and you \ndon't want to *ever* suggest anything if the query term is in your products database.\n* avoid doing work examining potentially bad suggestions:\n** maxEdits (example: 1), the majority of misspellings are only 1 distance away. \nSo if you lower this from the default \"2\" to 1, its faster and more \"lightweight\" in the sense you get less a chance of getting a bad suggestion.\n** minPrefix (example: 1), most misspellings don't occur in the first character. \nFor the solr example, i set this to zero (the wiki has an example correcting \"hell\" with \"dell\"), but in practice I think 1 is a good value. \nAdditionally this has a practical use for solr users: you need a rather \"raw\" (e.g. not stemmed) analyzed field for spellchecking,\nif you set this to 1 you can re-use your reverse-wildcard field for spellchecking too, and it will never suggest reversed terms.\n** thresholdFrequency (example: 1% or 1): this plays the role of Solr's \"HighFrequencyDictionary\". \nIn other words, you could set this to 1 to never suggest words that only appear in a single document... in many cases these are misspellings.\n** maxInspections (example: 5), the existing spellchecker uses a hardcoded 10 here. \nA lower value can work well here, since the algorithm used to draw candidates is actually levenshtein. \nHowever, I set the default to 5 (instead of 1), because its good to gather a few candidates for docFreq-sorting.... \nbut if you increase thresholdFrequency you can probably lower this.\n\nbq. Equally, is this spellchecker a conceptual drop in replacement? By that I mean, are the suggestions it generates radically different to the separate index spellcheckers or are they along the same lines?\n\nI think they are better, e.g. if you are ranking by an edit-distance like function such as Levenshtein or Jaro-Winkler, it makes more sense to get your *candidates* via the same or similar algorithm! The existing spellchecker gets candidates with n-grams... I think this causes a mismatch... (Of course the inverse is true, if you use NGramDistance, use the existing spellchecker!)\n\nAgain I did a lot of testing with various corpora, and I'm not a spellchecking expert but i didn't get particularly good results from the existing spellchecker.\nAnd for some corpora such as geonames, it didnt seem to have the configurability I needed to tune the spellchecker to that domain.\n\nFor example, i queried on \"zeeland\" and the existing spellchecker returned freeland, leland, ireland, deland, and cleland as suggestions.\nWhats worse, is that it created a 240MB auxiliary index when my original index was only 300MB, and it took it 141 seconds to do this.\n\nThe idea here isn't to solve the world's spellchecking problems, its mainly to get rid of the extra index. I think its trivial to\nset this one up to beat SpellChecker's suggestions, because I don't think SpellChecker's suggestions are very good.\n",
            "date": "2010-10-01T02:01:26.171+0000",
            "id": 5
        },
        {
            "author": "Chris Male",
            "body": "Hi,\n\nThanks for that.  Covers my questions nicely.\n\nbq. The idea here isn't to solve the world's spellchecking problems, its mainly to get rid of the extra index.\n\nYes definitely.   I was just checking that we weren't doing that at a cost of reasonable suggestions.  But your argument makes clear sense.  \n\nThis really is a great feature.",
            "date": "2010-10-01T03:03:35.202+0000",
            "id": 6
        },
        {
            "author": "Robert Muir",
            "body": "bq. Yes definitely. I was just checking that we weren't doing that at a cost of reasonable suggestions. But your argument makes clear sense.\n\nWell, aspell has some test data here: http://aspell.net/test/cur/batch0.tab\nI could index some wikipedia, and run both spellcheckers?\n\nAdditionally I suppose it would be fair to run the correct answers from this set, and see the results across both spellcheckers as far as spell-correcting already correct words (and what they suggest if they do!)\n",
            "date": "2010-10-01T03:09:55.218+0000",
            "id": 7
        },
        {
            "author": "Chris Male",
            "body": "That is a very good idea yes, but I don't think its necessary to do that before this is committed.   We can do that afterwards, get an idea of where the spellcheckers are, and improve them through other issues if needs be.",
            "date": "2010-10-01T03:13:38.804+0000",
            "id": 8
        },
        {
            "author": "Robert Muir",
            "body": "bq. That is a very good idea yes, but I don't think its necessary to do that before this is committed.\n\nHere's some *very rough* numbers from that batch0.tab, against the FIRE english corpus (sorry i'm still downloading wikipedia, its quite large!)\nNote, this is only relative, e.g. i dont even know if these terms all exist in that corpus.\nadditionally, some contain punctuation etc, i only lowercased them for consistency.\n\nfor reference, there are 547 incorrect/correct term pairs in this aspell spelling correction test.\nMy corpus has ~150,000 docs, with 304,000 unique terms in the body field.\nfor both spellcheckers I used all defaults, e.g. spellchecker.suggestSimilar(words[1].toLowerCase(), 1, reader, \"body\", true);\n\n||impl||Number correct[1] (out of 547)||Number correct, inverted[2] (out of 547)||Avg time in ms[3]||\n|SpellChecker|214|218|1.47ms\n|DirectSpellChecker|242|303|4.53ms\n\n1. using the misspelling as a query term, does the spellchecker return the correct spelling?\n2. using the correct spelling as a query term, does the spellchecker return nothing at all?\n3. this is the average time to perform an actual correction, both spellcheckers have some way to do no work at all for the common (correctly spelled) case.\n\nSo although the benchmark itself isnt for search engine benchmarking (e.g. contains stopwords/punctuation), this basically shows what I've been seeing, that I think this spellchecker outperforms the existing one, and the perf cost is reasonable.\n",
            "date": "2010-10-01T04:48:05.907+0000",
            "id": 9
        },
        {
            "author": "Robert Muir",
            "body": "By the way, out of curiousity i tested an alternative configuration, DirectSpellChecker with .setMaxEdits(1)\n\nWith this \"lighter\" configuration:\n||impl||Number correct (out of 547)||Number correct, inverted (out of 547)||Avg time in ms||\n|DirectSpellChecker(n=1)|165|432|1.83ms|\n\nSo here, you have the flexibility to have essentially the same performance as the existing spellchecker,\nand the false positive rate is hugely reduced (in this contrived test). You trade off only being able to\ncatch 77% of the suggestions relative to the old spellchecker... but this might be good for setups\nthat feel the n=2 default is too aggressive.\n\nAnd again, like the original configuration, you have no index to rebuild at all.\n",
            "date": "2010-10-01T05:24:17.623+0000",
            "id": 10
        },
        {
            "author": "Chris Male",
            "body": "They're both very fast and you get the flexibility of not having an additional index.  +1 to committing.  ",
            "date": "2010-10-01T06:33:32.094+0000",
            "id": 11
        },
        {
            "author": "Michael McCandless",
            "body": "This is an awesome step forward!\n\nIt requires no parallel index, and, it gets better accuracy (if your metric is edit distance like) at a negligible perf hit.\n\nIt's great that it leverages the absurd speedups we've made to FuzzyQuery in 4.0.",
            "date": "2010-10-01T09:41:52.921+0000",
            "id": 12
        },
        {
            "author": "Robert Muir",
            "body": "I'll work on cleaning up tests and doc, i think we can then commit this with the functionality it has.\n\nbq. It's great that it leverages the absurd speedups we've made to FuzzyQuery in 4.0.\n\nYes, if you read that scary fuzzy paper it seems thats its original use-case all along (we just did FuzzyQuery first, and re-used it here):\nhttp://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.16.652\n\nAlong the same lines, I think we can then later improve both spellcheckers in easy ways. For example,\nit would be good to add a concept of \"SpellCheckFilter\" that can return true/false if a word is correctly spelled.\n\nDocfreq-based stuff helps, but if you know the language, something like hunspell could go a long way here\nto both preventing either spellchecker from trying to correct an already-correctly-spelled word or preventing\nit from suggesting misspellings.\n",
            "date": "2010-10-01T13:21:09.528+0000",
            "id": 13
        },
        {
            "author": "Robert Muir",
            "body": "here's the improved docs and tests.\n\nI'd like to commit this one and we can iterate as discussed, hopefully improve both spellcheckers.",
            "date": "2010-10-01T16:07:41.074+0000",
            "id": 14
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 1003642.",
            "date": "2010-10-01T20:41:23.906+0000",
            "id": 15
        }
    ],
    "component": "modules/spellchecker",
    "description": "The current spellchecker makes an n-gram index of your terms, and queries this for spellchecking.\nThe terms that come back from the n-gram query are then re-ranked by an algorithm such as Levenshtein.\n\nAlternatively, we could just do a levenshtein query directly against the index, then we wouldn't need\na separate index to rebuild.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2507",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "automaton spellchecker",
    "systemSpecification": true,
    "version": ""
}