{
    "comments": [
        {
            "author": "Doug Cutting",
            "body": "Rather I think we should consider making SegmentInfos package-private again.  This was made public by LUCENE-701.  Is it too late to hide it again?  Is this really an API we want to support long-term?  If there are individual methods that we wish to expose, perhaps they can instead be exposed through IndexReader or IndexWriter.  It is a slippery slope to now start making things it references public.\n\nPerhaps we should in the future try to separate interfaces and implementations into separate packages.  The implementation package could be named something like 'index2impl' with the understanding that its public API will not be supported long-term.  But, until we do something like that, I think package-private works well.  Tools like Luke can add classes to the package in order to access package-private stuff.",
            "date": "2007-02-22T17:49:25.060+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "Indeed I did this as part of LUCENE-701, but I can't remember what on\nearth my reasoning was.\n\nI agree it's not necessary and we should make it package protected\nagain.  I can make this fix.\n\nCould we release a 2.0.1 that would include this (and anything else if\nwe need to)?  I would volunteer to do the release mechanics since I\ncaused this (sorry) :(\n\nI will also review what else I made public, and, be more careful in\nthe future to not relax protection unless it's absolutely needed.\n",
            "date": "2007-02-22T19:12:56.992+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "Sorry, make that 2.1.1 above!",
            "date": "2007-02-22T19:13:59.616+0000",
            "id": 2
        },
        {
            "author": "Hoss Man",
            "body": "since SegmentInfos is final, and all of it's methods are (at best) package protected i don't think it's a big risk to make it private again (without requiring a bump to lucene-3.0.0)\n\nI'm not sure if re-privatizing this class really neccessitates a 2.1.1 release ... it doesn't cause any bugs, and it does't really give people very much rope to hang themselves with unless they are going out of their way to put stuff in the org.apache.lucene.index package.",
            "date": "2007-02-22T19:33:36.944+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "Attaching proposed patch to change SegmentInfos (and all of its methods/fields) back to package level protection.\n\nI also found a few other cases (IndexFileNames, IndexFileNamesFilter, SegmentInfo) that I had added public methods which should be kept at package protection.",
            "date": "2007-02-22T21:54:07.275+0000",
            "id": 4
        },
        {
            "author": "Doug Cutting",
            "body": "I think making some methods public is fine, so long as the class is kept package-private.",
            "date": "2007-02-22T22:09:08.374+0000",
            "id": 5
        },
        {
            "author": "Andrzej Bialecki ",
            "body": "I'm fine with making these classes package-private - Luke already uses a \"gateway\" class to access SegmentInfo, IndexFileDeleter & friends.",
            "date": "2007-02-22T23:06:29.211+0000",
            "id": 6
        },
        {
            "author": "Michael McCandless",
            "body": "> I think making some methods public is fine, so long as the class is\n> kept package-private.\n\nBut, for a package-private final class, marking un-inherited\nmethods/fields public doesn't enable any additional access since the\nclass itself is only visible within the package (I think)?  Or am I\nmissing something basic about Java's access protections?\n",
            "date": "2007-02-23T10:50:37.753+0000",
            "id": 7
        },
        {
            "author": "Doug Cutting",
            "body": "> for a package-private final class, marking un-inherited \n> methods/fields public doesn't enable any additional access\n\nRight.  You were switching several such methods from public to package-private, which is a no-op and prompted my comment.  On the other-hand, if the class is ever made public, it may be useful to have its intended public API pre-declared, and, even if it's never made public, declaring some methods public has some documentation value.  In general, the style I prefer is try to declare fields and methods as though each class were public.  Package-private methods and fields are really only required for classes that actually are public but that wish to hide some things from all but others in their package.\n\nThis is a fine point, and doesn't warrant too much analysis.  I probably should have just held my tongue.",
            "date": "2007-02-23T17:50:56.300+0000",
            "id": 8
        },
        {
            "author": "Michael McCandless",
            "body": "Ahhh, OK, I see.  I like that style (declaring fields/methods public\neven when the class is package-private).  I will re-work that patch\nbased on this.",
            "date": "2007-02-23T18:55:44.188+0000",
            "id": 9
        },
        {
            "author": "Daniel John Debrunner",
            "body": "Doesn't making such methods public mean they can be called trough reflection?",
            "date": "2007-02-23T19:09:38.779+0000",
            "id": 10
        },
        {
            "author": "Michael McCandless",
            "body": "OK fixed the patch to leave some fields/methods public.",
            "date": "2007-02-23T20:02:36.457+0000",
            "id": 11
        },
        {
            "author": "Michael McCandless",
            "body": "This is resolved.  If we do a 2.1.1 then I will backport to the 2.1 branch at that time.",
            "date": "2007-02-27T13:29:04.544+0000",
            "id": 12
        }
    ],
    "component": "core/index",
    "description": "org.apache.lucene.index.SegmentInfos is public, and contains public methods (which is good for expert-level index manipulation tools such as Luke). However, SegmentInfo class has package visibility. This leads to a strange result that it's possible to read SegmentInfos, but it's not possible to access its details (SegmentInfos.info(int)) from a user application.\n\nThe solution is to make SegmentInfo class public.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-811",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Public API inconsistency",
    "systemSpecification": true,
    "version": "2.1"
}