{
    "comments": [
        {
            "author": "Simon Willnauer",
            "body": "Could we make FuzzyRewrite a subclass of BooleanQueryRewriteMethod and add a simple check like\n{code}\nif(!mtq.getRewriteMethod() instanceof BooleanRewrite){\n  mtq.setRewriteMethod(BooleanRewriteMethod)\n}\n{code}\n\nAs it rewrites to booleanquery it seems to be ok to subclass though.\n\nYet another thing, you throw unsupportedOperationException in FuzzyQuery#setRewriteMethod, we should at least document in MTQ that this is an optional operation. Something like\n{code}\n/**\n  * ... (optional operation)\n  * @throws UnsupportedOperationException if this method is not supported by the MultiTermQuery\n  */\n{code}\n\n\n",
            "date": "2009-12-07T09:09:23.009+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. Could we make FuzzyRewrite a subclass of BooleanQueryRewriteMethod and add a simple check like \n\nThe problem is that also ConstantScoreBooleanRewrite subclasses BooleanQueryRewriteMethod.\n\nbq. Yet another thing, you throw unsupportedOperationException in FuzzyQuery#setRewriteMethod, we should at least document in MTQ that this is an optional operation. Something like\n\nThis issue will remove this an make FUZZY_REWRITE public and maybe move to MTQ (because it is also useful for other boosting term lists to only put the highest ranking erms into the BQ). The name could be something like HIGHEST_SCORING_BOOLEAN_QUERY_REWRITE (brr).",
            "date": "2009-12-07T09:39:01.818+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Here a refactoring of the rewrite modes in Flex. I'll port to trunk, too.\n\nFuzzyQuery now uses per default TOP_TERMS_SCORING_BOOLEAN_REWRITE which is part of MTQ and can now also be used by e.g. MoreLikeThis.",
            "date": "2009-12-09T11:30:01.085+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "More refactoring. No also AUTO_REWRITE uses the new TermCollector. It gets less and less code.",
            "date": "2009-12-09T11:57:32.197+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Now i also made the strange anonymous inner class a named inner class to get rid of the strange boolean holder, implemented by an array.",
            "date": "2009-12-09T12:07:41.112+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "Trunk patch comes soon.",
            "date": "2009-12-09T16:31:12.379+0000",
            "id": 5
        },
        {
            "author": "Uwe Schindler",
            "body": "Here the final patches with updated JavaDocs. I want to apply them in this form to trunk and flex. If nobody objects I will do this tomorrow.\n\nWIth this patch, FuzzyQuery will always highlight correctly, as it can be switched to boolean query rewrite mode.",
            "date": "2009-12-09T17:14:12.132+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "Here is the code as discussed on IRC:\nIt fixes the braindead LUCENE-504 code :-)",
            "date": "2009-12-09T19:24:17.567+0000",
            "id": 7
        },
        {
            "author": "Uwe Schindler",
            "body": "So the last patch for today.\n\nI optimized the PQ to reuse the ScoreTerm instance when the PQ is full. I think for current FuzzyQuery the rewrite modes are now as best as possible. The tests pass that already test the overflow of the PQ by setting  BQ.maxClauseCount to a very low value.",
            "date": "2009-12-09T21:00:01.771+0000",
            "id": 8
        },
        {
            "author": "Uwe Schindler",
            "body": "After sleeping one more night, I added code to not even put the termsinto the PQ, when they are not competitive. More support for automaton query will come only in flex with LUCENE-2140.\n\nI like to commit this during the day. Thanks for all the support and interesting discussions.",
            "date": "2009-12-10T07:14:16.472+0000",
            "id": 9
        },
        {
            "author": "Michael McCandless",
            "body": "Latest patch looks great Uwe!",
            "date": "2009-12-10T10:20:24.062+0000",
            "id": 10
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed in trunk and flex!\n\nWARNING: Please do not merge revision #889181 to flex!\n\nI'll will not merge this to 3.0 branch, as the ScoreTerm is protected and this change need to invert th PQ order, which would break BW compatibility.",
            "date": "2009-12-10T12:01:35.331+0000",
            "id": 11
        },
        {
            "author": "Uwe Schindler",
            "body": "I already closed this issue, but still open is migration to 3.0, where the PQ is somehow broken (can consume too much RAM). There are two possibilities to merge:\n\n- Apply this patch to 3.0 -> new features, ok for 3.0 branch\n- Only fix PQ issue in FuzzyQuery -> Problem: ScoreDoc is protected and there is the need to change the comparator (inverse). In my opinion the ScoreTerm should be a private class at all (like it is in MTQ now). But we cannot change it (BW compatibility). A solution could be to ignore the comparator and give the inverse comparator in the PQ ctor as param. In trunk, the ScoreTerm class is deprecated and dead code, but has the original comparator.\n\nWhat to do?",
            "date": "2009-12-10T17:58:48.760+0000",
            "id": 12
        },
        {
            "author": "Uwe Schindler",
            "body": "Solution 2 for 3.0 branch that inverts the ScoreTerm comparator with an additional Comparator.",
            "date": "2009-12-10T18:36:36.656+0000",
            "id": 13
        },
        {
            "author": "Uwe Schindler",
            "body": "Here the version with BW break. The inner class ScoreTerm in Fuzzy query was never intended to be public. If somebody used it, code will break, but that is not likely to be the case.",
            "date": "2009-12-11T10:04:40.364+0000",
            "id": 14
        },
        {
            "author": "Uwe Schindler",
            "body": "Removed unused include.",
            "date": "2009-12-11T10:07:52.998+0000",
            "id": 15
        },
        {
            "author": "Uwe Schindler",
            "body": "3.0 branch + scoring test. Committed revision: 889567",
            "date": "2009-12-11T10:49:09.732+0000",
            "id": 16
        },
        {
            "author": "Uwe Schindler",
            "body": "Here the same change for trunk. It also contains a test that checks a term range (which has no boost) with the fuzzy rewrite mode and tests that the PQ correctly only returns the lower terms.",
            "date": "2009-12-11T11:36:53.363+0000",
            "id": 17
        },
        {
            "author": "Uwe Schindler",
            "body": "Better test for the PQ tie-break case.\n\nI'll commit soon and also merge to flex (in flex more changes in javadocs needed).",
            "date": "2009-12-11T13:08:37.197+0000",
            "id": 18
        },
        {
            "author": "Uwe Schindler",
            "body": "To test the comparator and inject a bug:\nremove:\n{code}\n// ignore uncompetetive hits\nif (stQueue.size() >= maxSize && boost <= stQueue.peek().boost)\n  return true;\n{code}\n\nand inverse the comparator's term order:\n{code}\npublic int compareTo(ScoreTerm other) {\n  if (this.boost == other.boost)\n     return *-*other.term.compareTo(this.term);\n  else\n     return Float.compare(this.boost, other.boost);\n}\n{code}",
            "date": "2009-12-11T13:24:57.224+0000",
            "id": 19
        }
    ],
    "component": "modules/highlighter",
    "description": "As FuzzyQuery does not allow to change the rewrite mode, highlighter fails with UOE in flex since LUCENE-2110, because it changes the rewrite mode to Boolean query. The fix is: Allow MTQ to change rewrite method and make FUZZY_REWRITE public for that.\n\nThe rewrite mode will live in MTQ as TOP_TERMS_SCORING_BOOLEAN_REWRITE. Also the code will be refactored to make heavy reuse of term enumeration code and only plug in the PQ for filtering the top terms.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2123",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Move FuzzyQuery rewrite as separate RewriteMode into MTQ, was: Highlighter fails to highlight FuzzyQuery",
    "systemSpecification": true,
    "version": "4.0-ALPHA"
}