{
    "comments": [
        {
            "author": "Nicolas Lalevée",
            "body": "I was working on the IndexFormat mechanism, LUCENE-622 being the first draft of it. And I have tried to use some Java-1.5 parametered types to see if it is possible to make index readers/writers typed by the index format. And I am in front of one issue : the directory have to know the index format because of the IndexNameFilter and the create feature. And I don't think it is a good idea because of how they are instanciated.\n\nI have not finished the design of this Java-1.5-way-of-typing, I have other issues to look at, but I vote +1 for removing any index structure specificity in the store package.",
            "date": "2007-01-14T11:26:32.082+0000",
            "id": 0
        },
        {
            "author": "Nicolas Lalevée",
            "body": "forget what I have said about \"removing any index structure specificity in the store package.\". Actually, the directory is the only central instance that can holds an indexformat instance.\n\nAnyway, I still +1 for not duplicating code ! :)",
            "date": "2007-01-14T11:52:35.902+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "Nicolas, I think you meant LUCENE-662 above?\n\nBut I'll take the +1 :)\n",
            "date": "2007-01-14T12:25:29.189+0000",
            "id": 2
        },
        {
            "author": "Nicolas Lalevée",
            "body": "ho, yeah, it's the 662 of course, my eyes might have squited. :) (and it can't be the 622 as I am definitively not a maven user ^^)",
            "date": "2007-01-14T18:51:22.836+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "\nOK I committed this:\n\n  * Added removal of old write lock in IndexWriter's create (it\n    already removes unreferenced files).\n\n  * Deprecated FSDirectory.getDirectory constructors that take a\n    boolean create.\n\n  * Verified all unit tests still pass while using deprecated create.\n\n  * Fixed all but one unit test to no longer use the now-deprecated\n    constructors (I left one to make sure we do in fact continue to\n    test the deprecated getDirectory constructor).  I added an \"rmDir\"\n    utility method in a new class o/a/l/util/_TestUtil.java for those\n    tests that were using getDirectory to just remove a directory.\n\n  * Removed FSDirectory.getDirectory methods that had \"create\" that we\n    had added with LockFactory.  These methods were never released so\n    no sense newly releasing deprecated APIs.\n",
            "date": "2007-01-18T22:48:48.659+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "\nMy fix here broke one case of backwards compatibility for Directory implementations that provide their own locking implementation (ie, that do not use Lockfactory).  See here:\n\n    http://www.gossamer-threads.com/lists/lucene/java-dev/44555",
            "date": "2007-01-23T17:30:39.424+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "OK I added a unit test that hits the NPE, and corrected it so the test\nnow passes.\n\nSorry about this and thanks for catching it Aaron!\n",
            "date": "2007-01-23T17:34:45.045+0000",
            "id": 6
        },
        {
            "author": "Michael McCandless",
            "body": "Closing all issues that were resolved for 2.1.",
            "date": "2007-02-27T18:10:39.780+0000",
            "id": 7
        }
    ],
    "component": "",
    "description": "It's confusing that there is a create=true|false at the FSDirectory\nlevel and then also another create=true|false at the IndexWriter\nlevel.  Which one should you use when creating an index?\n\nOur users have been confused by this in the past:\n\n  http://www.gossamer-threads.com/lists/lucene/java-user/4792\n\nI think in general we should try to have one obvious way to achieve\nsomething (like Python: http://en.wikipedia.org/wiki/Python_philosophy).\n\nAnd the fact that there are now two code paths that are supposed to do\nthe same (similar?) thing, can more easily lead to sneaky bugs.  One\ncase of LUCENE-140 (already fixed in trunk but not past releases),\nwhich inspired this issue, can happen if you send create=false to the\nFSDirectory and create=true to the IndexWriter.\n\nFinally, as of lockless commits, it is now possible to open an\nexisting index for \"create\" while readers are still using the old\n\"point in time\" index, on Windows.  (At least one user had tried this\npreviously and failed).  To do this, we use the IndexFileDeleter class\n(which retries on failure) and we also look at the segments file to\ndetermine the next segments_N file to write to.\n\nWith future issues like LUCENE-710 even more \"smarts\" may be required\nto know what it takes to \"create\" a new index into an existing\ndirectory.  Given that we have have quite a few Directory\nimplemenations, I think these \"smarts\" logically should live in\nIndexWriter (not replicated in each Directory implementation), and we\nshould leave the Directory as an interface that knows how to make\nchanges to some backing store but does not itself try to make any\nchanges.\n",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-773",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Deprecate \"create\" method in FSDirectory.getDirectory in favor of IndexWriter's \"create\"",
    "systemSpecification": true,
    "version": "1.9, 2.0.0, 2.1"
}