{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "Patch.\n\nThe changes in DateTools may affect users with very strange default locales that indexed with prior Lucene versions, but this is unlikely a problem, as the whole sorting may be broken already.\n\nShould I add a note to CHANGES.txt?",
            "date": "2009-08-23T09:47:22.955+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "Uwe, thanks for bringing this issue up! \n\nwe still have more work to do. Out of curiosity, i looked to see if the old queryparser in core passed under korean locale.\nit does not...\n\n{noformat}\nsetenv ANT_ARGS \"-Dargs=-Duser.language=ko -Duser.country=KR\"\nant -Dtestcase=TestQueryParser test\n{noformat}\n",
            "date": "2009-08-23T14:48:56.602+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 807117",
            "date": "2009-08-24T08:31:52.474+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "In DateTools is another bug:\nThe Calendar used is not always the Gregorian one (e.g. if default Locale is Thai). We should also pass Locale.US to the Calendar.getInstance() call.",
            "date": "2011-01-25T22:45:55.411+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed Calendar fix in:\ntrunk revision 1063501\n3.x revision: 1063502\n3.0 revision: 1063506\n2.9 revision: 1063509",
            "date": "2011-01-25T23:08:06.071+0000",
            "id": 4
        }
    ],
    "component": "core/other",
    "description": "This is a followup to LUCENE-1836: I found some more Locale problems in Lucene with Date Formats. Even for simple date formats only consisting of numbers (like ISO dates), you should always give the US locale. Because the dates in DateTools should sort according to String.compare(), it is important, that the decimal digits are western ones. In some strange locales, this may be different. Whenever you want to format dates for internal formats you exspect to behave somehow, you should at least set the locale to US, which uses ASCII. Dates entered by users and displayed to users, should be formatted according to the default or a custom specified locale.\nI also looked for DecimalFormat (especially used for padding numbers), but found no problems.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1846",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Trivial",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "More Locale problems in Lucene",
    "systemSpecification": true,
    "version": ""
}