{
    "comments": [
        {
            "author": "Grant Ingersoll",
            "body": "Here's the fix for the spellchecker.  I confirmed this fixes the Solr issue.  I just put two isLocked() calls around the places where release and unlock are called.",
            "date": "2008-01-17T13:37:25.912+0000",
            "id": 0
        },
        {
            "author": "Grant Ingersoll",
            "body": "I will commit around 12 EST today.",
            "date": "2008-01-17T14:01:00.640+0000",
            "id": 1
        },
        {
            "author": "Grant Ingersoll",
            "body": "Committed on 612869 and 612868 (branch and trunk)",
            "date": "2008-01-17T17:01:38.921+0000",
            "id": 2
        }
    ],
    "component": "modules/other",
    "description": "As noted in LUCENE-1050, fixing a bug in SimpleLockFactory related to not reporting success/filure of lock file deletion has surfaced bad behavior in SpellChecker.clearIndex...\n\nGrant...\n{quote}\nIt seems the SpellChecker is telling the IndexReader to delete the lockFile, but the lockFile doesn't exist.\n  ...\nI don't know much about the locking mechanism, but it seems like this should check to see if the lockFile exists before trying to delete it.\n{quote}\n\nHoss...\n{quote}\nGrant: my take on this is that SpellChecker.clearIndex is in the wrong. it shouldn't be calling unlock unless it has reason to think there is a \"stale lock\" that needs to be closed - ie: this is a bug in SpellChecker that you have only discovered because this bug LUCENE-1050 was fixed.\n\nI would suggest a new issue for tracking, and a patch in which SpellChecker.clearIndex doesn't call unlock unless isLocked returns true. Even then, it might make sense to catch and ignore LockReleaseFailedException and let whatever resulting exception may originate from \"new IndexWriter\" be returned.\n{quote}\n\nmarking for 2.3 since it seems like a fairly trivial fix, and if we don't deal with it now it will be a bug introduced in 2.3.\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1138",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "SpellChecker.clearIndex calls unlock inappropriately",
    "systemSpecification": true,
    "version": "2.3"
}