{
    "comments": [
        {
            "author": "Dawid Weiss",
            "body": "Would a quickfix of prepending or postfixing with the user name work here?",
            "date": "2011-09-23T19:50:13.125+0000",
            "id": 0
        },
        {
            "author": "Steve Rowe",
            "body": "From #lucene IRC:\n\n{noformat}\nsarowe: line #69 of lucene/test-framework/o/a/l/util/LuceneJUnitResultFormatter/:\n            File lockDir = new File(System.getProperty(\"java.io.tmpdir\"),\n                \"lucene_junit_lock\");\n  hoss: right ... i saw that ... i suspect it's for using random factories and stuff\n        not clera if the goal is to have a dir that all the parallel JVMs agree on or what\n        even if it is: should be able to put it in the build dir ... right?\nsarowe: I think so - the only question in my mind is whether it's used in both lucene and solr\n        if so, then \"the build dir\" is not fixed\n  hoss: hmmm... good question\n        in which case somethine like: \"dir = tmp + user.name + md5(path to common-build.xml)\" would be better, and probably solve the same problem\nsarowe: I don't understand the last component\n        why md5(c-b.xml path)?\n        I mean, why anything at all other than tmp + user.name?\n  hoss: think rmuir and his beast box ... multiple copies of lucene checked out into diff dirs where he's testing diff patches\nsarowe: a (maybe simpler) option would be to always use lucene/build/?\n        even when running solr tests, I mean\n  hoss: sure .. maybe ... can you opne an issue and we'll figure it out there? \n{noformat}",
            "date": "2011-09-23T19:50:54.775+0000",
            "id": 1
        },
        {
            "author": "Steve Rowe",
            "body": "bq. Would a quickfix of prepending or postfixing with the user name work here?\n\nDawid, as Hoss mentioned (quoted above), it would be even better to additionally include (a hash of a filename from) the source directory in which the tests are being run, to handle the case of simultaneous test runs by the same user.\n\nHowever, I think an even quick(er)fix would be to just use {{lucene/build/}} as the location of the lock, instead of the value of the {{$\\{java.io.tmpdir\\}}} system property.",
            "date": "2011-09-23T20:02:34.278+0000",
            "id": 2
        },
        {
            "author": "Dawid Weiss",
            "body": "Yep, I was seconds ahead of your post, so I didn't see it :)",
            "date": "2011-09-23T20:07:55.262+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "{quote}\nHowever, I think an even quick(er)fix would be to just use lucene/build/ as the location of the lock, instead of the value of the ${java.io.tmpdir} system property.\n{quote}\n\nThere was some reason I didn't do this, but I think it might be obselete.",
            "date": "2011-09-23T20:20:24.166+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "maybe someone can test this patch?",
            "date": "2011-09-23T20:34:11.004+0000",
            "id": 5
        },
        {
            "author": "Steve Rowe",
            "body": "bq. maybe someone can test this patch?\n\nI ran Lucene & Solr trunk tests with this patch on a 4-cpu-core Windows 7 box.\n\nOn the first pass, the build hung in the middle of the lucene core tests - I killed the process after half an hour with no output.  I restarted the tests, and the build made it through the Lucene tests, but then at least one Solr core test failed.\n\nI restarted the Solr tests, and they all succeeded.  But after completing (\"BUILD SUCCESSFUL, Total time: ...\"), the Ant build hung.  I killed it after half an hour.\n\nThe changes in the patch are so simple, I really doubt that the hangs I experienced had anything to do with them.\n\n\n\n",
            "date": "2011-09-23T22:39:25.774+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. On the first pass, the build hung in the middle of the lucene core tests - I killed the process after half an hour with no output. I restarted the tests, and the build made it through the Lucene tests, but then at least one Solr core test failed.\n\nWe had this several times on Jenkins, too. I killed the JVM approx 4 times the last 2 weeks.",
            "date": "2011-09-24T08:15:35.216+0000",
            "id": 7
        },
        {
            "author": "Steve Rowe",
            "body": "I just successfully ran all trunk Lucene/Solr tests with this patch, and everything passed.\n\n+1 to commit.",
            "date": "2011-10-25T23:45:05.283+0000",
            "id": 8
        },
        {
            "author": "Uwe Schindler",
            "body": "Bulk close after release of 3.5",
            "date": "2011-11-27T12:29:36.808+0000",
            "id": 9
        },
        {
            "author": "Grant Ingersoll",
            "body": "I think I am still seeing this between my local user on my machine and Jenkins on the same machine.  Jenkins checks out clean every time.\n\nWhen I run with ant -v I do see the lockdir set to the build dir, but I also see 'Override ignored for property \"tests.lockdir\"'",
            "date": "2011-12-02T01:39:43.505+0000",
            "id": 10
        },
        {
            "author": "Robert Muir",
            "body": "Somehow my commit got 'lost' e.g. during merging.",
            "date": "2011-12-02T01:42:58.897+0000",
            "id": 11
        },
        {
            "author": "Robert Muir",
            "body": "Fortunately i only screwed this up on trunk... its been fine in 3.x all along.",
            "date": "2011-12-02T03:15:44.372+0000",
            "id": 12
        }
    ],
    "component": "general/test",
    "description": "{{LuceneJUnitResultFormatter}} uses a lock to buffer test suites' output, so that when run in parallel, they don't interrupt each other when they are displayed on the console.\n\nThe current implementation uses a fixed directory ({{lucene_junit_lock/}} in {{java.io.tmpdir}} (by default {{/tmp/}} on Unix/Linux systems) as the location of this lock.  This functionality was introduced on SOLR-1835.\n\nAs Shawn Heisey reported on SOLR-2739, some tests fail when run as root, but succeed when run as a non-root user.  \n\nOn #lucene IRC today, Shawn wrote:\n{quote}\n(2:06:07 PM) elyograg: Now that I know I can't run the tests as root, I have discovered /tmp/lucene_junit_lock.  Once you run the tests as user A, you cannot run them again as user B until that directory is deleted, and only root or the original user can do so.\n{quote}\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3452",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "The native FS lock used in test-framework's o.a.l.util.LuceneJUnitResultFormatter prohibits testing on a multi-user system",
    "systemSpecification": true,
    "version": "3.4, 4.0-ALPHA"
}