{
    "comments": [
        {
            "author": "Hoss Man",
            "body": "clarifying summary, and cleaning up description (formating and removing spam bait)",
            "date": "2007-12-11T20:19:19.244+0000",
            "id": 0
        },
        {
            "author": "Mark Miller",
            "body": "Not sure how to fix this, but I think LUCENE-1771 will make it a bit easier - if we can just get the multi searcher passed as the searcher to explain(searcher, reader, doc), it would pull the right numbers.\n\nNot sure how to do that though - as it is, it looks like explain on MultiSearcher is going to get left out in the cold - MultiSearcher works with Searchables, but Searchable#explain is deprecated with the replacement on Searcher. Thats trouble for MultiSearcher#explain.",
            "date": "2009-08-11T00:15:58.301+0000",
            "id": 1
        },
        {
            "author": "Mark Miller",
            "body": "bq. as it is, it looks like explain on MultiSearcher is going to get left out in the cold - MultiSearcher works with Searchables, but Searchable#explain is deprecated with the replacement on Searcher. Thats trouble for MultiSearcher#explain.\n\nLooks like I left it out in the cold ! This was a mistake when reverting from QueryWeight to Weight - I missed removing this deprecation.\n\nfixed and committed r806561",
            "date": "2009-08-21T14:02:22.987+0000",
            "id": 2
        },
        {
            "author": "Mark Miller",
            "body": "Thanks for the report Yasoja! This has been fixed in the linked issue.",
            "date": "2009-08-25T12:51:00.092+0000",
            "id": 3
        }
    ],
    "component": "core/query/scoring",
    "description": "Creating 2 different indexes, searching  each individually and print score details and compare to searching both indexes with MulitSearcher and printing score details.  \n \nThe \"docFreq\" value printed isn't correct - the values it prints are as if each index was searched individually.\n\nCode is like:\n{code}\nMultiSearcher multi = new MultiSearcher(searchables);\nHits hits = multi.search(query);\nfor(int i=0; i<hits.length(); i++)\n{\n  Explanation expl = multi.explain(query, hits.id(i));\n  System.out.println(expl.toString());\n}\n{code}\n\nI raised this in the Lucene user mailing list and was advised to log a bug, email thread given below.\n\n{noformat} \n-----Original Message-----\nFrom: Chris Hostetter  \nSent: Friday, December 07, 2007 10:30 PM\nTo: java-user\nSubject: Re: does the MultiSearcher class calculate IDF properly?\n\n\na quick glance at the code seems to indicate that MultiSearcher has code \nfor calcuating the docFreq accross all of the Searchables when searching \n(or when the docFreq method is explicitly called) but that explain method \njust delegates to Searchable that the specific docid came from.\n\nif you compare that Explanation score you got with the score returned by \na HitCollector (or TopDocs) they probably won't match.\n\nSo i would say \"yes MultiSearcher calculates IDF properly, but \nMultiSeracher.explain is broken.  Please file a bug about this, i can't \nthink of an easy way to fix it, but it certianly seems broken to me.\n\n\n: Subject: does the MultiSearcher class calculate IDF properly?\n: \n: I tried the following.  Creating 2 different indexes, search each\n: individually and print score details and compare to searching both\n: indexes with MulitSearcher and printing score details.  \n: \n: The \"docFreq\" value printed don't seem right - is this just a problem\n: with using Explain together with the MultiSearcher?\n: \n: \n: Code is like:\n: MultiSearcher multi = new MultiSearcher(searchables);\n: Hits hits = multi.search(query);\n: for(int i=0; i<hits.length(); i++)\n: {\n:   Explanation expl = multi.explain(query, hits.id(i));\n:   System.out.println(expl.toString());\n: }\n: \n: \n: Output:\n: id = 14 score = 0.071\n: 0.07073946 = (MATCH) fieldWeight(contents:climate in 2), product of:\n:   1.0 = tf(termFreq(contents:climate)=1)\n:   1.8109303 = idf(docFreq=1)\n:   0.0390625 = fieldNorm(field=contents, doc=2)\n{noformat} ",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-1087",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "MultiSearcher.explain returns incorrect score/explanation relating to docFreq",
    "systemSpecification": true,
    "version": "2.2"
}