{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "I agree, in some of these cases, we might be able to refactor helper methods and such into tests-framework, which would be cleaner.\n\nwe shouldn't necessarily do this in all cases, but at least clean up the obvious ones\n",
            "date": "2011-08-17T13:03:48.293+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "patch for trunk",
            "date": "2011-08-17T13:26:19.603+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "Here's the explanation (since patch will not apply as it contains svn moves):\n# disabled the lucene src/test from contrib classpath\n# moved the fieldcacherewritemethod and tests to core src/test, as discussed in LUCENE-3271\n# moved the europarl data file to tests-framework, because some contribs use it\n# moved that createDocument() method from TestIndexWriterReader to DocHelper\n\nif there are no objections I would like to commit soon.",
            "date": "2011-08-17T13:28:21.438+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Patch for trunk looks fine! Thanks!\n\nThe stupid 3.x-extends-TestQueryParser problem is more challenging :(",
            "date": "2011-08-17T13:39:53.509+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "I agree, so the issue is still open for 3.x\n\nWhat i did was merge back the applicable improvements from the trunk patch, but the contrib classpath still contains src/test for now.\n\nI'll try to look at the queryparser tests, in general maybe we can cleanup here, i've noticed a lot of duplication in the tests before.\nhopefully we can clean up the tests a bit and fix the build at the same time...",
            "date": "2011-08-17T14:00:58.832+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "analyzers was broken too, i moved VocabularyAssert to tests-framework (trunk too)",
            "date": "2011-08-17T14:21:52.982+0000",
            "id": 5
        },
        {
            "author": "Robert Muir",
            "body": "ok this fixes branch_3x.\n\nI refactored TestQueryParser into a QueryParserTestBase, and extended it by the core TestQP and this ExtendableQP.\n\nReally we should clean this up more for a bunch of the other QPs, but this is a start and fixes the build.",
            "date": "2011-08-17T17:46:36.347+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "I think thats fine as a start. This would not work in test-framework in trunk, but there we dont have that problem, as all QParsers live in one module. So the abstract base class can live there.",
            "date": "2011-08-17T18:09:44.571+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "All done... its good you brought this up Uwe, \n\nin fact the ExtendableQPTest was not overriding the correct method, so really it wasnt being tested (we were just running the core QP tests again!!!!)\n",
            "date": "2011-08-17T18:34:57.941+0000",
            "id": 8
        }
    ],
    "component": "general/test",
    "description": "If you do \"ant clean\" on the root level of Lucene and then go to e.g. contrib/queryparser (3.x only) or contrib/misc (3.x and trunk) and call \"ant test\", the build of tests fails:\n- contrib/queryparser's ExtendedableQPTests extend a core TestQueryParser (3.x only, in module this works, of course)\n- contrib/misc/TestIndexSplitter uses a core class to build its index\n\nTo find the root cause: We should first remove the core tests from contrib classpath, so the issue gets visible even without \"ant clean\" before. Then we can fix this.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3378",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Some contribs depend on core tests to be compiled and fail when ant clean was done before",
    "systemSpecification": true,
    "version": "3.4, 4.0-ALPHA"
}