{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "As said yesterday to you privately: I agree with making Lucene trunk Java 6 only - Surprise. But 3.x should stay with Java 5. Is this ok for you?\n\nI know, Simon will not agree because he made DocValues for Android *g*\n\nAbout Hudson testing: We may donate a machine to Infra just for Lucene tests running something nice like Ubuntu, stay tuned (no details, I just say that).",
            "date": "2011-06-24T16:24:37.686+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "bq. About Hudson testing: We may donate a machine to Infra just for Lucene tests running something nice like Ubuntu, stay tuned (no details, I just say that).\n\nAnd when this time comes, we could consider supporting java 5. \n\nBut right now, we don't have a way to test it.",
            "date": "2011-06-24T16:55:04.547+0000",
            "id": 1
        },
        {
            "author": "DM Smith",
            "body": "Hey, it's me, old-stick-in-the-mud, wrt upgrading Java :) For the most part, I think the same arguments as last time (Java 1.4 -> Java 5) still apply.\n\nHowever, Oracle is so much more aggressive in obsoleting their software. They haven't patched Java 5 in quite some time. When Lucene went to Java 5, Java 1.4 was still being patched.\n\nI think most will be running Lucene under Java 6 (excepting some versions of Mac OS X and hardware. E.g. Core Duo Macs can't run Java 6).\n\nI'd like to see that we have api compatibility w/ Java 5 (i.e. it can compile against Java 5), but certify against Java 6. This would allow it to run under Java 5, with the appropriate caveats that it is not supported or tested.\n\nIf you do go to Java 6 features, then I think it has to be a 4.0 release and the planned 4.0 might need to be bumped to a 5.0 designation.",
            "date": "2011-06-24T18:44:49.520+0000",
            "id": 2
        },
        {
            "author": "Mark Miller",
            "body": "That seems reasonable to me - officially we endorse/support java 6, but we can the 3.x line to 5 features. I can live with that myself.",
            "date": "2011-06-24T19:03:18.399+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "+1, this seems like a good compromise. \n\nSo let me make sure we are on the same page:\n* trunk moves to java6 (all of the source tree, not just solr/)\n* branch_3x stays the same (limit ourselves to what compiles with java5), its already the de-facto reality that java5 is not officially supported since we do not even test it.\n",
            "date": "2011-06-24T22:50:08.425+0000",
            "id": 4
        },
        {
            "author": "DM Smith",
            "body": "Same page.\n",
            "date": "2011-06-24T23:07:54.732+0000",
            "id": 5
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. So let me make sure we are on the same page:\n\n+1\n\nwe should call out an official vote on the dev list though",
            "date": "2011-06-25T07:07:08.579+0000",
            "id": 6
        },
        {
            "author": "Dawid Weiss",
            "body": "+1 from me.",
            "date": "2011-06-25T13:57:00.759+0000",
            "id": 7
        },
        {
            "author": "Simon Willnauer",
            "body": "this patch moves the build and metadata to 1.6",
            "date": "2011-06-30T11:17:02.321+0000",
            "id": 8
        },
        {
            "author": "Uwe Schindler",
            "body": "Patch looks fine, Jenkins already moved.",
            "date": "2011-06-30T11:35:26.907+0000",
            "id": 9
        },
        {
            "author": "Simon Willnauer",
            "body": "I just committed that patch, I will continue on all the *.java TODOs",
            "date": "2011-06-30T11:52:41.085+0000",
            "id": 10
        },
        {
            "author": "Simon Willnauer",
            "body": "here is a patch that fixes almost all todos except of the one in NativeFSLock. I think for that we should open a sep. issue. I didn't convert all the ArrayUtils yet I think we can do that later in a followup too. \n\n",
            "date": "2011-06-30T12:06:56.466+0000",
            "id": 11
        },
        {
            "author": "Uwe Schindler",
            "body": "+1 as a start",
            "date": "2011-06-30T12:10:08.460+0000",
            "id": 12
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. +1 as a start\nalright I'll kick it in... we are on 1.6 YAY!",
            "date": "2011-06-30T12:13:22.546+0000",
            "id": 13
        },
        {
            "author": "Simon Willnauer",
            "body": "moving out here, created LUCENE-3265 and LUCENE-3266 as followup issues",
            "date": "2011-06-30T12:20:00.422+0000",
            "id": 14
        }
    ],
    "component": "",
    "description": "its been discussed here and there, but I think we need to drop java 5 \"support\", for these reasons:\n* its totally untested by any continual build process. Testing java5 only when there is a release candidate ready is not enough. If we are to claim \"support\" then we need a hudson actually running the tests with java 5.\n* its now unmaintained, so bugs have to either be hacked around, tests disabled, warnings placed, but some things simply cannot be fixed... we cannot actually \"support\" something that is no longer maintained: we do find JRE bugs (http://wiki.apache.org/lucene-java/SunJavaBugs) and its important that bugs actually get fixed: cannot do everything with hacks.\n* because of its limitations, we do things like allow 20% slower grouping speed. I find it hard to believe we are sacrificing performance for this.\n\nSo, in summary: because we don't test it at all, because its buggy and unmaintained, and because we are sacrificing performance, I think we need to cutover the build system for the next release to require java 6.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3239",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "drop java 5 \"support\"",
    "systemSpecification": true,
    "version": ""
}