{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Attached simple patch.\n\nThe patch also fixes a couple other places where we hold onto memory for too long.",
            "date": "2010-05-17T16:11:40.278+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "A couple more places to fix...",
            "date": "2010-05-26T18:01:25.093+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "Don't hold onto the last doc/analyzer that a given thread state held onto; don't reuse postings instances anymore (we don't on trunk anymore either).",
            "date": "2010-05-26T18:04:09.367+0000",
            "id": 2
        }
    ],
    "component": "core/index",
    "description": "Spinoff from the java-user thread \"IndexWriter and memory usage\"...\n\nIndexWriter has had a long standing memory leak, since LUCENE-843.\n\nWhen the byte/char/int blocks are recycled to the common pool, the\nper-thread DW classes incorrectly still hold a reference to them.\n\nThis normally is not a problem, since these buffers will be re-used\nagain.\n\nBut, if you index a massive document, causing IW to allocate more than\nthe RAM buffer allocated to it, then the leak happens.  So you could\nhave a 16 MB RAM buffer set, but if a huge doc required allocation of\n200 MB worth of arrays, those 200 MB are never freed (well, until you\nclose the IW and deref it from the app).\n\nIt's even worse if you use multiple threads: if each thread has ever\nhad to index a massive document, then that thread incorrectly holds\nonto the extra arrays.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2467",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "IndexWriter memory leak when large docs are indexed",
    "systemSpecification": true,
    "version": "2.3, 2.3.1, 2.3.2, 2.4, 2.4.1, 2.9, 2.9.1, 2.9.2, 2.9.3, 3.0, 3.0.1, 3.0.2, 3.1, 4.0-ALPHA"
}