{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "This sounds great Simon!",
            "date": "2009-06-12T14:53:49.934+0000",
            "id": 0
        },
        {
            "author": "Simon Willnauer",
            "body": "Attached a patch that marks the ENGLISH_STOP_WORDS as deprecated.\nI cleaned up in StopAnalyzer (final anyway) a little bit)\nAdded a UnmodifiableCharArraySet impl as an private inner class + testcase\n\n",
            "date": "2009-06-15T13:37:42.870+0000",
            "id": 1
        },
        {
            "author": "Mark Miller",
            "body": "If no one else claims this for 2.9, I guess I'll do it.",
            "date": "2009-06-15T16:30:07.733+0000",
            "id": 2
        },
        {
            "author": "Mark Miller",
            "body": "To trunk. Still needs a bit of a look over.",
            "date": "2009-06-24T18:35:56.318+0000",
            "id": 3
        },
        {
            "author": "Mark Miller",
            "body": "all tests pass",
            "date": "2009-06-24T18:57:03.845+0000",
            "id": 4
        },
        {
            "author": "Mark Miller",
            "body": "Thanks Simon!",
            "date": "2009-07-14T21:40:40.736+0000",
            "id": 5
        }
    ],
    "component": "",
    "description": "StopAnalyzer and StandartAnalyzer are using the static final array ENGLISH_STOP_WORDS by default in various places. Internally this array is converted into a mutable set which looks kind of weird to me. \nI think the way to go is to deprecate all use of the static final array and replace it with an immutable implementation of CharArraySet. Inside an analyzer it does not make sense to have a mutable set anyway and we could prevent set creation each time an analyzer is created. In the case of an immutable set we won't have multithreading issues either. \nin essence we get rid of a fair bit of \"converting string array to set\" code, do not have a PUBLIC static reference to an array (which is mutable) and reduce the overhead of analyzer creation.\n\nlet me know what you think and I create a patch for it.\n\nsimon",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1688",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Deprecating StopAnalyzer ENGLISH_STOP_WORDS - General replacement with an immutable Set",
    "systemSpecification": true,
    "version": ""
}