{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "Here the patch.\n\nTo apply, first do:\n{code}\nsvn copy src/java/org/apache/lucene/analysis/CharArraySet.java src/java/org/apache/lucene/analysis/CharArrayMap.java\n{code}\n\nHave fun!",
            "date": "2010-02-01T23:40:09.841+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "Add CHANGES entry and some javadoc improvements and typo fixes. No code changes.",
            "date": "2010-02-02T00:03:12.707+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "+1",
            "date": "2010-02-02T00:24:05.907+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Thanks Robert!\n\nI only optimized the entrySet() calls to only produce the \"view\" one time and cache (without synchronization of course), like the Java collections API suggests and does.\n\nI think it is now ready to commit.",
            "date": "2010-02-02T00:34:15.588+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Improved patch:\n- keySet now returns a CharArraySet view on the map\n- toString() improvements of all views in CAS and CAM\n- further tests on the views and toString() outputs",
            "date": "2010-02-02T11:31:52.807+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "I will commit this in a day or two.",
            "date": "2010-02-02T14:50:40.751+0000",
            "id": 5
        },
        {
            "author": "Uwe Schindler",
            "body": "Here the latest patch, now committed revision: 906032",
            "date": "2010-02-03T12:39:01.001+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "Thanks Robert for testing!",
            "date": "2010-02-03T12:39:33.463+0000",
            "id": 7
        }
    ],
    "component": "modules/analysis",
    "description": "This patch adds a CharArrayMap<V> to Lucene's analysis package as compagnon of CharArraySet. It supports fast retrieval of char[] keys like CharArraySet does. This is important for some stemmers and other places in Lucene.\n\nStemers generally use CharArrayMap<String>, which has then get(char[]) returning String. Strings are compact and can be easily copied into termBuffer. A Map<String,String> would be slow as the termBuffer would be first converted to String, then looked up. The return value as String is perfectly legal, as it can be copied easily into termBuffer.\n\nThis class borrows lots of code from Solr's pendant, but has additional features and more consistent API according to CharArraySet. The key is always <?>, because as of CharArraySet, anything that has a toString() representation can be used as key (of course with overhead). It also defines a unmodifiable map and correct iterators (returning the native char[]).\n\nCharArraySet was made consistent and now returns for matchVersion>=3.1 also an iterator on char[]. CharArraySet's code was almost completely copied to CharArrayMap and removed in the Set. CharArraySet is now a simple proxy on the keySet().\n\nIn future we can think of making CharArraySet/CharArrayMap/CharArrayCollection an interface so the whole API would be more consistent to the Java collections API. But this would be a backwards break. But it would be possible to use better impl instead of hashing (like prefix trees).",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2247",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Add CharArrayMap to lucene and make CharAraySet an proxy on the keySet() of it",
    "systemSpecification": true,
    "version": ""
}