{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "In my opinion this applies to StandardAnalyzer also (or other non-final analyzers in core)\nOtherwise we can never remove the deprecated setOverridesTokenStreamMethod method.",
            "date": "2009-12-04T20:03:43.063+0000",
            "id": 0
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. In my opinion this applies to StandardAnalyzer also (or other non-final analyzers in core)\nI would +1 this! Yet is is still a BW-Compat break and I doubt that we can do this in 3.1.\n",
            "date": "2009-12-04T20:06:42.484+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "Simon what do you suggest? Instead of breaking in 3.1, should we add a warning 'this will become final in X.Y, please do not subclass it, because it is not a good idea' ???\n\nUwe did some similar thing with making all the TokenStreams final before but I don't remember what the approach was (maybe just a break)",
            "date": "2009-12-04T20:09:05.115+0000",
            "id": 2
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. Simon what do you suggest? Instead of breaking in 3.1\nI suggest to move the core analyzer into a separate issue and link those. That way we can make progress here as the bw policy is not that strict or people do not care that much than they do for core analyzers. I doubt that many people have subclassed StandardAnalyzer and if they do they might do something wrong though. Lets have two issues so we can drive the discussion independently from contrib.\nMy personal feeling is that we should break it in 3.1 lets see what the other devs object.",
            "date": "2009-12-05T20:55:59.507+0000",
            "id": 3
        },
        {
            "author": "Simon Willnauer",
            "body": "This patch marks all analyzers in contrib as final and removes the backwards compat tests checking if subclasses implement reusableTokenStream.",
            "date": "2009-12-05T21:20:18.469+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "Hi Simon, this sounds good to me if we clean up contrib first. There are not many analyzers in core anyway (is it just StandardAnalyzer that is not final?)\n\nMy motivation for those was so we could get rid of the deprecated setOverridesTokenStreamMethod method.\n",
            "date": "2009-12-05T21:40:47.105+0000",
            "id": 5
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. There are not many analyzers in core anyway (is it just StandardAnalyzer that is not final?) \nThree of them:\n * StandardAnalyzer\n * KeywordAnalyzer\n * PerFieldAnalyzerWrapper\n\nbq. My motivation for those was so we could get rid of the deprecated setOverridesTokenStreamMethod method.\n+1 this make me mad each time I look at those analyzers",
            "date": "2009-12-05T21:45:13.157+0000",
            "id": 6
        },
        {
            "author": "Simon Willnauer",
            "body": "I plan to commit this until 12/09/09 if nobody objects",
            "date": "2009-12-07T09:40:39.739+0000",
            "id": 7
        },
        {
            "author": "Simon Willnauer",
            "body": "will commit this tomorrow if nobody objects",
            "date": "2009-12-08T18:39:52.498+0000",
            "id": 8
        },
        {
            "author": "Robert Muir",
            "body": "+1 \n\n(just my nitpick of s/TokenStreamsm/TokenStreams/ typo in CHANGES...)\n\nThanks!",
            "date": "2009-12-08T18:51:02.617+0000",
            "id": 9
        },
        {
            "author": "Robert Muir",
            "body": "Simon, if you want I will take care of contrib/collation tomorrow. This might make things simpler because  I plan on moving it around if no one objects to the patch: LUCENE-2124 has details.\n",
            "date": "2009-12-08T19:17:24.233+0000",
            "id": 10
        },
        {
            "author": "Simon Willnauer",
            "body": "Updated to latest trunk",
            "date": "2009-12-09T13:26:12.170+0000",
            "id": 11
        },
        {
            "author": "Robert Muir",
            "body": "patch looks good to me!",
            "date": "2009-12-09T13:31:29.790+0000",
            "id": 12
        },
        {
            "author": "Simon Willnauer",
            "body": "committed in revision 888799\n\nthanks robert for review",
            "date": "2009-12-09T13:32:55.122+0000",
            "id": 13
        },
        {
            "author": "Esmond Pitt",
            "body": "Did somebody implement this for 3.1.0? StandardAnalyzer became final between 3.0.3 and 3.1.0. This is *not acceptable.* Binary compatibility must be preserved and to be frank I do not give a good goddam how ugly the code inside looks compared to this requirement.",
            "date": "2011-05-17T03:44:55.819+0000",
            "id": 14
        },
        {
            "author": "Steve Rowe",
            "body": "Hi Esmond,\n\nTake a look at [the source code for StandardAnalyzer|http://svn.apache.org/viewvc/lucene/dev/tags/lucene_solr_3_1/lucene/src/java/org/apache/lucene/analysis/standard/StandardAnalyzer.java?view=markup].  Fewer than 50 lines of code there, if you take out the comments.  Copy/paste suddenly seems doable.  Lucene's Analyzers are best thought of as examples.\n\nSteve",
            "date": "2011-05-17T04:13:45.168+0000",
            "id": 15
        },
        {
            "author": "Esmond Pitt",
            "body": "Steve\n\nThanks. Maybe you could have a look at this. How do you suggest I recode it?\nI wrote this 7 years ago and cannot now remember anything about it. Quite\npossibly the entire thing is now obsolete, but I've been carting it around\nsince before Lucene was even at Apache. All I've ever done is adjust the\nversion number.\n\n==========================================================\npublic class PorterStemAnalyzer extends StandardAnalyzer\n{\n\t/**\n\t * Construct a new instance of PorterStemAnalyzer.\n\t */\n\tpublic PorterStemAnalyzer()\n\t{\n\t\tsuper(Version.LUCENE_30);\n\t}\n\n\t@Override\n\tpublic final TokenStream tokenStream(String fieldName, Reader\nreader)\n\t{\n\t\treturn new PorterStemFilter(super.tokenStream(fieldName,\nreader));\n\t}\n}\n============================================================\n\nEJP\n\n",
            "date": "2011-05-17T04:27:47.712+0000",
            "id": 16
        },
        {
            "author": "Robert Muir",
            "body": "Esmond: hi, what you are doing here is exactly the reason why we made it final.\n\nBy subclassing StandardAnalyzer in this way, the indexer is no longer able to reuse tokenstreams, making analysis very slow and inefficient.\n\nThe easiest way to get your PorterStemAnalyzer is to just use EnglishAnalyzer, which does just this.\n\nOtherwise if you really want to do it yourself, do it like this:\n{noformat}\nAnalyzer analyzer = new ReusableAnalyzerBase() {\n  protected TokenStreamComponents createComponents(String fieldName, Reader reader) {\n    Tokenizer tokenizer = new StandardTokenizer(...);\n    TokenStream filteredStream = new StandardFilter(tokenizer, ...);\n    filteredStream = new LowerCaseFilterFilter(filteredStream, ...);\n    filteredStream = new StopFilterFilter(filteredStream, ...);\n    filteredStream = new PorterStemFilter(filteredStream, ...);\n    return new TokenStreamComponents(tokenizer, filteredStream);\n  }\n};\n{noformat}\n\nPlease see LUCENE-3055 for more examples and a more thorough explanation.\n\nThe good news is if you implement your analyzer like this, you will see performance improvements!\n",
            "date": "2011-05-17T04:37:25.550+0000",
            "id": 17
        },
        {
            "author": "Esmond Pitt",
            "body": "Many thanks. \n\n",
            "date": "2011-05-17T04:47:47.868+0000",
            "id": 18
        },
        {
            "author": "l0co",
            "body": "A little comment from me, because I just need to use this.\n\nI'm wondering why people in opensource projects so much like to complicate simple things and like to break the rules of OOP, making a lot obstacles for users, like package visibility, almost everything private, and making final classes or methods. This just prevents to quick use the existing code, override class and make anything you want with this the existing code.\n\nIt looks that this is because we should only use existing code, but not to change it any way, right?\n\nI want to use PolishAnalyzer, which is already implemented, and add a simple improvement to this class, but I cannot do it now. I need to copy all existing class to my package and write there the extension.\n\nGreat \"improvement\" for me in this ticket.",
            "date": "2013-02-28T14:23:57.608+0000",
            "id": 19
        }
    ],
    "component": "modules/analysis",
    "description": "The analyzers in contrib/analyzers should all be marked final. None of the Analyzers should ever be subclassed - users should build their own analyzers if a different combination of filters and Tokenizers is desired.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2100",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Make contrib analyzers final",
    "systemSpecification": true,
    "version": "1.9, 2.0.0, 2.1, 2.2, 2.3, 2.3.1, 2.3.2, 2.4, 2.4.1, 2.9, 2.9.1, 3.0"
}