{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "Is there any eclipse plugin/refactoring/cleanup that helps when doing this? Cannot find anything :-(",
            "date": "2009-11-10T23:58:13.612+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "Here a patch that adds more varargs where it makes sense (e.g. MultiSearcher ctor to pass Searchables, adding more than one sub query, merge boolean queries and so on - everywhere, where the array is not the meaning but more a unlimited list of parameters).\n\nIf somebody finds something in addition, speak load!",
            "date": "2009-11-13T23:31:28.376+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Updated patch, as there may be a backwards comp problem (but only if you recompile!) if you try to override a varargs method with an array param (which is not possible). Removed the varargs from docFreq(Term[]) because of that again.\n\nAlso added changes.txt.",
            "date": "2009-11-13T23:49:29.544+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "uwe, here is one i found that got skipped in LUCENE-1987",
            "date": "2009-11-14T04:47:01.028+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Thanks, I didn't check contrib.",
            "date": "2009-11-14T08:02:58.394+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "bq. Thanks, I didn't check contrib.\n\nI didn't really completely check, not sure really where we should have varargs there.\n(it does not make sense for stopwords to me, but then I feel all we need is Set<?> instead of file, varargs, hashtable, and all the other constructors we have)\n\nstill i'd rather have consistency for now.",
            "date": "2009-11-14T09:18:00.229+0000",
            "id": 5
        },
        {
            "author": "Uwe Schindler",
            "body": "Yes, that's right. For stopwords a varargs ctor is not really \"the right thing\". Varargs are more for cases like instantiating a MultiReader with 5 IndexReaders or something like that. Or adding a bunch of clauses to a SpanQuery.\nThe varargs Set<?> is one unit, arrays are not needed (they are there because of BW compatibility). All these ctors except Set<?> should have been deprecated in 2.9.",
            "date": "2009-11-14T09:31:37.395+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 836248",
            "date": "2009-11-14T19:27:45.524+0000",
            "id": 7
        }
    ],
    "component": "",
    "description": "I changed a lot of signatures, but there may be more. The important ones like MultiReader and MultiSearcher are already done. This applies also to contrib. Varargs are no backwards break, they stay arrays as before.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2052",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Scan method signatures and add varargs where possible",
    "systemSpecification": true,
    "version": "3.0"
}