{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "Patch with a heavy improved version of solrs macros, I changed:\n\n- For security reasons, the password is not passed through command line (you can see it with \"ps \\-ef\" !!!). Also \"\\-\\-passphrase\" does not work with newer 2.x versions of gpg. The correct way is the same as in Mike McCandless Python script to pass \"\\-\\-passphrase-fd 0\" (then it read the passphrase from stdin), piping in the password using the \"inputstring\" task attribute of ant.\n- added \"\\-\\-batch\" parameter to gpg. Without, in GUI environments it ignores the passed-in password and uses gpg-agent\n- no manual signing of every file, it uses the <apply> ant task that starts a process for every file in a fileset and also supplies a source -> desfilename mapping (which appends \".asc\")\n- add \"\\-\\-default-key\" with a default value of \"CODE SIGNING KEY\", you can override with \"\\-Dgpg.key=YourHexKeyOrEmail\"\n\nThe only problem is that <appy> does not print the command lines or some filelist. You only get a message at the end that \"applied 'gpg' to x files\", which is fine.\n\nUsage:\n{code}\nant sign-artifacts -Dgpg.exe=/path/to/gpg -Dgpg.key=YourHexKeyOrEmail -Dgpg.passphrase=12345\n{code}\nAll parameters are optional, defaults are:\n{code}\ngpg.exe = \"gpg\"\ngpg.key = \"CODE SIGNING KEY\"\ngpg.passphrase = <none>, if not given, you are asked to input\n{code}",
            "date": "2010-02-18T14:17:41.304+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "I forgot, the target has no dependencies on maven run before or dist-src/bin. You have to run dist-src, dist-bin and generate-maven-artifacts before, esle it would simply sign no files, or more it would break, because dist-folder does not exist",
            "date": "2010-02-18T14:21:42.801+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Updated patch that needs only requires  trunk's minimum ANT version 1.7.0. Secure password input is only available, if ant >= 1.7.1 and java 6 is used.",
            "date": "2010-02-18T15:06:28.399+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 912115",
            "date": "2010-02-20T14:04:53.571+0000",
            "id": 3
        }
    ],
    "component": "",
    "description": "Solr has nice artifact signing scripts in its common-build.xml and build.xml.\n\nFor me as release manager of 3.0 it would have be good to have them also when building lucene artifacts. I will investigate how to add them to src artifacts and maven artifacts",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2267",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Add solr's artifact signing scripts into lucene's build.xml/common-build.xml",
    "systemSpecification": true,
    "version": "2.9.2, 3.0.1"
}