{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "I'd like to commit this later today if there aren't any objections (its just boring cleanup).\n\nAs far as 3.1, i rethought the issue, and i think e.g. DisjunctionMaxQuery should really work with LUCENE-2590.\n\nSo i'll look at fixing trying to pass non-null weight in 3.x too, i think users will see it as a bug...\n",
            "date": "2011-01-20T12:12:29.699+0000",
            "id": 0
        },
        {
            "author": "Doron Cohen",
            "body": "Patch looks good. \n\n+1 for this cleanup which removes calls with null arg and comment {\"//similarity not in use\"}. \n\nSome minor comments:\n\n* jdoc: in some of the scorer constructors a Weight param was added but existing jdocs for the costructor which document (some) params was not updated to also mention the weight. I am not 100% sure this should be fixed, as there is inconsistency in the level of jdoc for scorer implementations. So if there were no jdocs at all there I would say nothing, but since there were some now they became less complete...\n* ExactPhraseScorer is created with both Weight and Similarity - I think the Similarity param can be removed as part of this cleanup.\n* Same for SloppyPhraseScorer, PhraseScorer, SpanScorer, TermScorer, MatchAllDocsScorer - Similarity param can be removed. \n \nOne question not related to this patch - just saw it  reviewing:\n\n* it is interesting that SloppyPhraseScorer now extends PhraseScorer but ExactPhraseScorer does not, is this on purpose? Perhaps related do Mike's recent optimizations in this scorer?",
            "date": "2011-01-20T13:15:01.443+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "Thanks for the review Doron!\n\nbq. jdoc: in some of the scorer constructors a Weight param was added but existing jdocs for the costructor which document (some) params was not updated to also mention the weight. I am not 100% sure this should be fixed, as there is inconsistency in the level of jdoc for scorer implementations. So if there were no jdocs at all there I would say nothing, but since there were some now they became less complete...\n\nI'll fix this, thanks!\n\n{quote}\nExactPhraseScorer is created with both Weight and Similarity - I think the Similarity param can be removed as part of this cleanup.\nSame for SloppyPhraseScorer, PhraseScorer, SpanScorer, TermScorer, MatchAllDocsScorer - Similarity param can be removed.\n{quote}\n\nThese still need the Similarity param? They use it in scoring, its just they don't pass it to the superclass constructor (Scorer's constructor).\n\nIts possible I misunderstood your idea though. Lets take the TermQuery example, are you suggesting that \nwe should expose TermWeight's \"Similarity\" and just pass TermWeight to TermScorer (requiring TermScorer\nto take a TermWeight in its ctor instead of Weight + Similarity?) Currently TermWeight's local copy of \nSimilarity, which it uses to compute IDF, is private.\n\nbq. it is interesting that SloppyPhraseScorer now extends PhraseScorer but ExactPhraseScorer does not, is this on purpose? Perhaps related do Mike's recent optimizations in this scorer?\n\nYes, that's correct. Just at a glance he might have done this so that ExactPhraseScorer can compute a \nscore cache like TermScorer, and other similar optimizations since the \"tf\" values are really integers for \nthis exact case. \n\nIt might be that if we look at splitting calculations and matching out from Scorer, that we can make\nthese \"matchers\" like ExactPhrase/SloppyPhrase simpler, and we could then clean up... not sure though!\n",
            "date": "2011-01-20T13:31:29.022+0000",
            "id": 2
        },
        {
            "author": "Doron Cohen",
            "body": "{quote}\nThese still need the Similarity param? They use it in scoring, its just they don't pass it to the superclass constructor (Scorer's constructor).\n... Currently TermWeight's local copy of Similarity, which it uses to compute IDF, is private.\n{quote}\n\nYou're right, I was for some reason under the impression that part of the reason for the change is that Weight already exposes Similarity but it is not, and I think it shouldn't, so current patch is good here.",
            "date": "2011-01-20T13:43:38.445+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "bq. You're right, I was for some reason under the impression that part of the reason for the change is that Weight already exposes Similarity but it is not, and I think it shouldn't, so current patch is good here.\n\nYes, mainly it was just to correct the inconsistencies:\n* the base class does nothing with Similarity, and its often null, so i don't think it needs to know about it.\n* the base class does however, provide functionality that depends on Weight, and I think it should be non-null to support that. We might want to expand on this functionality in the future too.\n\nI wish i could have thrown IAE on null Weight (I did this to find all scorers that did not comply), but there is again\nthe one ValueSourceScorer in Solr that isn't easily fixed... at least the patch creates more consistency.\n\nI'll review all javadocs for the scorers, and try to make sure the param documentation is up to date.\n\nThanks again for taking the time to review these scoring issues.\n",
            "date": "2011-01-20T14:05:24.786+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "Updated patch: with javadocs inconsistencies corrected.",
            "date": "2011-01-20T14:27:19.620+0000",
            "id": 5
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 1061499.\n\nWill work on adding the @deprecated and fixing javadocs and null Weights in branch_3x,\nbut we need to provide Similarity where we were providing it before for backwards compatibility.\n",
            "date": "2011-01-20T20:39:05.550+0000",
            "id": 6
        },
        {
            "author": "Robert Muir",
            "body": "backported to 3.x: revision 1061615.",
            "date": "2011-01-21T03:51:07.094+0000",
            "id": 7
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:49:57.669+0000",
            "id": 8
        }
    ],
    "component": "core/query/scoring",
    "description": "Originally this was part of the patch for per-field Similarity (LUCENE-2236), but I pulled it \nout here as its own issue as its really mostly unrelated. I also like it as a separate issue \nto apply the deprecation to branch_3x to just make less surprises/migration hassles for 4.0 users.\n\nCurrently Scorer takes a confusing number of ctors, either a Similarity, or a Weight + Similarity.\nAlso, lots of scorers don't use the Similarity at all, and its not really needed in Scorer itself.\nAdditionally, the Weight argument is often null. The Weight makes sense to be here in Scorer, \nits the parent that created the scorer, and used by Scorer itself to support LUCENE-2590's features.\nBut I dont think all queries work with this feature correctly right now, because they pass null.\n\nFinally the situation gets confusing if you start to consider delegators like ScoreCachingWrapperScorer,\nwhich arent really delegating correctly so I'm unsure features like LUCENE-2590 aren't working with this.\n\nSo I think we should remove the getSimilarity, if your scorer uses a Similarity its already coming\nto you via your ctor from your Weight and you can manage this yourself.\n\nAlso, all scorers should pass the Weight (parent) that created them, and this should be Scorer's only ctor.\nI fixed all core/contrib/solr Scorers (even the internal ones) to pass their parent Weight, just for consistency\nof this visitor interface. The only one that passes null is Solr's ValueSourceScorer.\n\nI set fix-for 3.1, not because i want to backport anything, only to mark the getSimilarity deprecated there.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2876",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Remove Scorer.getSimilarity()",
    "systemSpecification": true,
    "version": ""
}