{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Cool idea!",
            "date": "2011-05-19T21:24:03.687+0000",
            "id": 0
        },
        {
            "author": "Shai Erera",
            "body": "Hmm, that got me thinking -- what if someone adds a CFS segment to IW, where IW's MP sets cfs=off? Should we consider it a violation (that's what happens today if you try it)? I personally think that this is not a common (or even expected) scenario, and therefore javadocs is enough, but if others think this is a violation, then we should fix it - we'll need to 'open' the CFS into its individual files.",
            "date": "2011-05-20T09:06:33.141+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "Seems like we should split open the CFS in this case?  Though, I don't think it's super-important to do this... it ought to be rare?",
            "date": "2011-05-20T10:00:29.213+0000",
            "id": 2
        },
        {
            "author": "Shai Erera",
            "body": "Patch includes:\n* Modify CFW to not assume the files it 'merges' into a CFS exist in the same Directory as it was initialized with + test\n* Modify SegmentMerger following CFW updates + test\n* Modify IW to copy a segment into a CFS + test.\n\nNOTES:\n* I did not cover 'unrolling' a CFS if the MP does not support CFS. I don't think it's so critical (left a TODO in TestAddIndexes)\n* About shared doc stores -- I'd appreciate a review of this. Since we don't do shared doc stores anymore, I don't know how to simulate it for the test.",
            "date": "2011-05-23T12:32:56.442+0000",
            "id": 3
        },
        {
            "author": "Shai Erera",
            "body": "Patch does not handle all files well (few tests fail). Apparently, the .del file should not be rolled into the .cfs. SegmentMerger.createCompoundFile does this by default, however it's only called from code that ensures no deletions exist. Would have been nice if this method documented it :).\n\nAlso, I think *.s<num> should not be rolled into .cfs (those are the separate norms files). I don't know how to create such files in the first place (thought they're of old format, but 3.1 indexes have them also), and TestBackCompat fails. Is there a way to identify those files? Is it safe to check if the file extension starts w/ IndexFileNames.SEPARATE_NORMS_EXTENSION? Feels hacky to me.\n\nAnother thing, I think in order to avoid shared doc stores (and whatever other old-format) stuff, since it's only an optimization, that the code should copy into CFS only if the segment version is on or after 3.1 (that is StringHelper.getVersionComparator().compare(info.getVersion, \"3.1\") >= 0).\n\nI think I'm close to finish it, just need to figure out the separate norms thing.",
            "date": "2011-05-23T15:05:52.717+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "\nbq. Patch does not handle all files well (few tests fail). Apparently, the .del file should not be rolled into the .cfs.\n\nRight, .del files never appear inside a CFS.\n\nbq. SegmentMerger.createCompoundFile does this by default, however it's only called from code that ensures no deletions exist. Would have been nice if this method documented it .\n\nPlease add comments to this!  It's non-obvious ;)\n\nbq. Also, I think *.s<num> should not be rolled into .cfs (those are the separate norms files). I don't know how to create such files in the first place (thought they're of old format, but 3.1 indexes have them also), and TestBackCompat fails.\n\nRight, these too only live outside a CFS.  You create them by opening a writable IndexReader (I know: confusing!) and calling setNorm, then closing it.  They are not only for old indices... 4.0 creates them too.\n\nbq. Is there a way to identify those files? Is it safe to check if the file extension starts w/ IndexFileNames.SEPARATE_NORMS_EXTENSION? Feels hacky to me.\n\nHackish though it seems (I agree) I think that's the only way?  SegmentInfo.hasSeparateNorms is equally hacky...\n\nbq. Another thing, I think in order to avoid shared doc stores (and whatever other old-format) stuff, since it's only an optimization, that the code should copy into CFS only if the segment version is on or after 3.1 (that is StringHelper.getVersionComparator().compare(info.getVersion, \"3.1\") >= 0).\n\nShared doc stores, yes, but the separate del docs / norms are produced by all versions.\n\nMore generally: does addIndexes properly refuse to import a too-old index?  We should throw IndexFormatTooOldExc in this case?  (And, maybe also IndexFormatTooNewExc?).\n",
            "date": "2011-05-23T18:59:41.333+0000",
            "id": 5
        },
        {
            "author": "Shai Erera",
            "body": "bq. Right, these too only live outside a CFS. You create them by opening a writable IndexReader (I know: confusing!) and calling setNorm, then closing it. They are not only for old indices... 4.0 creates them too.\n\nThanks Mike ! I was able to reproduce it and fix it (+ add to test). Are there other files that are normally created outside the .cfs? I've seen sometimes that the stored fields of CFS are created outside. Was it only for shared doc stores?\n\nbq. More generally: does addIndexes properly refuse to import a too-old index? We should throw IndexFormatTooOldExc in this case? (And, maybe also IndexFormatTooNewExc?).\n\nNot today. I believe it will fail in later stages (e.g. commit()), but we better fail up front. I think it's a separate issue though, only for 4.0 (b/c 3x supports all formats today)?",
            "date": "2011-05-24T13:47:43.219+0000",
            "id": 6
        },
        {
            "author": "Shai Erera",
            "body": "Patch w/ all fixes. Tests pass. No CHANGES entry yet, I'll add it in the next patch (after some comments).",
            "date": "2011-05-24T14:12:56.441+0000",
            "id": 7
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Are there other files that are normally created outside the .cfs? I've seen sometimes that the stored fields of CFS are created outside. Was it only for shared doc stores?\n\nI think just separate norms (_N.sM) and deletions (_N.del) live\noutside CFS?  Yes, only w/ shared doc stores did the shared doc store\nfiles live outside cfs...\n\n{quote}\nbq. More generally: does addIndexes properly refuse to import a too-old index? We should throw IndexFormatTooOldExc in this case? (And, maybe also IndexFormatTooNewExc?).\n\nNot today. I believe it will fail in later stages (e.g. commit()), but\nwe better fail up front. I think it's a separate issue though, only\nfor 4.0 (b/c 3x supports all formats today)?\n{quote}\n\nOK I see LUCENE-3138 for this... thanks.\n",
            "date": "2011-05-24T15:09:30.346+0000",
            "id": 8
        },
        {
            "author": "Michael McCandless",
            "body": "Patch looks good!\n\nMaybe we should add asserts to SegmentMerger.createCompoundFile, that SI.files() did not return del/separate norms?  I don't like the ambiguity here... and then strengthen the comment saying SI.files should never return these in this context?  Hopefully this does not cause any test files!  (We can do this as a separate issue...).",
            "date": "2011-05-24T15:18:41.191+0000",
            "id": 9
        },
        {
            "author": "Shai Erera",
            "body": "bq. Maybe we should add asserts to SegmentMerger.createCompoundFile, that SI.files() did not return del/separate norms?\n\nLet's do that in a separate issue? I'll also remove the comment from SM in this issue, and upload it to the other one (after I open it :)). Keep this issue focused on IW.addIndexes.",
            "date": "2011-05-25T11:32:04.058+0000",
            "id": 10
        },
        {
            "author": "Shai Erera",
            "body": "Committed revision 1127871 (trunk).\nCommitted revision 1127872 (3x).",
            "date": "2011-05-26T11:16:56.818+0000",
            "id": 11
        },
        {
            "author": "Robert Muir",
            "body": "Bulk closing for 3.2",
            "date": "2011-06-03T16:37:09.886+0000",
            "id": 12
        }
    ],
    "component": "core/index",
    "description": "Today, IW.addIndexes(Directory) does not modify the CFS-mode of the incoming segments. However, if IndexWriter's MP wants to create CFS (in general), there's no reason why not turn the incoming non-CFS segments into CFS. We anyway copy them, and if MP is not against CFS, we should create a CFS out of them.\n\nWill need to use CFW, not sure it's ready for that w/ current API (I'll need to check), but luckily we're allowed to change it (@lucene.internal).\n\nThis should be done, IMO, even if the incoming segment is large (i.e., passes MP.noCFSRatio) b/c like I wrote above, we anyway copy it. However, if you think otherwise, speak up :).\n\nI'll take a look at this in the next few days.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3126",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "IndexWriter.addIndexes can make any incoming segment into CFS if it isn't already",
    "systemSpecification": true,
    "version": ""
}