{
    "comments": [
        {
            "author": "Karl Wettin",
            "body": "Oups, prior patch contained some other stuff too by misstake.",
            "date": "2007-10-02T21:42:21.645+0000",
            "id": 0
        },
        {
            "author": "Karl Wettin",
            "body": "TanimotoDocumentSimilarity, depends on TermVectorAccessor,  used to calculate the distance between the vector space of two documents.\n\nMy math skills are pretty lame, but I think I got it right.",
            "date": "2007-10-02T23:29:21.353+0000",
            "id": 1
        },
        {
            "author": "Karl Wettin",
            "body": "I think a kD-tree will be the next step here. Does that fit in this project, or is that something I should post in UIMA or so?",
            "date": "2007-10-02T23:59:44.541+0000",
            "id": 2
        },
        {
            "author": "Grant Ingersoll",
            "body": "Java 1.5 -> Java 1.4  :-(\n\nSoon, very soon (in Lucene terms), we will have 1.5",
            "date": "2007-10-03T00:40:39.082+0000",
            "id": 3
        },
        {
            "author": "Karl Wettin",
            "body": "Grant Ingersoll - 02/Oct/07 05:40 PM\n> Java 1.5 -> Java 1.4\n>\n> Soon, very soon (in Lucene terms), we will have 1.5\n\nThis is why I placed it in contrib/misc, I was under the impression contrib allowed 1.5?",
            "date": "2007-10-03T00:44:46.637+0000",
            "id": 4
        },
        {
            "author": "Karl Wettin",
            "body": "Also, don't pay too much attention at the quite ugly code in TanimotoDocumentSimilarity. I'll post something nice and refactored soon. I was just really thrilled that I managed to figure out all them greek characters in the whitepaper.",
            "date": "2007-10-03T05:53:15.048+0000",
            "id": 5
        },
        {
            "author": "Karl Wettin",
            "body": "Sorry for flooding. This JIRA issue is sort of turning more off topic for each post.. I hope you don't mind.\n\nLUCENE-1016-clusterer.txt now contains a refactor of the Tanimoto similarity, it does the same thing, but with less messy code. \n\nAnd as the filename hints, I thought it would be fun to demonstrate the similarity by adding a very simple two dimensional decision tree clusterer.\n\nFor the test I feed it with 17 news articles representing 3 news stories I got from Google news. Attached is also a graphviz diagram that shows the tree with the news stories clustered together. I did not look at how to draw the line between the clusters yet, but I could probably come up with something simple enough. Legend: floating numbers represents the distance between two children. The leafs are the actual articles, prefixed with new story identity and suffixed with news article identity.\n\n(The clusterer sure needs optimization, use carrot instead. This is just me fooling aroung.)\n\nHave fun!",
            "date": "2007-10-03T07:49:16.526+0000",
            "id": 6
        },
        {
            "author": "Karl Wettin",
            "body": "TermVectorMapper should probably also be able to extract the term vector from a document prior to it beeing indexed. That was the original reason for me to introduce tokenStreamValue(). However, I suppose there could probably be problems with token streams and readers beeing exhausted.",
            "date": "2007-10-03T19:52:23.492+0000",
            "id": 7
        },
        {
            "author": "Karl Wettin",
            "body": "Karl Wettin - 03/Oct/07 12:52 PM\n> TermVectorMapper should probably also be able..\n\nTermVectorAccessor, that is.",
            "date": "2007-10-03T19:57:38.966+0000",
            "id": 8
        },
        {
            "author": "Karl Wettin",
            "body": "This patch:\n\n * All Java 1.4\n * Bugfix, could throw a nullexception in some cases before\n\nThis patch is TermVectorAccessor code only, nothing else.",
            "date": "2007-10-08T12:03:10.645+0000",
            "id": 9
        },
        {
            "author": "Karl Wettin",
            "body": "In this patch:\n\n* Java 1.4 for real\n\nAnd then I removed everything that had nothing to do with this patch.",
            "date": "2007-10-30T07:28:06.557+0000",
            "id": 10
        },
        {
            "author": "Grant Ingersoll",
            "body": "oops, yes.  My bad.  I missed that part.\n\n\n\n\n\n",
            "date": "2007-11-03T05:42:21.004+0000",
            "id": 11
        },
        {
            "author": "Karl Wettin",
            "body": "I would not touch this issue until LUCENE-1038 has been accepted or declined.",
            "date": "2007-11-03T12:37:29.846+0000",
            "id": 12
        },
        {
            "author": "Karl Wettin",
            "body": "Now with support for mapper.setDocumentNumber as defined in LUCENE-1038",
            "date": "2007-11-04T01:42:12.409+0000",
            "id": 13
        },
        {
            "author": "Karl Wettin",
            "body": "I think this is interesting:\n\nhttp://www.nabble.com/How-to-generate-TermFreqVector-from-an-existing-index-tf4756257.html#a13601345\n\nI'll have to look in to the file format and see if it is possible to persist a term vector retreived from the inverted index. That could be a nice addition to this issue.",
            "date": "2007-11-06T18:21:24.033+0000",
            "id": 14
        },
        {
            "author": "Grant Ingersoll",
            "body": "I'm curious if the build part of this would be faster than reanalyzing a document.  Just thinking outloud, but I have wondering about a Highlighter that uses the new TermVectorMapper, but using that doesn't account for non-TermVector based Documents that need to be analyzed.  Was thinking this might account for both cases, all through the TermVectorMapper mechanism.  Just doesn't seem like it would be very fast.",
            "date": "2008-01-14T22:51:32.974+0000",
            "id": 15
        },
        {
            "author": "Karl Wettin",
            "body": "{quote}\nI'm curious if the build part of this would be faster than reanalyzing a document.\n{quote}\n\nIt is a slow process on an index with many terms. Each one has to be iterated and mached against the document number.\n\n{quote}\nJust thinking outloud, but I have wondering about a Highlighter that uses the new TermVectorMapper, but using that doesn't account for non-TermVector based Documents that need to be analyzed. Was thinking this might account for both cases, all through the TermVectorMapper mechanism. Just doesn't seem like it would be very fast.\n{quote}\n\nThis patch is mostly about when you don't have access to the source data. It was used together with a TermVectorMappingCachedTokenStreamFactory to extract re-indexable documents from any directory.\n\nIf you think of this peice of code and highlighter together, I would consider something else, perhaps a tool that could add the term vector to all documents missing one in a single iteration sweep of the index. I know very little about the file format and the highlighter though.\n\n",
            "date": "2008-01-15T06:28:36.167+0000",
            "id": 16
        },
        {
            "author": "Karl Wettin",
            "body": "Documentation",
            "date": "2008-08-24T12:17:09.344+0000",
            "id": 17
        },
        {
            "author": "Karl Wettin",
            "body": "I'll commit this soon.",
            "date": "2008-08-24T12:17:32.437+0000",
            "id": 18
        },
        {
            "author": "Michael McCandless",
            "body": "Looks like you have this one Karl...thanks!",
            "date": "2008-08-25T09:50:40.719+0000",
            "id": 19
        }
    ],
    "component": "core/termvectors",
    "description": "This class visits TermVectorMapper and populates it with information transparent by either passing it down to the default terms cache (documents indexed with Field.TermVector) or by resolving the inverted index.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-1016",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "TermVectorAccessor, transparent vector space access ",
    "systemSpecification": true,
    "version": "2.2"
}