{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "attached is a patch, then lucene core/contrib is ok.\n\nBut Solr has some failures that must be investigated.\n\nIf no one objects I would like to commit this first and backport, then investigate those.",
            "date": "2010-05-17T14:26:08.375+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "attached is a patch that fixes the tests for solr, too.\n\n* I added StrUtils.ROOT_LOCALE, but we could probably use Locale.ENGLISH just fine too, this is just me being nitpicky.\n* commons-codec fixed this in their 1.4 release, so i upgraded to 1.4 (not in patch, obviously) so that DoubleMetaphoneFilter etc pass also.\n* besides lowercasing, Solr uses uppercasing in a lot of places... in my opinion we should review why it is doing this.\n* I didnt change SolrQueryParser, similar problems exist in Lucene's QueryParser (strange casing) and thats for another day.\n\nSomeone should review the Solr stuff, as I don't think i necessarily present the best solution but just indicate where the problems are.\n\n",
            "date": "2010-05-17T15:48:36.352+0000",
            "id": 1
        },
        {
            "author": "Yonik Seeley",
            "body": "Awesome!  If we can get the tests to pass with these different locales, commit it!  When in doubt, we should not be sensitive to locale.\n\nbq. I didnt change SolrQueryParser, similar problems exist in Lucene's QueryParser (strange casing)\n\nThe QP shouldn't currently be an issue for solr, we never set the flags to do lowercasing (I've always been against it as the right solution is field specific, not parser specific).\n",
            "date": "2010-05-17T16:09:55.545+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "here is a cleaned up patch, using Locale.ENGLISH, that fixes the casing problems.\n\n* Note the use of Locale.ENGLISH is not an affront to non-english users, it just forces consistent casing behavior and is already defined as a constant.\n\nI plan to commit soon (trunk/stable), and then look at the unrelated separate failures for Thai:\nset ANT_ARGS=\"-Dargs=-Duser.language=th -Duser.country=TH -Duser.variant=TH\"\n\nI suspect much of these failures are due to date handling.\n\nWe might want to devise a plan to help test this stuff, either let Hudson pick a different locale each night, maybe just from the \"troublesome ones\", and/or do something similar to the LocalizedTestCase in lucene (but this can cause tests to be very slow).\n",
            "date": "2010-05-17T17:16:45.302+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "Committed 945245 (trunk) /945270 (3x) for the casing problems.",
            "date": "2010-05-17T17:45:36.596+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "attached patch fixes trunk for the thai locale.\n\ndoesnt need to be merged as the tests don't exist in 3x, i created this problem :(",
            "date": "2010-05-17T17:57:57.864+0000",
            "id": 5
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 945274 for the lucene wildcard/regex tests.\n\nI will look at the solr problems under this locale now, they probably need to be merged to 3x also.",
            "date": "2010-05-17T17:59:30.867+0000",
            "id": 6
        },
        {
            "author": "Robert Muir",
            "body": "I talked to Hoss Man about some of these date problems, and he was of the opinion that for Solr, the Locale should never be used for date parsing/formatting (only standard UTC/Locale.US). So these are easy to fix.\n\nBut there is another problem, in this case the formats of floats themselves. Should they follow the same rule in Solr, or should localized numerics formats be supported? \n\n{noformat}\n   [junit] Caused by: java.lang.NumberFormatException: For input string: \"<some thai digits here>\"\n   [junit]     at sun.misc.FloatingDecimal.readJavaFormatString(FloatingDecimal.java:1224)\n   [junit]     at java.lang.Float.parseFloat(Float.java:422)\n   [junit]     at org.apache.solr.util.NumberUtils.float2sortableStr(NumberUtils.java:79)\n   [junit]     at org.apache.solr.schema.SortableFloatField.toInternal(SortableFloatField.java:49)\n   [junit]     at org.apache.solr.schema.FieldType.createField(FieldType.java:236)\n   [junit]     ... 38 more\n   [junit] </result>)\n{noformat}\n\nFurthermore, what about DataImportHandlers use of some of the same DateMathParser stuff used in other places in Solr? It tends to use TimeZone.getDefault/Locale.getDefault... should this be changed?\n",
            "date": "2010-05-17T19:22:48.142+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "attached is a patch with some modifications to Solr, adding missing Locale.US params etc, following Hoss Man's rule.\n\nI am still nervous about DIH (i didnt touch it) but this makes all the tests pass under th_TH_TH.",
            "date": "2010-05-17T19:47:39.029+0000",
            "id": 8
        },
        {
            "author": "Yonik Seeley",
            "body": "IMO, there's nothing in Solr that should depend on the system locale unless explicitly referenced or configured to do so. The defaults should certainly never do so.\n\nHoss pointed out this in DIH:\nhttp://wiki.apache.org/solr/DataImportHandler#NumberFormatTransformer\nAt a minimum I think this should be changed in trunk to not default to the system locale.\n\nAnyway, my communication will be limited over the next week starting tomorrow (Apache Lucene EuroCon)...\nso here's my standing +1 to commit all changes that remove system locale defaults.",
            "date": "2010-05-17T20:08:03.196+0000",
            "id": 9
        },
        {
            "author": "Robert Muir",
            "body": "Committed LUCENE-2466_thai_solr.patch 945343 (trunk) / 945353 (3x)",
            "date": "2010-05-17T20:37:58.029+0000",
            "id": 10
        },
        {
            "author": "Robert Muir",
            "body": "I ran a few more locales, no more failures... I think we found the worst problems.",
            "date": "2010-05-17T20:51:11.314+0000",
            "id": 11
        },
        {
            "author": "Robert Muir",
            "body": "setting fix versions correctly here.\n\nhappy to backport this stuff to 1.4.1 if desired.",
            "date": "2010-06-01T19:01:03.559+0000",
            "id": 12
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:50:03.063+0000",
            "id": 13
        }
    ],
    "component": "",
    "description": "set ANT_ARGS=\"-Dargs=-Duser.language=tr -Duser.country=TR\"\nant clean test\n\nWe should make sure this works across all of lucene/solr",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2466",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "fix some more locale problems in lucene/solr",
    "systemSpecification": true,
    "version": ""
}