{
    "comments": [
        {
            "author": "Yonik Seeley",
            "body": "typo in original (used reader instead of key)",
            "date": "2006-12-19T19:52:49.000+0000",
            "id": 0
        },
        {
            "author": "Chuck Williams",
            "body": "Cool!  This should solve at least part of my problem.  Trying this now (along with finalizer removal patch that is already installed here).  Will report back results.\n\nThanks!\n",
            "date": "2006-12-19T21:25:02.000+0000",
            "id": 1
        },
        {
            "author": "Chuck Williams",
            "body": "This patch, together with LUCENE-750 (already committed) solved our problem completely.  It sped up simultaneous multi-threaded searches with a new ParallelReader against a 1 million item investigation that has a unique id sort field (i.e., 1 million entry FIeldCache must be created) by a factor of 15x.\n\nThanks Yonik!  +1 to commit this.\n",
            "date": "2006-12-19T23:37:26.000+0000",
            "id": 2
        },
        {
            "author": "Yonik Seeley",
            "body": "patch committed.",
            "date": "2006-12-20T03:48:15.000+0000",
            "id": 3
        },
        {
            "author": "Oliver Hutchison",
            "body": "Chuck and whoever else got burned by this - really big apology for letting that typo slip into my patch :-( Unfortunately because I was constrained to use a release version of Lucene I ended up implementing a different solution in our production system and obviously I didn't pick up the mistake I'd made in the patch.",
            "date": "2006-12-20T06:05:06.000+0000",
            "id": 4
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Since I was the one who first whined about this leak, I'm just following up to report that this change indeed eliminated the leak.",
            "date": "2006-12-20T16:41:53.000+0000",
            "id": 5
        }
    ],
    "component": "",
    "description": null,
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-754",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "FieldCache keeps hard references to readers, doesn't prevent multiple threads from creating same instance",
    "systemSpecification": true,
    "version": ""
}