{
    "comments": [
        {
            "author": "Basem Narmok",
            "body": "Please see the arabic-stopwords-comments.txt to see my comments on the list, and why/what did I change.\n\nThe patch provides an updated Arabic stopwords file, and modifies ArabicAnalyzer to filter stopwords after the normalization, as the provided list is a normalized Arabic stop words.\n\nBest,",
            "date": "2009-10-08T23:07:39.335+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "Basem, thanks for the patch, and the comments.\n\nOne thing I noticed: if I apply the patch, على (the stopword) will not be filtered as a stopword. This is because it will be normalized to علي (the name).\n\nSo, if we are going to normalize before stopfilter, I think we need to make sure the stopwords do not contain yeh without dots, or else these will not work. This is one example of why I was scared to apply normalization before stopwords, because by doing so, we cause على and علي to conflate.\n\nLet me know what you think about this.\n",
            "date": "2009-10-09T01:04:09.561+0000",
            "id": 1
        },
        {
            "author": "Basem Narmok",
            "body": "Robert, you are correct, to solve the problem we have two options: \n1- to remove words like علي and وفي\n2- to use unnormalized stiowirds list, before the normalization filter.\n\nI think the best is the second option, so this patch only modifies the list (unnormalized), please try it.",
            "date": "2009-10-11T09:36:35.618+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "Basem, thanks. I like the new list.\n\nI have one very minor question: in the list we have أيضا / ايضا twice.\n\nI wanted to check with you, is this by accident or did you have some other spellings in mind?\n\nIf it is by accident, let me know, I can just remove the duplicates before committing.",
            "date": "2009-10-11T13:34:21.086+0000",
            "id": 3
        },
        {
            "author": "Basem Narmok",
            "body": "Hi Robert,\n\nRegarding ايضا / أيضا ...\n\nNo, not by accident, I included both formats (normalized,unnormalized). Arabic users tend to use both on the internet (different spellings), another example is words like أي / اي",
            "date": "2009-10-11T14:53:08.202+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "Basem, I meant: there are two entries for أيضا , and two entries for ايضا (total of four)\n\nedit: here are the relevant line numbers from the new stopwords.txt:\n\nLines 72 and 73:\n{noformat}\nايضا\nأيضا\n{noformat}\n\nLines 123 and 124:\n{noformat}\nايضا\nأيضا\n{noformat}",
            "date": "2009-10-11T15:01:37.482+0000",
            "id": 5
        },
        {
            "author": "Robert Muir",
            "body": "Basem I can simply remove 123 & 124 if this is the case, but I did not want to do this without checking first.\n\nThe reason is, I wonder if perhaps you intended for these two to be أيضاً and ايضاً (with fathatan)",
            "date": "2009-10-11T15:32:18.156+0000",
            "id": 6
        },
        {
            "author": "Basem Narmok",
            "body": "Oh, my mistake, sorry, yes please remove the last two on 123 & 124.\n\nno, they are just duplicate of the ones on line 72 & 73\n\n",
            "date": "2009-10-11T17:21:35.231+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "Basem, ok! Thanks a lot for your help here. I will commit soon.",
            "date": "2009-10-11T17:25:52.042+0000",
            "id": 8
        },
        {
            "author": "Robert Muir",
            "body": "before I commit this, I want to solicit any comments/concerns about backwards compat, assuming the following notice:\n\n{noformat}\nChanges in runtime behavior\n\n * LUCENE-1966: Modified and cleaned the default Arabic stopwords list used\n   by ArabicAnalyzer. You'll need to fully re-index any previously created \n   indexes.  (Basem Narmok via Robert Muir)\n{noformat}\n\ni know contrib has no bw compat guarantee, but just want to double-check. \nPerhaps in the future someone might help fix the Persian stopwords file also so this may happen again :)\n",
            "date": "2009-10-11T18:25:33.269+0000",
            "id": 9
        },
        {
            "author": "Basem Narmok",
            "body": "Seems good.\n\nBTW with FAST ESP we never used stopwords, as hits from stopwords get low relevancy (keywords with high number of hits = low value, low importance, so less relevant), so such hits will never get into the top results. Also, using stopwords will affect phrase search, most of the search engines avoid removing them. But, at the end it depends on the client's application, and what she really wants, as enterprise search could have very specific and different needs than Internet search.\n\nAnyways, still I am testing the Arabic Analyzer, and I will provide you with more comments soon. but for the stopwords they are good for now :)",
            "date": "2009-10-11T22:22:19.895+0000",
            "id": 10
        },
        {
            "author": "Robert Muir",
            "body": "Basem, yes I think the improvements are good.\n\nMy question is really: is it OK to commit this for 3.0 or should we wait for 3.1?\n",
            "date": "2009-10-11T22:52:38.146+0000",
            "id": 11
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 825110.\n\nThanks Basem!",
            "date": "2009-10-14T12:24:48.392+0000",
            "id": 12
        }
    ],
    "component": "modules/analysis",
    "description": "The provided Arabic stopwords list needs some enhancements (e.g. it contains a lot of words that not stopwords, and some cleanup) . patch will be provided with this issue.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1966",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Trivial",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Arabic Analyzer: Stopwords list needs enhancement",
    "systemSpecification": true,
    "version": "2.9"
}