{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Attached patch.  I think it's ready to commit but I'll wait a few days.\n\nWhen you open the IndexWriter on a prior commit, what actually happens\nis the IndexWriter opens all commits, and then pulls in the specific\nsegments referenced by the prior commit into its in-memory\nSegmentInfos instance.  So this is analagous to doing a \"reverse svn\nmerge\" to undo a series of changes into your local checkout, but, not\ncommitting that undo until IW.commit() is explicitly called.\n\nThis means it's still up to the deletion policy to decide what to do\nwith the \"future\" commits on opening the prior commit.\n",
            "date": "2008-10-02T11:48:45.568+0000",
            "id": 0
        }
    ],
    "component": "core/index",
    "description": "With a 2-phase commit involving multiple resources, each resource\nfirst does its prepareCommit and then if all are successful they each\ncommit.  If an exception or timeout/power loss is hit in any of the\nresources during prepareCommit or commit, all of the resources must\nthen rollback.\n\nBut, because IndexWriter always opens the most recent commit, getting\nLucene to rollback after commit() has been called is not easy, unless\nyou make Lucene the last resource to commit.  A simple workaround is\nto simply remove the segments_N files of the newer commits but that's\nsort of a hassle.\n\nTo fix this, we just need to add a ctor to IndexWriter that takes an\nIndexCommit.  We recently added this for IndexReader (LUCENE-1311) as\nwell.  This ctor is definitely an \"expert\" method, and only makes\nsense if you have a custom DeletionPolicy that preserves more than\njust the most recent commit.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1411",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Enable IndexWriter to open an arbitrary commit point",
    "systemSpecification": true,
    "version": "2.4"
}