{
    "comments": [
        {
            "author": "Otis Gospodnetic",
            "body": "I'd actually love the option to skip that stuff all together.  The last time I checked one Wikipedia dump (Croatian, not English), text/pointers in angle bracket was really junk, at lest for my purposes of getting a representative list of tokens and types for a language.\n",
            "date": "2008-01-15T17:15:21.382+0000",
            "id": 0
        },
        {
            "author": "Grant Ingersoll",
            "body": "I use a TokenFilter to decide what to with the links",
            "date": "2008-01-15T18:17:19.890+0000",
            "id": 1
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Aha.  Which existing one?  Custom?",
            "date": "2008-01-15T18:35:20.655+0000",
            "id": 2
        },
        {
            "author": "Grant Ingersoll",
            "body": "Custom.",
            "date": "2008-01-15T19:03:18.189+0000",
            "id": 3
        },
        {
            "author": "Grant Ingersoll",
            "body": "Here's a completely back-compatible (if there is such a thing for something that hasn't been released) patch that allows for 3 different output options:\n\n1. Tokens only (the current functionality)\n2. Untokenized only\n3. Both\n\nIn case 2, a Set of Wiki types is passed in, and any token that has that type will not be tokenized.  Case 3 is the combination of 1 and 2, with the untokenized token output first.\n\nSee the unit test for how it should work.\n\nI will commit after the release, pending improvements, etc.",
            "date": "2008-01-16T15:35:35.855+0000",
            "id": 4
        },
        {
            "author": "Grant Ingersoll",
            "body": "Here's a patch that also includes LUCENE-1137 and sets a flag for the untokenized token when BOTH or UNTOKENIZED_ONLY is the output type.\n\nThis patch is an alternative to the existing one and doesn't necessarily have to replace that one, it just demonstrates using 1137 for something fun.",
            "date": "2008-01-16T21:50:55.198+0000",
            "id": 5
        },
        {
            "author": "Grant Ingersoll",
            "body": "Committed on 614895",
            "date": "2008-01-24T15:06:15.008+0000",
            "id": 6
        }
    ],
    "component": "",
    "description": "It would be nice if the WikipediaTokenizer had a way of, via a flag, leaving categories, links, etc. as single tokens (or at least some parts of them)\n\nThus, if we came across [[Category:My Big Idea]] there would be a way of outputting, as a single token \"My Big Idea\".  \n\nOptionally, it would be good to output both \"My Big Idea\" and the individual tokens as well.\n\nI am not sure of how to do this in JFlex, so any insight would be appreciated.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1133",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "WikipediaTokenizer needs a way of not tokenizing certain parts of the text",
    "systemSpecification": true,
    "version": "2.3"
}