{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Whoa, good catch & explanation of the issue!  Sorry about this.\n\nI will fix these tests so they resolve the field by name and do their comparisons on that basis.\n\nI realize that exact file name tests will need to be updated when we change the file format, but, I really wanted test coverage that verifies the generational logic to derive file names is working correctly for segments, del and separate norms files.\n\nI will temporarily turn off TestBackwardsCompatibility.testExactFileNames, and TestIndexFileDeleter, until I can resolve this.",
            "date": "2006-11-21T11:43:43.000+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "OK I was able to reproduce the failure using IBMs JDK 5.0 on Linux.  I changed the tests to load the field infos and compute which field index corresponds to the \"content\" field and then use that field index instead, and the tests pass.",
            "date": "2006-11-22T17:07:54.000+0000",
            "id": 1
        },
        {
            "author": "Michael Busch",
            "body": "The tests now pass on my machine too. Good job, Mike! Thanks.",
            "date": "2006-11-22T17:51:47.000+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "Thank you for tracking this down!  I did not realize field number assinment was volatile across JREs.",
            "date": "2006-11-22T18:32:37.000+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "Closing all issues that were resolved for 2.1.",
            "date": "2007-02-27T18:10:36.612+0000",
            "id": 4
        }
    ],
    "component": "core/index",
    "description": "In the two units tests TestBackwardsCompatibility and TestIndexFileDeleter several index file names are hardcoded. For example, in TestBackwardsCompatibility.testExactFileNames() it is tested if the index directory contains exactly the expected files after several operations like addDocument(), deleteDocument() and setNorm() have been performed. Apparently the unit tests pass on the nightly build machine, but in my environment (Windows XP, IBM JVM 1.5) they fail for the following reason:\n\nWhen IndexReader.setNorm() is called a new norm file for the specified field is created with the file  ending .sx, where x is the number of the field. The problem is that the SegmentMerger can not guarantee to keep the order of the fields, in other words after a merge took place a field can have a different field number. This specific testcase fails, because it expects the file ending .s0, but the file has the ending .s1.\n\nThe reason why the field numbers can be different on different JVMs is the use of HashSet in SegmentReader.getFieldNames(). Depending on the HashSet implementation an iterator might not iterate over the entries in insertion order. When I change HashSet to LinkedHashSet, the two testcases pass.\n\nHowever, even with a LinkedHashSet the order of the field numbers might change during a merge, because the order in which the SegmentMerger merges the FieldInfos depends on the field options like TERMVECTOR, INDEXED... (see SegmentMerger.mergeFields() for details). \n\nSo I think we should not use LinkedHashSet but rather change the problematic testcases. Furthermore I'm not sure if we should have hardcoded filenames in the tests anyway, because if we change the index format or file names in the future these test cases would fail without modification.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-720",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Unit tests TestBackwardsCompatibility and TestIndexFileDeleter might fail depending on JVM",
    "systemSpecification": true,
    "version": "2.1"
}