{
    "comments": [
        {
            "author": "Shai Erera",
            "body": "Uwe, let me know if you'd like me to work on a patch.",
            "date": "2009-11-11T19:50:22.941+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "The patch is already finished and ready to commit.",
            "date": "2009-11-11T19:52:40.125+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "The generics should in all cases put on top of the whole class, because it is a wrapper around PQ. And PQ needs a generic type. By using a ?-like type you have to still cast in all sub-classes. See also other classes in oal.search (MultTermQueryWrapperFilter and so on).",
            "date": "2009-11-11T19:54:18.758+0000",
            "id": 2
        },
        {
            "author": "Shai Erera",
            "body": "It's strange ... I'd thought that if I declare PQ<T>, and then from TFC for example init FVHQ, which extends PQ as <Entry>, then all who'll use FVHQ won't need to cast to Entry. I've tried it and indeed TSDC does not need to case to ScoreDoc, but TFC needs to case to Entry.\n\nPatch looks good Uwe !",
            "date": "2009-11-11T20:21:40.671+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. It's strange ... I'd thought that if I declare PQ<T>, and then from TFC for example init FVHQ, which extends PQ as <Entry>, then all who'll use FVHQ won't need to cast to Entry. I've tried it and indeed TSDC does not need to case to ScoreDoc, but TFC needs to case to Entry. \n\nBecause of that it is implemented with a generic type param. This ensures that both the class implementation and the embedded PQ both work with the same data type and you never have to cast. The problem with the state before was that Entry did not extend ScoreDoc and because of that the generics were unbounded.\n\nI'll commit this soon (waiting for the backwards-tests).",
            "date": "2009-11-11T21:35:13.218+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 835090\n\nThanks Shai! As this is not a new bug, I added you to the changes entry for the Java 5 generics additions.",
            "date": "2009-11-11T21:58:55.821+0000",
            "id": 5
        }
    ],
    "component": "core/search",
    "description": "TopDocsCollector was changed to be TopDocsCollector<T>. However it has methods which specifically assume the PQ stores ScoreDoc. Therefore, if someone extends it and defines a type which is not ScoreDoc, things will break.\n\nWe shouldn't put <T> on TopDocsCollector at all, but rather change its ctor to *protected TopDocsCollector(PriorityQueue<? extends ScoreDoc> pq)*. TopDocsCollector should handle ScoreDoc types. If we do this, we'll need to change FieldValueHitQueue's Entry to extend ScoreDoc as well.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2057",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "TopDocsCollector should have bounded generic <T extends ScoreDoc>",
    "systemSpecification": true,
    "version": ""
}