{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Can someone confirm that this is technically accurate (I've added it to the javadoc for NumericField):\n\nbq. You may add the same field name as a NumericField to the same document more than once. Range querying and filtering will be the logical OR of all values, and sorting will sort according to the first value added.",
            "date": "2009-08-29T09:25:38.288+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "This is correct (first part), you can add a field more than once and it really works (there is a test about that: TestMultiValuedNumericRangeQuery). The results are the same like with a normal range query (so the trie terms do not interfere between each other). See SOLR-1322\n\nI think your sentence is a little bit complicated. It would hit all documents in the range, where at least one of the values of a multi-valued doc is in the range.\n\nAbout the second one: Sorting is not different from other numeric multi-value fields (in contrast to StringIndex where only one value/doc is allowed). The univerter assigns a value to each document. As it overrides values previously assigned to the document when iterating over all terms in the field, the last term would be the one saved in the FieldCache. So you would sort against the largest value per doc (because the smaller values are overridden by the larger ones in the field cache).",
            "date": "2009-08-29T09:37:51.683+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "bq. About the second one: Sorting is not different from other numeric multi-value fields (in contrast to StringIndex where only one value/doc is allowed). The univerter assigns a value to each document. As it overrides values previously assigned to the document when iterating over all terms in the field, the last term would be the one saved in the FieldCache. So you would sort against the largest value per doc (because the smaller values are overridden by the larger ones in the field cache).\n\nAhh right.\n\nI'm confused on why it's the \"largest\" value?  EG if I add 4, 17, 10 as a NumericField \"x\" on my doc, when I then try to sort, wouldn't 10 \"win\" since it was added last to the document?",
            "date": "2009-08-29T09:44:05.329+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. I'm confused on why it's the \"largest\" value? EG if I add 4, 17, 10 as a NumericField \"x\" on my doc, when I then try to sort, wouldn't 10 \"win\" since it was added last to the document?\n\nBecause of the uninverter. It iterates over all terms, starting from the lowest one in the field. When he comes to term 4, it would add it to the field cache at the document's position. The same with 10 and then 17. Because the TermEnum lists 17 at last, it would win:\n\n{code}\nlong[] retArray = null;\nTermDocs termDocs = reader.termDocs();\nTermEnum termEnum = reader.terms (new Term(field));\ntry {\n  do {\n    Term term = termEnum.term();\n    if (term==null || term.field() != field) break;\n    long termval = parser.parseLong(term.text());\n    if (retArray == null) // late init\n      retArray = new long[reader.maxDoc()];\n    termDocs.seek (termEnum);\n    while (termDocs.next()) {\n      retArray[termDocs.doc()] = termval;\n    }\n  } while (termEnum.next());\n} catch (StopFillCacheException stop) {\n} finally {\n  termDocs.close();\n  termEnum.close();\n}\nif (retArray == null) // no values\n  retArray = new long[reader.maxDoc()];\n{code}",
            "date": "2009-08-29T09:49:31.816+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Because of the uninverter. \n\nAhh right!\n\nI think it's best to document that the effect of sorting is undefined/not guaranteed, but filtering/searching by range is defined.",
            "date": "2009-08-29T10:57:58.059+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "Thank you at all for looking after the documentation! A native speaker is always better than my \"frankish\" English (as my colleague call it). :)",
            "date": "2009-08-29T11:12:15.190+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Thank you at all for looking after the documentation! A native speaker is always better than my \"frankish\" English (as my colleague call it).\n\nNo problem!  This is how open source works :)  It's great.",
            "date": "2009-08-29T12:01:26.659+0000",
            "id": 6
        },
        {
            "author": "Michael McCandless",
            "body": "Only javadoc fixes, mostly for Numeric* but also some small fixes to a few other classes.",
            "date": "2009-08-29T12:02:10.310+0000",
            "id": 7
        },
        {
            "author": "Uwe Schindler",
            "body": "Will we mark it as experimental or not? In some classes you remove the experimental warning, in others not. I will review it more detailed later!\n\nBy the way, I also reviewd the LIA chapter and have also seen the reference to DateTools (will send you my updates soon). ate to a String with a special date resolution and then convertin back to numeric is somehow ineffective. When indexing only hour resolution, I would take Date.getTime() / 3600L / 1000L.",
            "date": "2009-08-29T12:17:26.543+0000",
            "id": 8
        },
        {
            "author": "Uwe Schindler",
            "body": "Maybe you could copy some of your explanations also to NumericTokenStream, e.g. the example. In the original, both classes had similar introduction texts.",
            "date": "2009-08-29T12:25:03.706+0000",
            "id": 9
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Will we mark it as experimental or not?\n\nYes, I think we should keep the experimental warning.  I didn't mean to remove any -- I'll make sure they're all still there.\n\nbq. By the way, I also reviewd the LIA chapter and have also seen the reference to DateTools (will send you my updates soon)\n\nExcellent, thanks!\n\nbq.  ate to a String with a special date resolution and then convertin back to numeric is somehow ineffective. When indexing only hour resolution, I would take Date.getTime() / 3600L / 1000L.\n\nTrue, and that'll work for DAY as well, but not for MONTH / YEAR resolution.\n\nbq. Maybe you could copy some of your explanations also to NumericTokenStream, e.g. the example. In the original, both classes had similar introduction texts.\n\nOK I'll update NumericTokenStream too.",
            "date": "2009-08-29T12:34:39.477+0000",
            "id": 10
        },
        {
            "author": "Michael McCandless",
            "body": "New rev.\n\nAs far as I can tell, I didn't lose any of the experimental warnings -- Uwe where did you see that?\n\nI worked on NumericTokenStream's javadocs too.\n\nFinally, I removed reference to DateTools entirely and suggested either quantizing by dividing getTime()'s returned result, or, using Date's getters (getYear, getMonth, etc.) to construct a numeric value.",
            "date": "2009-08-29T13:13:18.638+0000",
            "id": 11
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. As far as I can tell, I didn't lose any of the experimental warnings - Uwe where did you see that?\n\nMy fault. I did not see that you moved the warning to the top in NumericRangeQuery.\n\nLooks good.",
            "date": "2009-08-29T13:22:42.992+0000",
            "id": 12
        },
        {
            "author": "Uwe Schindler",
            "body": "One small thing (I found this also in the LIA chapter):\n\"Trie\" is the whole \"prefix tree\". So \"trie\" means the whole list of different precision terms for one numeric value. You have this explanation which suggests one trie is one term:\n{code}\n+ * <p>Within lucene, each numeric value is indexed as\n+ * multiple encoded terms representing larger and larger\n+ * pre-defined brackets called <em>trie</em>s.  The step\n+ * size between each successive trie is called the\n+ * <code>precisionStep</code> in this API.  Smaller\n{code}\nThere should also be the explanation that the precStep is in \"bits\".",
            "date": "2009-08-29T13:38:28.462+0000",
            "id": 13
        },
        {
            "author": "Michael McCandless",
            "body": "bq. \"Trie\" is the whole \"prefix tree\".\n\nOK -- I tweaked NumericField to fix that.  I'll fix LIA2's manuscript too... thanks!",
            "date": "2009-08-29T14:14:51.919+0000",
            "id": 14
        },
        {
            "author": "Michael McCandless",
            "body": "State that precSteps is \"bits\", and trie is the entire data structure.",
            "date": "2009-08-29T14:15:15.222+0000",
            "id": 15
        },
        {
            "author": "Uwe Schindler",
            "body": "I think this is fine now! Thanks.",
            "date": "2009-08-29T20:30:25.690+0000",
            "id": 16
        },
        {
            "author": "Michael McCandless",
            "body": "OK thanks Uwe!",
            "date": "2009-08-29T20:52:19.234+0000",
            "id": 17
        },
        {
            "author": "Uwe Schindler",
            "body": "Hi Mike, I made some small improvements in formatting and also added a relation between precisionStep and \"brackets\" which one would not understand (what is the relation between terms bracket and precisionStep). Also the term bracket does not appear anywhere else. So I added, that the larger brackets are simply lower-precision representations of the original value. I also added a link to NumericUtils which get lost, that describes the format (in the advanced section of NumericField).\n\nI committed this, revision: 809284",
            "date": "2009-08-30T09:16:56.589+0000",
            "id": 18
        },
        {
            "author": "Michael McCandless",
            "body": "The new changes look good -- thanks Uwe!",
            "date": "2009-08-30T09:27:52.145+0000",
            "id": 19
        },
        {
            "author": "Uwe Schindler",
            "body": "Oh I thought you were still sleeping... Good morning!",
            "date": "2009-08-30T09:36:11.568+0000",
            "id": 20
        },
        {
            "author": "Michael McCandless",
            "body": "Good morning!",
            "date": "2009-08-30T11:07:52.040+0000",
            "id": 21
        },
        {
            "author": "Uwe Schindler",
            "body": "Some small updates after discussion on java-user.",
            "date": "2009-09-14T16:32:53.480+0000",
            "id": 22
        },
        {
            "author": "Uwe Schindler",
            "body": "Some notes about cardinality and precision step.",
            "date": "2009-09-14T16:34:44.276+0000",
            "id": 23
        },
        {
            "author": "Michael McCandless",
            "body": "Looks good Uwe!",
            "date": "2009-09-14T16:53:44.522+0000",
            "id": 24
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 815195",
            "date": "2009-09-15T07:29:02.997+0000",
            "id": 25
        }
    ],
    "component": "",
    "description": "I'm working on improving Numeric* javadocs.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1872",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Improve javadocs for Numeric*",
    "systemSpecification": true,
    "version": ""
}