{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "Attached is an initial patch. i made the following changes to the original code:\n* add generics and other java 5 things\n* add junit tests\n* add polish analyzer, with stopwords list from carrot2\n* repackaging\n\nyou will need to extract the stemming table into resources/org.apache.lucene.analysis.pl folder, right where the Polish stopwords are. I will attach this separately. ",
            "date": "2010-03-06T00:49:16.013+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "tables that must go in the resources folder under Polish (o.a.l.analysis.pl)",
            "date": "2010-03-06T00:49:57.920+0000",
            "id": 1
        },
        {
            "author": "Dawid Weiss",
            "body": "Staszek suggested that perhaps it would be convenient if this patch detected if another Polish stemming library for Polish is present in classpath and if so, used it. The library in mind is \"morfologik-stemming\", here:\n\nhttp://sourceforge.net/projects/morfologik/\n\nThe code of this library is BSD-licensed and consists mainly of traversal of FSA automata. The stemmer is dictionary based, so it is nearly (ambiguities) 100% accurate for words in the dictionary and 0% accurate for non-dictionary words (returns null).\n\nThe problem with Morfologik is that its dictionary data is LGPL-ed, so it would have to be a separate download. \n\nThis is just a suggestion for discussion. I guess this functionality is limited to a very narrow audience anyway.\n\n",
            "date": "2010-03-22T08:17:59.542+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "bq. Staszek suggested that perhaps it would be convenient if this patch detected if another Polish stemming library for Polish is present in classpath and if so, used it.\n\nHello, perhaps we can provide this as a separate option?\n\nThe problem with doing this is what to do if the classpath detection fails? would it fall back on the code here?\nThis magic could cause a lot of confusion, for example: indexing on a server with correct classpath, searching \non another where it is incorrect, or vice-versa.\n\nIn my opinion, for analysis stuff, if the environment isn't setup correctly, we should just throw an exception.\n",
            "date": "2010-03-22T12:37:42.746+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "bq. The problem with Morfologik is that its dictionary data is LGPL-ed, so it would have to be a separate download. \n\nDawid, I looked at Morfologik's source code and it refers to this link: http://www.sjp.pl/slownik/en/\nIs this correct? Because this appears to be licensed under GPL, LGPL, MPL and Creative Commons ShareAlike licenses.\n\nbq. This is just a suggestion for discussion. I guess this functionality is limited to a very narrow audience anyway.\n\nBut if we can, why not provide two options?\nIn this case I think we should just open a separate JIRA issue for Morfologik.\nIts really a different method than what this stemmer does anyway.",
            "date": "2010-03-22T13:14:58.759+0000",
            "id": 4
        },
        {
            "author": "Dawid Weiss",
            "body": "I agree about classpath issues, they're a pain to debug. As for the license -- Morfologik's data is compiled from several sources, but you're right -- this clause has been problematic:\n\nLicensed under GPL, LGPL, MPL and Creative Commons ShareAlike licenses.\n\nIs there any legal sense in this? Is this an alternative (pick the one you want) or a combination (i.e. GPL swallows everything else)? I'll try to get in touch with the author and see what he has to say about it.",
            "date": "2010-03-22T14:17:09.923+0000",
            "id": 5
        },
        {
            "author": "Robert Muir",
            "body": "bq. Is there any legal sense in this? Is this an alternative (pick the one you want) or a combination (i.e. GPL swallows everything else)? \n\nI looked at the files themselves etc and could not figure out the meaning of this. \nI don't know if its fair to interpret it as \"multi-licensed\" or what, and I wouldn't want to do that.\nBut I do know several hunspell dictionaries are dual-licensed like this.\nI suppose its so that they can be used in more open source projects.\n\nbq. I'll try to get in touch with the author and see what he has to say about it.\n\nCool, thanks in advance for looking into this!",
            "date": "2010-03-22T18:27:32.787+0000",
            "id": 6
        },
        {
            "author": "Dawid Weiss",
            "body": "The answer from the developer is: pick any license for from this list. So... GPL/LGPL are not compatible with Apache2. MPL seems not to be compatible for now (there's been Mozilla initiative to make it compatible, but I think this process is still active). What about ShareAlike? Does this address the license above?\n\nhttp://www.apache.org/legal/resolved.html#cc-sa\n\n\"For any other type of CC-SA licensed work, please contact the Legal PMC. \" I'll try to see which one of them the author had in mind...",
            "date": "2010-03-22T18:30:21.424+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "Dawid, thanks... so it is \"pick your poison\" after all.\n\nFYI I created a JIRA issue so we can work this: LUCENE-2341\n",
            "date": "2010-03-22T18:34:17.366+0000",
            "id": 8
        },
        {
            "author": "Dawid Weiss",
            "body": "The dictionary's author states that:\n\n\"Attribution-sa to ta, na której jest udostępniany słownik.\"\n\nso we can pick the CC-SA license that Apache supposedly permits in the repositories. This is good news. Switching to LUCENE-2341 then.",
            "date": "2010-03-23T10:43:03.569+0000",
            "id": 9
        },
        {
            "author": "Robert Muir",
            "body": "attached is an updated patch using CharTermAttribute, etc.\n\nI ran forrest (thus the larger patch), and I think this one is ready.\n\nI plan to commit in a few days unless there are any objections.",
            "date": "2010-05-01T11:03:49.133+0000",
            "id": 10
        },
        {
            "author": "Robert Muir",
            "body": "I screwed up the encoding of the stopwords file (sorry).\n\nSo I also changed a test to test a non-ascii stopword :)\n",
            "date": "2010-05-01T11:11:50.691+0000",
            "id": 11
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 940433.",
            "date": "2010-05-03T12:45:21.781+0000",
            "id": 12
        },
        {
            "author": "Robert Muir",
            "body": "backported to 3x, revision 941704",
            "date": "2010-05-06T12:50:00.596+0000",
            "id": 13
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:50:10.265+0000",
            "id": 14
        },
        {
            "author": "Furkan KAMACI",
            "body": "I've detected a bug related to this issue. You can check it from here: LUCENE-5521",
            "date": "2014-03-12T14:05:09.738+0000",
            "id": 15
        }
    ],
    "component": "modules/analysis",
    "description": "Andrzej Bialecki has written a Polish stemmer and provided stemming tables for it under Apache License.\n\nYou can read more about it here: http://www.getopt.org/stempel/\n\nIn reality, the stemmer is general code and we could use it for more languages too perhaps.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2298",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Polish Analyzer",
    "systemSpecification": true,
    "version": "3.1"
}