{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Patch.  I now pass DataInput down to IndexFormatTooNew/OldExc, and\n.toString() it, and impl'd .toString in the all the IndexInput impls I\ncould find.\n",
            "date": "2011-10-28T10:30:59.297+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "I dont think i like all the duplication/extra tracking in every indexinput impl... \n\nIn my opinion its not worth it!\n\ncan this be done in a cleaner way?",
            "date": "2011-10-28T13:03:30.055+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "I agree with Robert, adding this to IndexInput is stupid.\n\nI think, only adding the file name as done before should be fine. There are only few places where we pass null as file name to the exception (whoch may be fixed). Passing the whole directory name is in my opinion useless. Its up to the implementation using lucene to keep track of its directory name (when it opens a IndexReader it already knows its dir name).\n\nI would close this as won't fix and maybe only fix the remaining places that misses the file name (e.g. SegmentTermsEnumReader).",
            "date": "2011-10-28T13:12:17.402+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "you might be able to work me down to a partial path rather than a full path...\n\nlike if IndexInput takes String name in its ctor (the same one passed to Directory.openInput *NOT* the full path, keeps String as a private variable), and implements toString itself.\n\nthen we wouldnt have to track additional variables in each indexinput impl, only change openinput and the ctors to pass this information.\n\nBut i'm still not sure how useful this is. \n\nIt really seems like an implementation detail that we check the stored fields to determine if an indexformat is too old. who cares what the file name is?\n",
            "date": "2011-10-28T13:14:10.503+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "Some more thoughts:\n* maybe IndexInput should have a ctor like IndexInput(String resourceDescription)\n* then, in *all* error messages (e.g. read past EOF) we could include this, for better error descriptions\n* when directories call openInput they could pass whatever they want (e.g. filename), and CFS could include the \"real\" file within cfs\n* we could declare this as just an opaque string describing the indexinput (yeah and II could use it in its toString() as well)\n* if we do this, i think it should be non-null (e.g. in 3.x we add no-arg ctor that forwards to \"no additional details\" or whatever)\n\nIf we did it consistently like this, i think it could improve error messages and debugging and be a pretty clean change.",
            "date": "2011-10-28T19:54:40.852+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "+1, I like that solution, Robert.  I'll rework the patch...",
            "date": "2011-10-29T10:42:53.961+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "New patch folding in Robert's idea....\n\nI added final String resourceDescription to II, returned from\ntoString, made it required arg to the ctor, and fix all II subclasses\nto pass something reasonable.\n\nWhen our II impls originate an exception (eg from EOF), I also include\nII.toString(); if a method they call throws IOE (eg file.read(...)\ninside SimpleFSII), then I catch & rethrow w/ II.toString() included.\n\nI also include the sub-file name when inside a sliced II (CFS/CFX);\nI added a required arg (sliceDescription) to the sliceInput method\nfor this.\n",
            "date": "2011-11-02T00:11:32.123+0000",
            "id": 6
        },
        {
            "author": "Robert Muir",
            "body": "Patch looks good, only one minor idea for improvement:\n\nWhen we throw \"read past EOF\" I think we should throw java.io.EOFException (extends IOException) rather than a generic one?",
            "date": "2011-11-03T17:02:12.790+0000",
            "id": 7
        },
        {
            "author": "Michael McCandless",
            "body": "OK, new patch; I changed to EOFE, and I just use in.toString() instead of special casing DI vs II.\n\nI think it's ready!",
            "date": "2011-11-03T17:18:22.220+0000",
            "id": 8
        },
        {
            "author": "Simon Willnauer",
            "body": "mike can we close LUCENE-3138 too?",
            "date": "2011-11-04T22:06:01.352+0000",
            "id": 9
        },
        {
            "author": "Michael McCandless",
            "body": "bq. mike can we close LUCENE-3138 too?\n\nHmm I don't think so.  It's unrelated to my fixes here?  Here I just \"improved\" the error message you see when you get an IOE, CorruptIndexE, IndexFormatTooXE out of Lucene.",
            "date": "2011-11-05T17:59:40.701+0000",
            "id": 10
        },
        {
            "author": "Uwe Schindler",
            "body": "Bulk close after release of 3.5",
            "date": "2011-11-27T12:29:30.402+0000",
            "id": 11
        }
    ],
    "component": "",
    "description": "(Spinoff from http://markmail.org/thread/t6s7nn3ve765nojc )\n\nWhen we throw a too old/new exc we should try to include the full path to the offending file, if possible.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3539",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "IndexFormatTooOld/NewExc should try to include fileName + directory when possible",
    "systemSpecification": true,
    "version": ""
}