{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "for trunk, just change the test to use MockAnalyzer instead of simple... i made the patch from 3x.",
            "date": "2010-09-23T18:19:56.372+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "May there be a randomization issue. If both index writers use a different LockFacory, it can easy fail! So at least for one test run, the LockFactory should be identical, else the locking can produce wrong failures/messages, as SimpleFSLock and NativeFSLock can interact very limited, but there are only some security checks, so locking will fail if you mix the implementations.",
            "date": "2010-09-23T18:25:12.659+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "The test isnt random. it uses FSDirectory.open",
            "date": "2010-09-23T18:27:08.465+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Sorry, you are right. The exception throws is clearly wrong :-) Maybe its related to Shai's changes in NativeFSLockFactory (which is the default)?",
            "date": "2010-09-23T18:31:18.182+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "I think it is the recent changes to NativeFSLockFactory...\n\nIW tries to first clear the lock, if create=true, and that attempt is causing the exception.  Really this is a holdover from SimpleFSLockFactory, which can leave orphan'd locks... so maybe somehow we shouldn't do this for other lock factories?",
            "date": "2010-09-23T18:53:30.293+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "I think we should remove the call inside IW to dir.clearLock?  This is a holdover from when SimpleFSLockFactory was the default.  And, I think it's devious/dangerous w/ that lock factory since that lock factory lets you simply erase the lock out from under another open IW.  Ie that call masks bugs.\n\nAll tests pass when I remove it, and, the LIA lock test also passes.",
            "date": "2010-10-02T12:49:11.287+0000",
            "id": 5
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:50:14.638+0000",
            "id": 6
        }
    ],
    "component": "core/index",
    "description": "As part of integrating Lucene In Action 2 test cases (LUCENE-2661), I found one of the test cases fail\n\nthe test is pretty simple, and passes on 3.0. The exception you get instead (LockReleaseFailedException) is \npretty confusing and I think we should fix it.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2663",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "wrong exception from NativeFSLockFactory (LIA2 test case)",
    "systemSpecification": true,
    "version": ""
}