{
    "comments": [
        {
            "author": "Grant Ingersoll",
            "body": "And Maven 1.x http://www.ibiblio.org/maven/lucene/jars/ for those of us who haven't upgraded yet!",
            "date": "2006-04-20T21:18:12.000+0000",
            "id": 0
        },
        {
            "author": "Stephen Duncan Jr",
            "body": "Also, please upload the various lucene contrib jars if possible.",
            "date": "2006-04-20T21:50:10.000+0000",
            "id": 1
        },
        {
            "author": "Martin Cooper",
            "body": "Note that the recommendation for Maven 2 is such that the Lucene groupId should change from just 'lucene' to 'org.apache.lucene'.\n\nTo get the distribution on to ibiblio, you can just do a deploy to the ASF repo:\n\nhttp://www.apache.org/dist/maven-repository/\n\nand it will be rsync'd to ibiblio autoagically. I believe that will cause it to show up in the Maven 1 repo as well.\n\nIt would be great if some nice Lucene person could take care of this. :-) Thanks in advance.",
            "date": "2006-05-06T01:00:16.000+0000",
            "id": 2
        },
        {
            "author": "Doug Cutting",
            "body": "Why can't Maven folks upload releases?  Why is the burden on Lucene?  Lucene publishes releases that anyone can download to standard Apache distribution directories.  Why can't Maven get them from there like everyone else?",
            "date": "2006-05-24T00:22:22.000+0000",
            "id": 3
        },
        {
            "author": "Martin Cooper",
            "body": "To your question #1, the Maven people cannot track every release of every artifact across all open source organisations, which is basically what is maintained in the Maven repository. There used to be a mechanism whereby a PMC could request that their artifact be loaded into the repository; I'm not sure if that mechanism still exists, given that there is a local ASF repository that is automatically synced to the main Maven one.\n\nTo your question #2, Maven is a repository-based build system. It automatically downloads dependencies for a project based on the dependency information provided in the project's POM (Project Object Model). With Maven 2, it also automatically downloads transitive dependencies. This is an awesome improvement over other build systems such as Ant, which leaves you to manage your own dependecies. In order that Maven can locate and download the appropriate jar files, those jar files must be deployed to the Maven repository. It wouldn't be realistic to expect Maven to be able to locate and extract jar files from within a binary distribution, given that there is no standard way that these are packages and distributed.",
            "date": "2006-05-24T00:39:27.000+0000",
            "id": 4
        },
        {
            "author": "Karl Wettin",
            "body": "Comment by Doug Cutting [23/May/06 05:22 PM]\n> Why can't Maven folks upload releases? Why is the burden on Lucene? Lucene publishes\n> releases that anyone can download to standard Apache distribution directories. \n> Why can't Maven get them from there like everyone else? \n\nWhy not ask Martin if he wants the assigment to make sure iBiblio is updated?",
            "date": "2006-05-24T07:29:33.000+0000",
            "id": 5
        },
        {
            "author": "Grant Ingersoll",
            "body": "I can help, being a Maven user myself.",
            "date": "2006-05-24T07:37:58.000+0000",
            "id": 6
        },
        {
            "author": "Otis Gospodnetic",
            "body": "I added the iBiblio informatoin to http://wiki.apache.org/jakarta-lucene/ReleaseTodo .  If you have more details to add, please add them there.  For instance, read point 3 there.  The README says there is no auto-magical syncing, while Martin Cooper above says there is.  Which one is it?\n\nMaybe I'm looking at the wrong location ( minotaur.apache.org:/x1/www/www.apache.org/dist/maven-repository ?), as there is not much underneath that directory.\n",
            "date": "2006-05-24T10:25:57.000+0000",
            "id": 7
        },
        {
            "author": "Otis Gospodnetic",
            "body": "I see the new Lucene 2.0 didn't make it to iBiblio.  Please see my previous comment and questions, so we can take care of this.",
            "date": "2006-05-29T11:01:13.000+0000",
            "id": 8
        },
        {
            "author": "Martin Cooper",
            "body": "I've deployed Lucene Core 1.9.1 and 2.0.0 to the ASF Maven 2 repository:\n\nhttp://www.apache.org/dist/maven-repository/org/apache/lucene/lucene-core/\n\nand requested on dev@maven.a.o that they be synced to ibiblio.",
            "date": "2006-06-11T23:43:37.000+0000",
            "id": 9
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Thanks Martin (and ignore my email, I see all the info is here and at http://wiki.apache.org/jakarta-lucene/ReleaseTodo ).\n",
            "date": "2006-06-12T10:11:43.000+0000",
            "id": 10
        },
        {
            "author": "Marcel Reutegger",
            "body": "Are there any plans to also publish the new release to the Maven 1 repository on ibiblio.org? We at Jackrabbit still use Maven 1.0.2 as our build tool.",
            "date": "2006-10-24T12:29:17.000+0000",
            "id": 11
        },
        {
            "author": "Alastair Maw",
            "body": "Only the 1.9.1 release is still broken:\nhttp://people.apache.org/repo/m2-ibiblio-rsync-repository/org/apache/lucene/lucene-core/1.9.1/\nNote that the JAR is only 2.3Kb.",
            "date": "2007-02-27T13:14:20.728+0000",
            "id": 12
        }
    ],
    "component": "",
    "description": "Please upload 1.9.1 release to iBiblio so that Maven users can easily use the latest release.  Currently 1.4.3 is the most recently available version: http://www.ibiblio.org/maven2/lucene/lucene/\n\nPlease read the following FAQ for more information: http://maven.apache.org/project-faq.html",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-551",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Make Lucene - Java 1.9.1 Available in Maven2 repository in iBibilio.org",
    "systemSpecification": true,
    "version": "1.9"
}