{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "This patch uses the features ov clover 2.0.\n\nWe can only commit this to trunk, when hudson is able to use clover 2.0. The JAR and license files are in the private contributor area [https://svn.apache.org/repos/private/committers/donated-licenses/clover/2.4.3] and can be installed on hudson. I am not sure if this can be done for Lucene Java alone or if the JAR files must be upgraded for all projects.",
            "date": "2009-07-30T17:20:47.458+0000",
            "id": 0
        },
        {
            "author": "Nick Pellow",
            "body": "HI Uwe, \n\nGreat work getting Clover upgraded. I've also done an upgrade, although have some test failures on my local machine. I am pretty sure these are not caused by Clover, however would love for you to double check.\n\nClover 2 does not require the clover.jar to be installed into an Ant Lib, so I suggest checking it in trunk/lib/ , right next to junit.jar .\nWe will be generating a new site license for org.apache that can also be committed to your public svn server, so anyone wanting to develop on Lucene can just use Clover out of the box, on their desktop.\n\nSome other things I did was to change the fileset in the clover-setup task to:\n\n{code}\n        <fileset dir=\"src\">\n            <!-- see https://issues.apache.org/jira/browse/LUCENE-1772 -->\n            <include name=\"**/org/apache/**\"/>\n            <include name=\"**/lucli/**\"/>\n            <include name=\"**/com/example/**\"/>\n            <exclude name=\"**/org/apache/lucene/analysis/TestASCIIFoldingFilter.java\"/> <!-- Illegal char on line 190-->\n        </fileset>\n{code}\nThis means that all of the src and test java files in contrib will also be instrumented by clover, if that is what you want?\n\nI also removed the clover.enabled property, since clover should always be available from now on.\n\nI added the <testsources/> element to both the HTML and the XML report tasks too. This ensures that the coverage of your test cases themselves are reported in a seperate section of each report.\n\nI would also suggest we remove the clover.run property. Simply calling the 'clover' target at the start of the build will be enough to have clover swtiched on for the build.\n\nOther than that, I've tried to leave things as they were.\n\nPlease let me know if you have any questions, or problems!\nThe 2.4.3 license will work - we will have a site license available next week.\n\nCheers,\nNick",
            "date": "2009-07-30T23:55:54.835+0000",
            "id": 1
        },
        {
            "author": "Nick Pellow",
            "body": "a patch to upgrade to clover 2.5.1 .\n\nClover 2.5.1 can be download directly from: http://www.atlassian.com/software/clover/downloads/binary/clover-ant-2.5.1.zip\nThis should be stored in trunk/lib/clover.jar .",
            "date": "2009-07-31T00:05:20.455+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Thanks for all your help!\n\nbq. This means that all of the src and test java files in contrib will also be instrumented by clover, if that is what you want?\n\nNot really, my intention was to only instrument the source files using the tests  (I can see this, that during compilation it tells me that XXX files are instrumented). This is how it was before.\n\nThe <testsources> tag in the clover setup was added, because the backwards-branch tests (ant test-tag)  completely broke the clover run (as clover was not able to automatically figure out, which are the real test files that should be run to instrument the source - maybe because the backwards branch is checked out on the fly using svn).  Because of this I added explicitely the source files to <testsources> in the init task - see my patch. Since I did this, it works as exspected. I used the already defined variables for that.\n\nWithout this <testsources> you cannot see any instrumentation data generated during run of tests (see above), it seems, that clover only instruments during the backwards-branch tests. With the explicit tests in <testsources> it works as exspected.\n\nbq. I added the <testsources/> element to both the HTML and the XML report tasks too. This ensures that the coverage of your test cases themselves are reported in a seperate section of each report.\n\nThis is good, because without that clover-report does not see the contrib tests, only the core tests (during the compilation and instrumentation of contrib it works, as each contrib is run in a subant. When building the main report, no subants are involved and the report is only generated at top-level, where the tests are not available.\n\nbq. Clover 2 does not require the clover.jar to be installed into an Ant Lib, so I suggest checking it in trunk/lib/ , right next to junit.jar. We will be generating a new site license for org.apache that can also be committed to your public svn server, so anyone wanting to develop on Lucene can just use Clover out of the box, on their desktop.\n\nThe problem with that is, that we then have clover.jar inside the source distribution, which adds 9 MB of extra stuff. Also I am not sure, if it is good, to also add the clover license to that. And from the legal standpoint, I am not sure, if it is ok to bundle a non-free product together with Apache licensed software?\n\nI would like to have the clover.jar outside of the Lucene source distrib as before and e.g. only enable clover on our hudson build servers. If somebody do not want to put his clover.jar into the ant build dir, we could add a property that can be added to the local build.properties file. Or the user can run with \"ant -lib ...\". Alternatively we could add a ant task, that download the clover license and jar from Apache's private Committer SVN. We do this with other JAR files, too. I will think about it.\n\nI will prepare a patch and merge your's and mine changes and restore the testsources in the clover-setup task.\n\nbq. although have some test failures on my local machine. I am pretty sure these are not caused by Clover, however would love for you to double check.\n\nWhat tests are failing for you? Normally all should pass at the moment (see build logs at Apache's Hudson).",
            "date": "2009-07-31T07:28:39.369+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Here an updated patch with merged changes.\n\nThere is currently a bug in the hudson build script:\nThe new clover version creates very large additional class files when instrumenting the source, which also go into the TAR file.\nHudson builds this tar file without clover and publishes it, which is ok. But later hudson runs all tests a second time, with clover enabled. Hudson should do this only with \"ant -Drun.clover=true clean test generate-clover-reports\" (and not \"nightly\" instead of \"test\"). Because of this the TAR files are regenerated with instrumented classes.\n\nEDIT: This is not a problem anymore (the TAR file is copied before to the artifacts dir), nevertheless the target \"nightly\" should not be used. Instead Hudson should run \"test\". With/without clover. Maybe it is even not needed to run the tests without clover at all? Why two times?\n\nMike: You told me, that I should apply for a hudson account. On the Wiki page stands, that this is only possible for PMCs?",
            "date": "2009-07-31T09:54:07.783+0000",
            "id": 4
        },
        {
            "author": "Nick Pellow",
            "body": "bq. Thanks for all your help!\n\nAnd thanks for all yours by making Lucene!\n\nre: <clover-setup><testsources/>..\nOK - I was not aware of the backwards-branch tests.\nAs long as the right tests are being instrumented Clover, and correctly detected as tests, then all should be good.\n\n\nbq. The problem with that is, that we then have clover.jar inside the source distribution, which adds 9 MB of extra stuff.\n\nI see. I didn't realise that the lib dir gets included into the source distribution. Is there another directory in svn, other than lib, that the clover.jar could live and not get included into the source distro? Or is the source distro just an archive of the entire trunk directory?\n\nbq. And from the legal standpoint, I am not sure, if it is ok to bundle a non-free product together with Apache licensed software\nYep - not a good idea to bundle with Lucene, but it is fine to have it checked into your version control. \n\nbq. I would like to have the clover.jar outside of the Lucene source distrib as before\nWhatever you think will work best - I was just thinking that the clover.jar was not checked into svn within lucene because of the old Ant Lib requirement of clover1.\n\nbq. What tests are failing for you? Normally all should pass at the moment (see build logs at Apache's Hudson).\nOne of the XML tests was failing. I was only running :\n{code}\nant clover test -Drun.clover\n{code} \nso thought this may have been an environment flag or target I was missing.\n\nAnyway, please let me know if you have any more questions regarding Clover2. \n\nCheers,\nNick\n\n\n\n\n\n",
            "date": "2009-07-31T09:58:03.841+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Maybe it is even not needed to run the tests without clover at all? \n\nI didn't realize the nightly build runs the tests twice (with & w/o clover); I agree, running only with clover seems fine?\n\nbq. Mike: You told me, that I should apply for a hudson account. On the Wiki page stands, that this is only possible for PMCs?\n\nUrgh, I didn't realize that's only for PMCs.  Hmm... I wonder why that is.\n\nI have an account so I can make the necessary changes to Hudson once we work out what they are...",
            "date": "2009-07-31T15:09:22.420+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "This discussion was on java-dev, I copy it here for completeness:\n\n> : I didn't realize the nightly build runs the tests twice (with & w/o\n> : clover); I agree, running only with clover seems fine?\n> \n> i'm not caught up on this issue, but i happen to notice this comment in\n> email.\n> \n> the reason the tests are run twice is because in between the two runs we\n> package up the jars.  clover instruments all the classes, so if we only\n> ran hte tests once (w/clover), and then packaged the jars the nightly\n> builds would include clover instrumented bytecode.\n> \n> if you look at the old Jira issues about clover this is discussed there.\n> \n> -Hoss\n\nThis is correct but still inefficient. The current workflow is:\n- Checkout svn\n- Build the source package with ant\n- Build the maven artifacts (which compiles all classes)\n- Then ant nightly is called, which builds the binary package and runs tests -> this could be optimized to only build the binary package\n- ant clean \n- ant nightly with clover enabled -> This packages the binaries again, but does not copy them. This is also not the best. This step should simple do ant test with clover\n- build the clover report\n\nI only want to remove the call to the (I call it deprecated \"nightly\" target, which is a relict from the time before Hudson and replace by \"package\" in the first run and to \"ant test\" for the clover enabled version. The build would run two times faster.",
            "date": "2009-07-31T19:20:51.492+0000",
            "id": 7
        },
        {
            "author": "Hoss Man",
            "body": "\nbq. I only want to remove the call to the (I call it deprecated \"nightly\" target, which is a relict from the time before Hudson and replace by \"package\" in the first run and to \"ant test\" for the clover enabled version. The build would run two times faster.\n\nBut then we would be \"publishing\" artifacts before testing them.  that was the whole point behind the double run when clover was first introduced: run the tests to ensure there *should* be a build, then produce the build artifacts, then run reports against the build.\n\ni don't disagree with your goal: if we can eliminate the double test run that would be great, i'm just explaining why it is the way it is, and why removing that middle step will result in a process which isn't equivalent.\n\nbq. We will be generating a new site license for org.apache that can also be committed to your public svn server, so anyone wanting to develop on Lucene can just use Clover out of the box, on their desktop.\n\nNick: if i'm understanding this comment correctly you are implying...\n\n* that you represent Atlassian and are offering an updated license to use clover 2.x\n* that Atlassian will allow us to make this license available for anyone, anywhere in the world, to use when building/developing Lucene (regardless of what their affiliation is with the ASF)\n\nFYI: in addition to 1.3.2, Apache already has a clover.license file for 2.0.3 and 2.4.3 (Lucene just never got around to using them in our build system) and these are checked into the \"private\" svn repository (ie: only accessible to committers).  The fact that these licenses are committed into the private repository suggests that when they were granted to the ASF, it was with some instructions that it only be made available to people who were directly associated with the AF, and not made publicly available (The README files associated with the licenses don't contain any specific instructions either way, so the location in \"private/committers\" suggests it's access restriction).  I believe that has been the general understanding of many ASF projects, and is the basis for the current hacks in the Lucene build system -- it was never an issue of where to put clover.jar, it was an issue of making sure anyone could use the build.xml file even without access to a clover.license.\n\nIf we truly can make both the license publicly available then we could simplify a lot of things by commiting clover.license into the source tree (and including in source releases), and having the build file download the clover.jar as needed if people set the build property to run the tests in clover.\n\nIf i am in fact understanding this all correctly, then the best way to proceed is if  you (or someone else with an @atlassian.com address) could send an \"official\" email to java-dev@lucene spelling out exactly how the license can be used/disseminated.  then one of the lucene committers can commit the new license into both the private/committers repository along with the full email so that there won't be any confusion for other developers in other projects about how it can be shared. .... then we copy the license to the lucene repository and commit the simplifications to the lucene build system.\n",
            "date": "2009-08-04T01:50:20.838+0000",
            "id": 8
        },
        {
            "author": "Nick Pellow",
            "body": "Hi Hoss, \n\n{quote}\nNick: if i'm understanding this comment correctly you are implying...\n\n* that you represent Atlassian and are offering an updated license to use clover 2.x\n* that Atlassian will allow us to make this license available for anyone, anywhere in the world, to use when building/developing Lucene (regardless of what their affiliation is with the ASF)\n{quote}\n\nCorrect on both counts, except the updated license will only work with the upcoming release of Clover 2.6, and onwards.\n\nbq. The README files associated with the licenses don't contain any specific instructions either way, so the location in \"private/committers\" suggests it's access restrictions\n\nI can't comment on that clover license. It may well need to stay in the private repo.\n\n{quote}\nIf we truly can make both the license publicly available then we could simplify a lot of things by commiting clover.license into the source tree\n{quote}\n\nThat is exactly the idea. The license will also work inside the Clover IDEA and Eclipse plugins for anyone, anywhere developing on org.apache projects.\nIf you don't wish to check the clover.jar into subversion, the clover.jar can always be downloaded directly from the maven central repository: http://repo2.maven.org/maven2/com/cenqua/clover/clover/ (when version 2.6.0 arrives ;) .\n\nSo, to move forward:\n* I will have an email sent to  java-dev@lucene spelling out exactly how the license can be used/disseminated\n* I will get you an EAP of Clover 2.6 with the upgraded licensing code\n* I will also attach a copy of the new Clover Apache Site license to this ticket for someone to commit to your repository.\n\nPlease let me know if there is anything we can do, or if you have any further questions/suggestions!\n\nCheers,\nNick\n",
            "date": "2009-08-04T05:37:45.005+0000",
            "id": 9
        },
        {
            "author": "Uwe Schindler",
            "body": "{quote}\nbq. I only want to remove the call to the (I call it deprecated \"nightly\" target, which is a relict from the time before Hudson and replace by \"package\" in the first run and to \"ant test\" for the clover enabled version. The build would run two times faster.\n\nBut then we would be \"publishing\" artifacts before testing them.  that was the whole point behind the double run when clover was first introduced: run the tests to ensure there *should* be a build, then produce the build artifacts, then run reports against the build.\n\ni don't disagree with your goal: if we can eliminate the double test run that would be great, i'm just explaining why it is the way it is, and why removing that middle step will result in a process which isn't equivalent.\n{quote}\n\nI agree, the solution for this would be to reorder the build steps. As far as I know (I have seen this from the previous hudson builds), the build process will stop, if  of two separate ANT runs the first one failes (I assume, hudson checks the exit code). If this is the case, the order could be changed to:\n\n- Checkout svn \n- Build the source package with ant \n- \"ant test\" with clover enabled \n- build the clover report \n- \"ant clean\"\n- Build the maven artifacts (which compiles all classes) \n- \"ant package\" is called, which builds the binary package\n",
            "date": "2009-08-04T08:33:41.277+0000",
            "id": 10
        },
        {
            "author": "Uwe Schindler",
            "body": "> Hi Uwe,\n> I noticed that in your patch to integrate Clover, you also excluded\n> the following from instrumentation:\n> <exclude name=\"org/apache/lucene/analysis/\n> TestASCIIFoldingFilter.java\" /><!-- Class too large for clover -->\n> Do you remember the error you were getting when Clover tried to\n> instrument this file?\n>\n> I was getting:\n> [clover] /Users/niick/work/hudson/plugins/clover/work/jobs/Lucene/\n> workspace/trunk/src/test/org/apache/lucene/analysis/\n> TestASCIIFoldingFilter.java:190:10:expecting '\"', found '?'\n\nHi Nick,\n\nthis was the same error I got. I thought it may have to do with charset encoding (how does Clover detect the encoding? from the javac parameters like -source 1.4 and so on?). I have seen you added an encoding parameter to clover-setup, but I was not sure, which encoding was meant (encoding of source files, encoding of html report,... - as there was no documentation about it in clover's docs).\n\nIn the last patch on the JIRA issue, I already included the large ASCIIFoldingFilter to instrumentation (in the first patch, I only preserved all config from the Clover 1.x analysis to be sure to have a working FileSet). I then noticed, that Clover 2.4 was able to instrument this file and removed the exclusion.\n\nIf the charset bug is fixed in 2.6, I will then remove the ASCIIFolding Test exclusion from the patch, too.\n\nDid you review and tried out my last patch?",
            "date": "2009-08-05T08:49:33.516+0000",
            "id": 11
        },
        {
            "author": "Uwe Schindler",
            "body": "Hi Nick,\n\nI have another question about the instrumentation.\nYou may have noticed, that \"ant test\" runs all tests from core and crontrib, which are (now) correctly instrumented. After this, a special backwards branch is checked out from SVN containing all tests from Lucene 2.4 (with minor modifications when internal fields/methods were tested that changed), to test backwards compatibility. These tests are *compiled against the old 2.4 Lucene JAR* and then packaged as jar. After that these tests are *run against the trunk* (by that we test that drop-in-replacements of the Lucene JAR work with 2.9 and also that all backwards compatibility layers in Lucene core still work the same as before).\n\nAll tests in Lucene Core use only the new API, so to test the old APIs, the backwards tests do their job for the deprecated methods. The problem is now, that I cannot simply add this special build step to the clover analysis, because all bw test names are the same as in 2.9, so the linkage in the clover reports between tests and source code are completely broken. If I leave out the backwards tests (they are currently not in <testsources>, this is the current state of the latest patch), we have some \"untested\" code parts (because the methods are never called by core).\n\nIs there any possibility to also fold in the coverage of the backwards tests, but without linking the test source code to it? Should we generate two clover reports (one for core, one for backwards)?",
            "date": "2009-08-05T08:59:01.603+0000",
            "id": 12
        },
        {
            "author": "Nick Pellow",
            "body": "Hi Uwe,\n\nThanks for confirming that error. It was definitely a problem with Clover not correctly handling a unicode 4.1 character in the source file.\nClover was incorrectly asserting that if Character.isDefined(); returns false, then the character is illegal. That method only returns true for unicode Unicode 4.0 characters in java 1.5, and 1.6 I believe. I have changed the check to Character.isValidCodePoint http://java.sun.com/j2se/1.5.0/docs/api/java/lang/Character.html#isValidCodePoint(int)\nwhich fixes the problem.\n\nSo, I will get you a development build of Clover 2.6 with this fix and also with support for the org.apache site license by the end of this week.\n\n\nI reviewed the patch, but didn't test it out. It looks good.\nWe could drop the encoding parameter on clover-setup. It was me trying to fix the above mentioned bug.\n\nCheers,\nNick\n",
            "date": "2009-08-05T09:00:56.685+0000",
            "id": 13
        },
        {
            "author": "Nick Pellow",
            "body": "bq. we have some \"untested\" code parts (because the methods are never called by core).\n\nAre these untested parts in the test cases? To generate the code coverage of an application, the test cases don't need to be instrumented. Instrumentation of tests cases is needed only for \"per-test coverage\", which you may not need for your regression tests\n\nbq. so the linkage in the clover reports between tests and source code are completely broken. \n\nIn what way is it broken? Are the test method names missing, or do you have duplicate test methods? There should be one testMethod listed for each test run that occured.\n\nbq. Is there any possibility to also fold in the coverage of the backwards tests, but without linking the test source code to it?\n\nI'm guessing that not instrumenting your old tests should do what you want.\n\nbq. Should we generate two clover reports (one for core, one for backwards)?\n\nThis is also an option. Clover2 will link the reports together if you generate them in the same <clover-report/> block.\n",
            "date": "2009-08-05T09:28:44.528+0000",
            "id": 14
        },
        {
            "author": "Uwe Schindler",
            "body": "Hi Nick,\n\nI will look into this at the end of the week, when you sent me the 2.6 snapshot build. My problems are currently:\nThe tests are not directly  instumented (neither in core nor contrib nor bw). Currenty the core classes and contrib classes are instrumented. The testcases are linked in clover-setup via <testsources>, if I leave this out, I get 0% coverage. The backwards tests do not appear in testsources. Because of that, the tests still call the instrumented classes, but the coverage report shows no coverage. You can easily see this e.g. for the old HitCollector backwards compatibility code. Also during running of the bw-tests, no additional files are created during tests runs in the db folder.\nIf I add the bw-test cases with testsources to the clover config, the clover report mixes the linkage of the tests together and you see sometimes 2 test with same name hitting the same method and so on.\nIs there a possibility to tell clover, that you do not want to explicitely link the testcases of the backwards test and just measure coverage regardless of which class called the instrumented classes? I do not know, why the calls from \"unknown\" tests are not counted for the coverage.\n\nEDIT: If I run \"ant test-tag\" alone with a fresh created clover database, it seems to work. It shows the coverage in the methods called by the tests, but the tests itsself do not appear in the report (as it should be, because only the core tests are added to testsources). It seems to be only a problem, when the backwards and core tests are both instrumented to the same database. Maybe the equal testnames/classes lead to problems.\n\nI will test this further on Friday, I have no time now, but I think, the problem seems to be solveable. Maybe I had some misunderstanding in the clover report. I will compare then the three different reports (core, backwards, core+backwards combined) for differences. Maybe all is good :)",
            "date": "2009-08-05T10:46:02.513+0000",
            "id": 15
        },
        {
            "author": "Nick Pellow",
            "body": "Hi Uwe, \n\nClover will still produce code coverage for your application sources, regardless of the tests being instrumented or not.\n\nDid you try the using following fileset in clover-setup from my patch?:\n\n{code}\n<fileset dir=\"src\">\n            <!-- see https://issues.apache.org/jira/browse/LUCENE-1772 -->\n            <include name=\"**/org/apache/**\"/>\n</fileset>\n{code}\n\nClover will automatically detect any tests it finds as it instruments the source code.\n\nAlso, to remove the need to have the clover.jar on Ant's classpath, it is best to use the classpath on the taskdef for cloverlib.xml like so: \n{code}\n<property name=\"clover.jar\" value=\"path/to/clover.jar\"/>\n<taskdef resource=\"cloverlib.xml\" classpath=\"${clover.jar}\"/>\n{code}\nThis makes upgrading the version of clover being used very easy.\n\n\nI will upload a dev build of Clover 2.6 for you to test with the new org.apache site license.\n\nCheers,\nNick",
            "date": "2009-08-06T00:39:32.442+0000",
            "id": 16
        },
        {
            "author": "Nick Pellow",
            "body": "I've provided a download of the jar, just for you [here|http://www.atlassian.com/software/clover/downloads/binary/clover-2.6.0-dev.jar]. Please note that this is a dev build.\n\nThis is a development build of Clover 2.6 . It has support for recognizing the org.apache site license attached to this issue.\nSimply put the clover.jar and the attached clover.license in the same directory as each other, and point the taskdef task to use\nthe clover.jar for the classpath attribute.",
            "date": "2009-08-06T01:09:19.592+0000",
            "id": 17
        },
        {
            "author": "Nick Pellow",
            "body": "When this is integrated and committed to svn, someone from Atlassian will send the following email to the lucene mailing list confirming the usage and terms of the site license.\n\n{quote}\nThis Clover license can be used for any code that is under an org.apache package. Further, this license can be used by any developer on their machine in conjunction with our Eclipse or IntelliJ plugins for development on an org.apache project. \n{quote}",
            "date": "2009-08-06T01:30:08.778+0000",
            "id": 18
        },
        {
            "author": "Uwe Schindler",
            "body": "I will look into this later. Thanks for the JAR and license!\n\nbq. Clover will automatically detect any tests it finds as it instruments the source code.\n\nBut they must not be tests nor available as source code? I say this, because the backwards tests are not available as source code, they are only packaged in a JAR and then run against the trunk Lucene JAR (instrumented). So there is nothing that could be detected as test from source code.\n\nI will try out and verify as I noted in the EDIT of my last comment. It seems that the code was instrumented without any linkage to test source code (it was enough that the instrumented code was ran).",
            "date": "2009-08-06T06:55:51.909+0000",
            "id": 19
        },
        {
            "author": "Mark Miller",
            "body": "Would be cool to get this issue wrapped up ...",
            "date": "2009-12-16T01:37:39.425+0000",
            "id": 20
        },
        {
            "author": "Uwe Schindler",
            "body": "For fixing the clover analysis on hudson, the patch must be applied and the license and JAR file copied to hudson. I will try out again during the day and verify everything.\n\nCurrently we should think about the new clover license and upgrade to the latest version. Our \"official\" one  in SVN's committers area 2.4.3 also works for this (I will try this out, too).",
            "date": "2009-12-16T07:11:39.842+0000",
            "id": 21
        },
        {
            "author": "Uwe Schindler",
            "body": "Here updated patch for current trunk.\n\nI would like to commit this, but it would break hudson. Somebody with hudson access (command line + config) should do the following:\n\n- download [http://www.atlassian.com/software/clover/downloads/binary/clover-ant-2.5.1.zip] and extract the clover.jar\n- download [https://svn.apache.org/repos/private/committers/donated-licenses/clover/2.4.3/clover.license]\n- put both files into a directory that is persistent on hudson\n- reconfigure hudson to let the ANT_LIB path point to this dir\n- I will commit my patch\n\n...and then we have fresh and complete reports after the next run.\n\nI verified: All runs are instrumented and linkage with tests work. Also test-tag is instrumented, but lnk to tests is missing (this is wanted), as the trunk tests count.",
            "date": "2009-12-16T14:58:19.036+0000",
            "id": 22
        },
        {
            "author": "Uwe Schindler",
            "body": "I verified, the latest clover version (2.6.3) with the attached license (the one attached by Nick) is working perfect.",
            "date": "2009-12-16T17:37:45.786+0000",
            "id": 23
        },
        {
            "author": "Uwe Schindler",
            "body": "Further optimization to instrument all files, also test. Also add the test for ASCII folding back (was bug in 2.5.1).\n\nWhen hudson is reconfigured, this should be ready for commit.",
            "date": "2009-12-16T18:29:47.517+0000",
            "id": 24
        },
        {
            "author": "Uwe Schindler",
            "body": "I committed the latest patch in revision: 891402\n\nI keep this open because of further improvements with license and maybe ship it with lucene.",
            "date": "2009-12-16T19:46:01.962+0000",
            "id": 25
        },
        {
            "author": "Uwe Schindler",
            "body": "Howto to install locally:\n\n- download [http://repo2.maven.org/maven2/com/cenqua/clover/clover/2.6.3/clover-2.6.3.jar]\n- fetch the attached license [https://issues.apache.org/jira/secure/attachment/12415461/clover.license]\n\nput both in your ANT lib path - have fun.",
            "date": "2009-12-16T20:25:41.376+0000",
            "id": 26
        },
        {
            "author": "Uwe Schindler",
            "body": "Improvements, will commit soon:\n\n- separate core/contrib and tag tests completely. Currently the xml files for test report generation are mixed together, so tag tests overwrite core results. This was by the way the reason for the defect in clover 1.x - only recorded test runs were instrumented. Also contrib was missing. The junit report now generates a separate report for test-tag\n- the test results are now also used in clover analysis. This helps when real JUnit4 tests are used.",
            "date": "2009-12-17T20:58:17.155+0000",
            "id": 27
        },
        {
            "author": "Uwe Schindler",
            "body": "Updated license file from Atlassian. Thanks Nicholas Muldoon!",
            "date": "2009-12-18T11:07:03.539+0000",
            "id": 28
        },
        {
            "author": "Uwe Schindler",
            "body": "Updated license file from Atlassian. Thanks Nicholas Muldoon! (without ASF grant attached)",
            "date": "2009-12-18T11:09:37.094+0000",
            "id": 29
        },
        {
            "author": "Uwe Schindler",
            "body": "It seems to work, so closing this issue.",
            "date": "2010-02-09T13:17:18.701+0000",
            "id": 30
        }
    ],
    "component": "general/build",
    "description": "This is a followup for [http://www.lucidimagination.com/search/document/6248d6eafbe10ef4/build_failed_in_hudson_lucene_trunk_902]\n\nThe problem with clover running on hudson is, that it does not instrument all tests ran. The autodetection of clover 1.x is not able to find out which files are the correct tests and only instruments the backwards test. Because of this, the current coverage report is only from the backwards tests running against the current Lucene JAR.\n\nYou can see this, if you install clover and start the tests. During test-core no clover data is added to the db, only when backwards-tests begin, new files are created in the clover db folder.\n\nClover 2.x supports a new ant task, <testsources> that can be used to specify the files, that are the tests. It works here locally with clover 2.4.3 and produces a really nice coverage report, also linking with test files work, it tells which tests failed and so on.\n\nI will attach a patch, that changes common-build.xml to the new clover version (other initialization resource) and tells clover where to find the tests (using the test folder include/exclude properties).\n\nOne problem with the current patch: It does *not* instrument the backwards branch, so you see only coverage of the core/contrib tests. Getting the coverage also from the backwards tests is not easy possible because of two things:\n- the tag test dir is not easy to find out and add to <testsources> element (there may be only one of them)\n- the test names in BW branch are identical to the trunk tests. This completely corrupts the linkage between tests and code in the coverage report.\n\nIn principle the best would be to generate a second coverage report for the backwards branch with a separate clover DB. The attached patch does not instrument the bw branch, it only does trunk tests.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1769",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Fix wrong clover analysis because of backwards-tests, upgrade clover to 2.6.3 or better",
    "systemSpecification": true,
    "version": "3.1"
}