{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "here's a quick stab at a patch.\n\nI had to add at least minimal support to ReusableAnalyzerBase in case you want charfilters,\nsince it doesn't have any today.\n\nmaybe there is a better way to do it though.\n",
            "date": "2010-11-08T20:56:54.976+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "CharFilter must at least also implement read() to read one char. This is not needed by most tokenizers, but like that its incomplete. It does *not* need to impl char[] without offset and count.\n\nElse looks fine for now in reusable.",
            "date": "2010-11-08T21:08:11.166+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "bq. CharFilter must at least also implement read() to read one char. \n\nThats incorrect.\nonly read(char[] cbuf, int off, int len)  is abstract in Reader.\nCharStream extends Reader, but only adds correctOffset.\nCharFilter extends CharStream, but only delegates read(char[] cbuf, int off, int len) \n\nSo implementing read() only adds useless code duplication here.",
            "date": "2010-11-08T21:13:01.079+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Ay, ay \"Code Dup Policeman\".\n\nFrom perf standpoint for real FilterReaders in java.io that would be no-go, but here it's fine as Tokenizers always buffer. Also java.io's FilterReader are different and delegate this method, but not CharFilter.",
            "date": "2010-11-08T23:48:31.384+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "Wait, thats an interesting point, any advantage to actually using \"real FilterReaders\" for this API?\n",
            "date": "2010-11-08T23:55:49.021+0000",
            "id": 4
        },
        {
            "author": "DM Smith",
            "body": "I'm not too keen on this. For classics and ancient texts the standard analyzer is not as good as the simple analyzer. I think it is important to have a tokenizer that does not try to be too smart. I think it'd be good to have a SimpleAnalyzer based upon UAX#29, too.\n\nThen I'd be happy.",
            "date": "2010-11-09T04:20:39.399+0000",
            "id": 5
        },
        {
            "author": "Steve Rowe",
            "body": "Robert, your patch looks good - I have a couple of questions:\n\n* You removed {{TestHindiFilters.testTokenizer()}}, {{TestIndicTokenizer.testBasics()}} and {{TestIndicTokenizer.testFormat()}}, but these would be useful in {{TestStandardAnalyzer}} and {{TestUAX29Tokenizer}}, wouldn't they?\n* You did not remove {{ArabicLetterTokenizer}} and {{IndicTokenizer}}, presumably so that they can be used with Lucene 4.0+ when the supplied {{Version}} is less than 3.1 -- good catch, I had forgotten this requirement -- but when can we actually get rid of these?  Since they will be staying, shouldn't their tests remain too, but using {{Version.LUCENE_30}} instead of {{TEST_VERSION_CURRENT}}?",
            "date": "2010-11-09T04:25:01.509+0000",
            "id": 6
        },
        {
            "author": "Steve Rowe",
            "body": "bq. I'm not too keen on this. For classics and ancient texts the standard analyzer is not as good as the simple analyzer. I think it is important to have a tokenizer that does not try to be too smart. I think it'd be good to have a SimpleAnalyzer based upon UAX#29, too.\n\n{{UAX29Tokenizer}} could be combined with {{LowercaseFilter}} to provide that, no?\n\nRobert is arguing in the reopened LUCENE-2167 for {{StandardTokenizer}} to be stripped down so that it only implements UAX#29 rules (i.e., dropping URL+Email recognition), so if that comes to pass, {{StandardAnalyzer}} would just be UAX#29+lowercase+stopword (with English stopwords by default, but those can be overridden in the ctor) -- would that make you happy?",
            "date": "2010-11-09T04:43:01.744+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "bq. You removed TestHindiFilters.testTokenizer(), TestIndicTokenizer.testBasics() and TestIndicTokenizer.testFormat(), but these would be useful in TestStandardAnalyzer and TestUAX29Tokenizer, wouldn't they?\n\noh, i just deleted everything associated with that tokenizer...\n\nbq. You did not remove ArabicLetterTokenizer and IndicTokenizer, presumably so that they can be used with Lucene 4.0+ when the supplied Version is less than 3.1 - good catch, I had forgotten this requirement - but when can we actually get rid of these? Since they will be staying, shouldn't their tests remain too, but using Version.LUCENE_30 instead of TEST_VERSION_CURRENT?\n\ni removed the indictokenizer (unreleased) and deleted its tests.\nbut i kept and deprecated the arabic one, since we have released it.\n",
            "date": "2010-11-09T09:15:58.124+0000",
            "id": 8
        },
        {
            "author": "Simon Willnauer",
            "body": "I looked at the patch briefly and the charStream(Reader) extension looks good to me while I would make it protected and throw a IOException. Since this API is public and folks will use it in the wild we need to make sure we don't have to add the exception later or people creating Readers have to play tricks just because the interface has no IOException. About making it protected, do we need to call that in a non-protected context, maybe I miss something..\n{code}\n public Reader charStream(Reader reader) {\n   return reader;\n }\n\n// should be \n\n  protected Reader charStream(Reader reader) throws IOException{\n    return reader;\n  }\n{code}\n",
            "date": "2010-11-09T10:28:00.460+0000",
            "id": 9
        },
        {
            "author": "Robert Muir",
            "body": "Simon: i agree with both those points... we should change the method signature.\n\nalso i called it charStream (this is what Solr's analyzer calls it), but this is slightly confusing since the api is all Reader-based.\nalternatively we could give this a different name, wrapReader or something... not sure, i didnt have any better ideas than charStream.\n\n",
            "date": "2010-11-09T10:34:22.887+0000",
            "id": 10
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. ...alternatively we could give this a different name, wrapReader or something... not sure, i didnt have any better ideas than charStream.\nwrapReader seem to be to specific what about initReader?",
            "date": "2010-11-09T10:46:28.905+0000",
            "id": 11
        },
        {
            "author": "Robert Muir",
            "body": "bq. I'm not too keen on this. For classics and ancient texts the standard analyzer is not as good as the simple analyzer.\n\nDM, can you elaborate here? \n\nAre you speaking of the existing StandardAnalyzer in previous releases, that doesn't properly deal with tokenizing diacritics, etc?\nThis is the reason these \"special\" tokenizers exist: to work around those bugs.\nbut StandardTokenizer now handles this stuff fine, and they are obselete.\n\nI'm confused though, in previous releases how SimpleAnalyzer would ever be any better, since it would barf on these diacritics too,\nit only emits tokens that are runs of Character.isLetter\n\nOr is there something else i'm missing here?\n",
            "date": "2010-11-09T11:10:47.821+0000",
            "id": 12
        },
        {
            "author": "Robert Muir",
            "body": "here's an updated patch.\n\nin reality the previous patch was a problem: because initReader() was in the TokenStream components,\nit caused code duplication in any Analyzer, as it had to specifiy its CharFilter twice: once in the createComponents for the initial Reader,\nand once in the TokenStreamComponents implementation for reset(Reader).\n\nSo i moved this to just be a method of ReusableAnalyzerBase.\n\nAlso, i didn't apply the 'throws IOException'. After re-thinking, there is no need to do this.\nNone of our CharFilters for example, throw IOExceptions in their ctors.\nEven the Analyzer.tokenStream method cannot throw IOException.\n\nWe shouldn't add 'throws X exception' just because some arbitrary user class MIGHT throw it,\nthey might throw SQLException, or InvalidMidiDataException too.",
            "date": "2010-11-09T11:54:11.569+0000",
            "id": 13
        },
        {
            "author": "DM Smith",
            "body": "bq. DM, can you elaborate here?\n\nI was a bit trigger happy with the comment. I should have looked at the code rather than the jira comments alone. The old StandardAnalyzer had a kitchen sink approach to tokenizations trying to do too much with *modern* constructs, e.g. URLs, email addresses, acronyms.... It and SimpleAnalyzer would produce about the same stream on \"old\" English and some other texts, but the StandardAnalyzer was much slower. (I don't remember how slow, but it was obvious.)\n\nBoth of these were weak when it came to non-English/non-Western texts. Thus I could take the language specific tokenizers, lists of stop words, stemmers and create variations of the SimpleAnalyzer that properly handled a particular language. (I created my own analyzers because I wanted to make stop words and stemming optional)\n\nIn looking at the code in trunk (should have done that before making my comment), I see that UAX29Tokenizer is duplicated in the StandardAnalyzer's jflex and that ClassicAnalyzer is the old jflex. Also, the new StandardAnalyzer does a lot less.\n\nIf I understand the suggestion of this and the other 2 issues, StandardAnalyzer will no longer handle modern constructs. As I see it this is what SimpleAnalyzer should be: Based on UAX29 and does little else. Thus my confusion. Is there a point to having SimpleAnalyzer? Shouldn't UAX29Tokenizer be moved to core? (What is core anyway?)\n\nAnd if I understand where this is going: Would there be a way to plugin ICUTokenizer as a replacement for UAX29Tokenizer into StandardTokenizer, such that all Analyzers using StandardTokenizer would get the alternate implementation?",
            "date": "2010-11-09T13:54:33.123+0000",
            "id": 14
        },
        {
            "author": "Robert Muir",
            "body": "DM, thanks, I see exactly where you are coming from.\n\nI see your point: previously it was much easier to take something like SimpleAnalyzer and 'adapt' it to a given language based on things like unicode properties.\nIn fact thats exactly what we did in the cases here (Arabic, Persian, Hindi, etc)\n\nBut now we can actually tokenize \"correctly\" for more languages with jflex, thanks to its improved unicode support, and its superior to these previous hacks :)\n\nto try to answer some of your questions (all my opinion):\n\nbq. Is there a point to having SimpleAnalyzer\n\nI guess so, a lot of people can use this if they have english-only content and are probably happy with discard numbers etc... its not a big loss to me if it goes though.\n\nbq. Shouldn't UAX29Tokenizer be moved to core? (What is core anyway?)\n\nIn trunk (4.x codeline) there is no core, contrib, or solr for analyzer components any more. they are all combined into modules/analysis.\nIn branch_3x (3.x codeline) we did not make this rather disruptive refactor: there UAX29Tokenizer is in fact in lucene core.\n\nbq. Would there be a way to plugin ICUTokenizer as a replacement for UAX29Tokenizer into StandardTokenizer, such that all Analyzers using StandardTokenizer would get the alternate implementation?\n\nPersonally, i would prefer if we move towards a factory model where things like these supplied \"language analyzers\" are actually xml/json/properties snippets.\nIn other words, they are just example configurations that builds your analyzer, like solr does.\nThis is nice, because then you dont have to write code to easily customize how your analyzer works.\n\nI think we have been making slow steps towards this, just doing basic things like moving stopwords lists to .txt files.\nBut i think the next step would be LUCENE-2510, where we have factories/config attribute parsers for all these analysis components already written.\n\nThen we could have support for declarative analyzer specification via xml/json/.properties/whatever, and move all these Analyzers to that.\nI still think you should be able to code up your own analyzer, but in my opinion this is much easier and preferred for the ones we supply.\n\nAlso i think this would solve a lot of analyzer-backwards-compat problems, because then our supplied analyzers are really just configuration file examples,\nand we can change our examples however we want... someone can use their old config file (and hopefully old analysis module jar file!) to guarantee\nthe exact same behavior if they want.\n\nFinally, most of the benefits of ICUTokenizer are actually in the UAX29 support... the tokenizers are pretty close with some minor differences:\n* the jflex-based implementation is faster, and better in my opinion.\n* the ICU-based implementation allows tailoring, and supplies tailored tokenization for several complex scripts (jflex doesnt have this... yet)\n* the ICU-based implementation works with all of unicode, at the moment jflex is limited to the basic multilingual plane.\n\nIn my opinion the last 2 points will probably be eventually resolved... i could see our ICUTokenizer possibly becoming obselete down the road \nby some better jflex support, though it would have to probably have hooks into ICU for the complex script support (so we get it for free from ICU)\n",
            "date": "2010-11-09T14:32:50.089+0000",
            "id": 15
        },
        {
            "author": "DM Smith",
            "body": "Robert, I think we are on the same wavelength. Thanks.\n\nI like the idea of declarative analyzers, too.\n\nRegarding the \"last 2 points\" has anyone given input to the JFlex team on these needs?",
            "date": "2010-11-10T02:22:25.653+0000",
            "id": 16
        },
        {
            "author": "Steve Rowe",
            "body": "DM, I'm a committer on the JFlex team.  About the second to last point: when Robert said \"(jflex doesnt have this... yet)\" he meant the jflex-based implementation, not JFlex itself.\n\nAbout the last point, JFlex is shooting for level 1 compliance with [UTS#18 Unicode Regular Expressions|http://unicode.org/reports/tr18/], which requires conforming implementations to \"handle the full range of Unicode code points, including values from U+FFFF to U+10FFFF.\"",
            "date": "2010-11-10T04:45:26.884+0000",
            "id": 17
        },
        {
            "author": "DM Smith",
            "body": "{quote}\nbq. Shouldn't UAX29Tokenizer be moved to core? (What is core anyway?)\n\nIn trunk (4.x codeline) there is no core, contrib, or solr for analyzer components any more. they are all combined into modules/analysis.\nIn branch_3x (3.x codeline) we did not make this rather disruptive refactor: there UAX29Tokenizer is in fact in lucene core.\n{quote}\n\nI meant o.a.l.analysis.core. I'd expect the *premier* analyzers to be in core.\n\n{quote}\nbq. Is there a point to having SimpleAnalyzer\n\nI guess so, a lot of people can use this if they have english-only content and are probably happy with discard numbers etc... its not a big loss to me if it goes though.\n{quote}\n\nI guess I meant: Shouldn't the SimpleAnalyzer just be constructed the same as StandardAnalyzer with the addition of a Filter that pitch tokens that are not needed?\nWith the suggestion in LUCENE-2167 to use UAX29Tokenizer for StandardAnalyzer, effectively deprecating EMAIL and URL and possibly adding some kind of PUNCTUATION (so that URLs/emails/acronyms... can be reconstructed, if someone desires), the StandardAnalyzer is about as simple as one could get and properly handle non-english/non-western languages. It just creates ALPHANUM,  NUM and PUNCTUATION (if added) that SimpleAnalyzer does not care about.\n",
            "date": "2010-11-10T11:28:29.602+0000",
            "id": 18
        },
        {
            "author": "Robert Muir",
            "body": "bq. I meant o.a.l.analysis.core. I'd expect the premier analyzers to be in core.\n\nI guess the package doesn't make a big difference to me, all the analyzers are in one place and the same.\nits true we mixed the \"core\" analysis stuff with contrib and solr, but if there are warts with the contrib stuff,\nwe should be able to clean it up (I think this has been happening)\n\nbq. I guess I meant: Shouldn't the SimpleAnalyzer just be constructed the same as StandardAnalyzer with the addition of a Filter that pitch tokens that are not needed?\n\nI don't think so, this seems like a trap. Lots of people use StandardTokenizer without any filter... I don't think \nit should emit trash (punctuation). if you want to do the other stuff, you can use ClassicTokenizer, or even \nWhitespaceTokenizer and filter to your heart's content.\n",
            "date": "2010-11-10T11:41:59.154+0000",
            "id": 19
        },
        {
            "author": "DM Smith",
            "body": "Robert, Let me ask another way. How about implementing StandardTokenizer using jflex to be UAX29Tokenizer minus NUM and ALPHANUM?",
            "date": "2010-11-10T12:45:01.599+0000",
            "id": 20
        },
        {
            "author": "Steve Rowe",
            "body": "bq. How about implementing StandardTokenizer using jflex to be UAX29Tokenizer minus NUM and ALPHANUM?\n\nDM, ALPHANUM is the only \"word\" token type - there is no ALPHA or WORD type - from the UAX29Tokenizer javadocs:\n\n{quote}\nTokens produced are of the following types:\n\n* <ALPHANUM>: A sequence of alphabetic and numeric characters\n* <NUM>: A number\n* <SOUTHEAST_ASIAN>: A sequence of characters from South and Southeast Asian languages, including Thai, Lao, Myanmar, and Khmer\n* <IDEOGRAPHIC>: A single CJKV ideographic character\n* <HIRAGANA>: A single hiragana character\n{quote}\n\nSo I guess you think that StandardAnalyzer should exclude tokens that have numeric characters in them?",
            "date": "2010-11-10T14:06:41.852+0000",
            "id": 21
        },
        {
            "author": "Robert Muir",
            "body": "bq. Robert, Let me ask another way. How about implementing StandardTokenizer using jflex to be UAX29Tokenizer minus NUM and ALPHANUM?\n\nI think, as i already commented, that it would be best if StandardTokenizer just implemented the UAX#29 algorithm.\nits a great default and I dont think we should try to alter it.\n",
            "date": "2010-11-10T14:16:44.749+0000",
            "id": 22
        },
        {
            "author": "DM Smith",
            "body": "Robert/Steven, I'm sorry. I fat fingered the last post. I really need to take more care.\n    s/Standard/Simple/;\n\nThat is, SimpleAnalyzer is not appropriate for many languages. If it were based upon a variation of UAX29Tokenizer, but didn't handle NUM or ALPHANUM, but WORD instead, it would be the same type of token stream, just alpha words.\n\nRegarding compatibility: I think the results for English would be nearly, if not, identical. Western European would only be slightly off from identical. But for other languages it would be an improvement.\n\nAt this point, I'm content with what you guys are doing with non-English texts. Great job.\n",
            "date": "2010-11-10T17:38:31.940+0000",
            "id": 23
        },
        {
            "author": "Steve Rowe",
            "body": "bq. That is, SimpleAnalyzer is not appropriate for many languages. If it were based upon a variation of UAX29Tokenizer, but didn't handle NUM or ALPHANUM, but WORD instead, it would be the same type of token stream, just alpha words.\n\nDM, if you want, I could help you convert UAX29Tokenizer in this way - I hang out on IRC #lucene and #lucene-dev a lot of the time.  I think you'd want to call it something other than SimpleAnalyzer, though - maybe UAX29AlphabeticTokenizer?",
            "date": "2010-11-10T17:48:24.851+0000",
            "id": 24
        },
        {
            "author": "Robert Muir",
            "body": "bq. That is, SimpleAnalyzer is not appropriate for many languages. If it were based upon a variation of UAX29Tokenizer, but didn't handle NUM or ALPHANUM, but WORD instead, it would be the same type of token stream, just alpha words.\n\nOk, now i understand you, and yes I agree...  My question is, should we even bother fixing it? Like would anyone who actually cares about unicode really want only some hacked subset of UAX#29 ?\n\nThese simple ones like SimpleAnalyzer, WhitespaceAnalyzer, StopAnalyzer are all really bad for Unicode text in different ways, though Simple/Stop are bigger offenders i think, because they will separate a base character from its combining characters (in my opinion, this should always be avoided) and worse: they will break on these.\n\nBut people using them are probably happy? e.g. you can do like Solr,  use whitespaceanalyzer and follow thru with something like WordDelimiterFilter and its mostly ok, depending upon options, except for cases like CJK where its a death trap.\n\nPersonally i just don't use these things since I know the problems, but we could document \"this is simplistic and won't work well for many languages\" and keep them around for people that don't care?\n\nAnd yeah i suppose its confusing these really \"simple\" ones are in the .core package, but to me the package is meaningless, i was just trying to keep the analyzers arranged in some kind of order (e.g. pattern-based analysis in the .pattern package, etc).\n\nWe could just as well call the package .basic or .simple or something else, its just a name.\n",
            "date": "2010-11-10T17:58:28.414+0000",
            "id": 25
        },
        {
            "author": "DM Smith",
            "body": "Robert, I think\n* \"core\" is a bad name that needs to be changed. It is misleading.\n* Documentation should be improved along the lines you suggest.\n\nYou mention a few broken Analyzers (and by implication related tokenizers and filters). I've a question about LowerCaseFilter: Isn't it bad as well?\n",
            "date": "2010-11-10T18:13:42.821+0000",
            "id": 26
        },
        {
            "author": "Robert Muir",
            "body": "OK, i'd like to move forward with this if there are no objections, it improves these analyzers by improving their multilingual\ncapabilities, allowing them to support numbers etc, and deprecates/removes useless custom code (only unreleased functionality is removed)\n\nWe also add CharFilter support to the ReusableAnalyzerBase, which was missing before.\n\nDM: we can open a followup issue to improve the docs for the simplistic tokenizers as discussed here.\n",
            "date": "2010-11-30T01:34:23.357+0000",
            "id": 27
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 1043114, 1043181 (3x)",
            "date": "2010-12-07T19:52:05.763+0000",
            "id": 28
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:50:19.189+0000",
            "id": 29
        }
    ],
    "component": "modules/analysis",
    "description": "As of Lucene 3.1, StandardTokenizer implements UAX#29 word boundary rules to provide language-neutral tokenization.  Lucene contains several language-specific tokenizers that should be replaced by UAX#29-based StandardTokenizer (deprecated in 3.1 and removed in 4.0).  The language-specific *analyzers*, by contrast, should remain, because they contain language-specific post-tokenization filters.  The language-specific analyzers should switch to StandardTokenizer in 3.1.\n\nSome usages of language-specific tokenizers will need additional work beyond just replacing the tokenizer in the language-specific analyzer.  \n\nFor example, PersianAnalyzer currently uses ArabicLetterTokenizer, and depends on the fact that this tokenizer breaks tokens on the ZWNJ character (zero-width non-joiner; U+200C), but in the UAX#29 word boundary rules, ZWNJ is not a word boundary.  Robert Muir has suggested using a char filter converting ZWNJ to spaces prior to StandardTokenizer in the converted PersianAnalyzer.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2747",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Deprecate/remove language-specific tokenizers in favor of StandardTokenizer",
    "systemSpecification": true,
    "version": "3.1, 4.0-ALPHA"
}