{
    "comments": [
        {
            "author": "Shai Erera",
            "body": "Patch includes:\n# remove all calls to ensureOpen in IndexReader and deprecated ensureOpen().\n# remove most of the calls to ensureOpen in IndexWriter (those that happen at the beginning of methods).\n# added isOpen to both IndexReader and IndexWriter.\n# deleted some test cases that checked this functionality.\n# fixed tag (removed test cases)\n# CHANGES\n\nAll tests pass, except for TestRussianStem under contrib/analyzers. But that does not seem to be related to this patch, as it fails on a clean trunk checkout also. I think it has to do w/ encoding, but I don't know if I'm the only one that experiences that.",
            "date": "2009-06-24T13:50:29.846+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "I'd actually rather not remove the ensureOpen calls (I think it's\nbetter when the user sees an AlreadyClosedException than an NPE from\nsomewhere deeper in IndexReader), but instead change it to a best\neffort impl (ie don't use volatile).\n\nI think for nearly all the methods where we have ensureOpen today, the\ncost (once we stop checking volatile) is tiny (this coming from\nsomeone who is normally a freak about performance!).\n",
            "date": "2009-06-24T22:46:00.922+0000",
            "id": 1
        },
        {
            "author": "Shai Erera",
            "body": "bq. I'd actually rather not remove the ensureOpen calls (I think it's better when the user sees an AlreadyClosedException than an NPE from somewhere deeper in IndexReader), but instead change it to a best effort impl (ie don't use volatile). \n\nI agree that it's better to see ACE than NPE. However, I thought we agreed that nearly all applications do not rely on ACE. And even if we make it super fast, I still don't see why for a properly written application, which knows it does not access a closed reader/writer we should check ensureOpen(). And, our merge code calls document() while reading from an IndexReader, which obviously cannot be close, so why check there?\n\nTrue, ACE helps developers of good apps, which \"forgot\" they closed the reader few lines above, track the problem faster ... But then this issue becomes just changing refCount to not volatile? And nothing to do on IndexWriter? If that was the intention, then I don't think an issue is needed, and a committer can just commit this one line change?",
            "date": "2009-06-25T11:49:02.470+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "bq. However, I thought we agreed that nearly all applications do not rely on ACE\n\nIt's not that apps are relying on ACE, it's that the unlucky user who has problems is informed much more clearly that the problem is in their code and not a bug in Lucene.  It's a trap.\n\nIn the past there were a good number of users posting with confusing exceptions coming out Lucene, thinking they had hit a bug.  These users spent time, others spent time reading it, answering it, etc.  Now, I haven't seen one of those emails in quite a while.\n\nbq.  But then this issue becomes just changing refCount to not volatile? \n\nI think we should leave refCount volatile, but just assign false to a new write-once \"isOpen\" (that's not volatile) when refCount drops to false.",
            "date": "2009-06-25T13:47:52.909+0000",
            "id": 3
        },
        {
            "author": "Shai Erera",
            "body": "IndexReader already has a 'closed' member which is set to true in close(). Why not use it?\n\nIn fact, it's strange - close() decreases refCount and set 'closed' to true, but if decRef() is called from another reader (it is a public method, so maybe even from an outside app), and refCount is 0, close() will call decRef() again, and fail on assert refCount > 0. Shouldn't that be fixed?",
            "date": "2009-06-25T14:17:00.995+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "bq. IndexReader already has a 'closed' member which is set to true in close(). Why not use it?\n\nAhh perfect let's use that!\n\nbq. In fact, it's strange - close() decreases refCount and set 'closed' to true, but if decRef() is called from another reader (it is a public method, so maybe even from an outside app), and refCount is 0, close() will call decRef() again, and fail on assert refCount > 0.\n\nIf decRef() is called and refCount is 0, doClose() (not close()) is called.  I think this is right?",
            "date": "2009-06-25T14:51:01.526+0000",
            "id": 5
        },
        {
            "author": "Shai Erera",
            "body": "I tried using closed, but TestIndexReaderReopen fails. It appears that closed is used mainly to not execute close() twice (i.e., after you call it once, calling it again will do nothing) on the same instance. Even after I set closed to false wherever it should be (wherever refCount is increased or set to greater than 0), and set it to true in decRef()'s \"if (refCount == 1)\" section, the test fails. If I come up w/ isOpen, the test passes.\n\nI think it's because IndexWriter.ReadersPool closes a reader, and the test then attempts to close the reader again, then comparing the ref counts. So I'm not sure closed can be used.",
            "date": "2009-06-25T15:10:09.838+0000",
            "id": 6
        },
        {
            "author": "Shai Erera",
            "body": "bq. If decRef() is called and refCount is 0, doClose() (not close()) is called. I think this is right?\n\nIf you call decRef() and then close(), it'll be wrong? I think the solution is to set closed = true in decRef() after doClose() has returned?",
            "date": "2009-06-25T15:16:52.136+0000",
            "id": 7
        },
        {
            "author": "Michael McCandless",
            "body": "bq. So I'm not sure closed can be used.\n\nWoops, sorry closed cannot be used: it simply reflects whether the referrer who had opened the reader, has closed it.  So even once they've closed it, the reader can stibe open because others are holding references.  We need a separate member that's set as soon as refCount hits 0.\n\nbq. If you call decRef() and then close(), it'll be wrong? I think the solution is to set closed = true in decRef() after doClose() has returned?\n\nBut, if refCount hits 0 and closed is false then there's some bug lurking (in the app code or the Lucene code)?  Ie, someone did an extra decRef.  I'd rather things fail then hide the bug in that case.",
            "date": "2009-06-25T15:33:25.532+0000",
            "id": 8
        },
        {
            "author": "Shai Erera",
            "body": "bq. But, if refCount hits 0 and closed is false then there's some bug lurking (in the app code or the Lucene code)? Ie, someone did an extra decRef. I'd rather things fail then hide the bug in that case.\n\nBy that you're saying that calling decRef() and then close() is wrong, which I agree, but still possible. Why not protect against it, by setting closed=true in decRef() if refCount drops to 0? What good does \"not hiding that bug\" do?\n\nCurrently the tests pass whether I protect against it or not, so our code works fine (no surprises here). But I just think that decRef() and close() are public, which doesn't prevent anyone from calling them in whatever order one wants :).\n\nIf you don't think it's necessary to protect against it, I'll post a patch w/o it.",
            "date": "2009-06-25T15:39:50.444+0000",
            "id": 9
        },
        {
            "author": "Shai Erera",
            "body": "Patch with protecting against decRef() and close(). Lines 28-30 include this particular change, so if you disapprove, just delete these lines (assuming everything else is good :) ).",
            "date": "2009-06-25T15:59:21.644+0000",
            "id": 10
        },
        {
            "author": "Shai Erera",
            "body": "I see all access to refCount is synchronized. Why is it volatile then? Just because of ensureOpen()?",
            "date": "2009-06-25T16:14:11.838+0000",
            "id": 11
        },
        {
            "author": "Michael McCandless",
            "body": "Patch looks good; thanks Shai!\n\nbq. Why is it volatile then? \n\nGood question.  Only the ctor (which I believe is fine) and ensureOpen() access it un-synchronized, so I think we should make it un-volatile; I'll change it before committing.\n\nbq. What good does \"not hiding that bug\" do?\n\nEG, say we're working on SegmentReader an accidentally create a bug that sometimes over decRefs. By no longer throwing an exception on close (with this change) unit tests might happily pass when previously they would fail and the bug could go undetected for longer.  (Hopefully some tests would still catch the bug, but maybe not).  I think catching a bug sooner rather than later is better.\n\nCalling close many times is allowed (not a bug), and we handle that by only doing one decRef.  But too many calls to decRef is a real bug and I think we shouldn't mask/delay it.\n",
            "date": "2009-06-25T17:22:43.734+0000",
            "id": 12
        },
        {
            "author": "Shai Erera",
            "body": "bq. Patch looks good; thanks Shai! \n\nNote that decRef() sets closed=true if refCount = 0. This will protect against the other bug (calling close() then decRef() or vice versa). So if you don't want it there, we should remove it before committing.\n\nbq. so I think we should make it un-volatile; I'll change it before committing.\n\nIf we change refCount to not volatile, is this patch still needed? I.e., what's wrong w/ checking in ensureOpen if refCount <= 0, same as before?\n\nbq. But too many calls to decRef is a real bug and I think we shouldn't mask/delay it.\n\nThat would not be possible, since decRef() asserts refCount > 0 (and asserts are enabled in tests) and calls ensureOpen(). So calling decRef() twice in a raw would hit either an assert exception (tests) or ACE (assertions disabled). I think?",
            "date": "2009-06-25T18:17:57.283+0000",
            "id": 13
        },
        {
            "author": "Michael McCandless",
            "body": "bq. So calling decRef() twice in a raw would hit either an assert exception (tests) or ACE (assertions disabled). I think?\n\nLet's say I open a reader, I incRef it once somewhere.... then the reader is passed around and some other code somewhere incorrectly calls decRef twice, then finally at the end I close the reader.\n\nToday, that trips an assertion, because you decRef'd too many times, and one of them \"stole\" the ref you got from open.\n\nBut with this change, we would not trip an assertion.\n\nbq. If we change refCount to not volatile, is this patch still needed? I.e., what's wrong w/ checking in ensureOpen if refCount <= 0, same as before?\n\nDuh, right, I think we in fact have nothing to do here...",
            "date": "2009-06-25T18:47:50.834+0000",
            "id": 14
        },
        {
            "author": "Shai Erera",
            "body": "Ok I won't argue about that - these are hypothetical things anyway :).\n\nbq. Duh, right, I think we in fact have nothing to do here...\n\nExcept making refCount not volatile :).\n\nBTW, Yonik has just sent an email to java-dev on the semantics of close(). Maybe, if things need to change, we can do it as part of this issue.",
            "date": "2009-06-25T19:30:13.722+0000",
            "id": 15
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Except making refCount not volatile\n\nOK I just committed that.  How crazy to have a one-line change :)  Such contrast!\n\nbq. BTW, Yonik has just sent an email to java-dev on the semantics of close(). Maybe, if things need to change, we can do it as part of this issue.\n\nLet's do that (\"don't allow double-closing\") under a new issue?",
            "date": "2009-06-25T19:55:03.111+0000",
            "id": 16
        },
        {
            "author": "Shai Erera",
            "body": "Do you think that changing ensureOpen() to check \"if (refCount == 0)\" will speed things up a bit?",
            "date": "2009-06-25T20:20:27.928+0000",
            "id": 17
        },
        {
            "author": "Michael McCandless",
            "body": "Alas I don't think we should do that.  Eg if an app over-decRef's and refCount becomes -1 but doesn't trip the assert because assertions are off, we want to still hit the ACE.",
            "date": "2009-06-25T20:25:26.408+0000",
            "id": 18
        },
        {
            "author": "Yonik Seeley",
            "body": "bq. Do you think that changing ensureOpen() to check \"if (refCount == 0)\" will speed things up a bit? \n\nNope - not on any common CPUs.  There is normally a test instruction which sets a bunch of status flags - branching on those status flags for less-or-equal is the same exact cycle count as equal.",
            "date": "2009-06-25T20:28:52.004+0000",
            "id": 19
        },
        {
            "author": "Yonik Seeley",
            "body": "I also just double-checked and confirmed that the macro-op fusion in intel's latest processors treats CMP followed by JNE/JE the same as if followed by JA/JAE/JB/JBE.",
            "date": "2009-06-25T20:52:05.020+0000",
            "id": 20
        },
        {
            "author": "Shai Erera",
            "body": "bq. if an app over-decRef's and refCount becomes -1 but doesn't trip the assert\n\nFollowing assert we call ensureOpen, so I don't think refCount will ever be less than 0. Right?",
            "date": "2009-06-25T21:04:30.946+0000",
            "id": 21
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Following assert we call ensureOpen, so I don't think refCount will ever be less than 0. Right?\n\nHeh, you are correct!  The only place where we change refCount, we also always call ensureOpen.  So there's [currently] no way for it to slip past zero without ensureOpen noticing.\n\nStill I'd prefer to leave it, defensively, eg in case things ever change such that refCount could become negative.",
            "date": "2009-06-25T21:12:09.962+0000",
            "id": 22
        },
        {
            "author": "Shai Erera",
            "body": "sure, especially if == 0 and <= 0 perform the same in modern CPUs",
            "date": "2009-06-26T03:19:46.141+0000",
            "id": 23
        },
        {
            "author": "Robert Muir",
            "body": "Shai, I am curious: did you resolve your issue with TestRussianStem?\n\nAlthough I do not experience this problem, it is unclear why RussianAnalyzer exists when it appears to be a duplicate of snowball functionality (in contrib/snowball)\n\n{noformat}\n/**\n * Russian stemming algorithm implementation (see http://snowball.sourceforge.net for detailed description).\n *\n{noformat}",
            "date": "2009-07-01T17:28:48.785+0000",
            "id": 24
        },
        {
            "author": "Shai Erera",
            "body": "I haven't tried since then ... I think it's an encoding issue (one of the .txt files was checked out using incorrect encoding). I did change my SVN config file to add eol-style:native to a bunch of extensions, but I'm not sure if that's related. Anyway, this seemed to happen after these changes.",
            "date": "2009-07-02T06:14:16.907+0000",
            "id": 25
        },
        {
            "author": "Robert Muir",
            "body": "my code was a little out of date. I am now experiencing this problem too. \n\nI think you hit the nail on the head: the related files: wordsUnicode.txt and stemsUnicode.txt are in UTF-16 encoding. this might be causing the issue, because EOL is very different in that encoding!",
            "date": "2009-07-02T12:49:07.731+0000",
            "id": 26
        },
        {
            "author": "Shai Erera",
            "body": "so do we need to change those back to not eol-style:native? I know Mike updated a lot of files recently to eol-style:native (I think one of those two was updated as well). Why doesn't Hudson encounter this problem? I've commented out the .txt line in my SVN config. Previously I didn't have it, but I followed a page from Solr wiki (http://wiki.apache.org/solr/CommitterInfo#head-849f78497222f424339b79417056f4e510349fcb) which recommended to put it.\n\nI'll try to checkout again, though I'm not sure if that will help. I think we need to revert the change that was done on r787424. I see that on r153431 (Feb 2005) the comment is \"change eol style to LF\" - maybe it was for a reason? :)",
            "date": "2009-07-02T13:31:08.854+0000",
            "id": 27
        },
        {
            "author": "Robert Muir",
            "body": "bq. Why doesn't Hudson encounter this problem?\n\nForgive my ignorance, does hudson also run tests or just verify build? These files are only used in tests!\n\nI agree we should correct it, and perhaps to prevent other problems these files should be converted to UTF-8. \n\nFor the record I am still confused about these java-code analyzers that implement snowball algorithms, why do they exist when the same functionality is in contrib/snowball? \n",
            "date": "2009-07-02T13:36:34.687+0000",
            "id": 28
        }
    ],
    "component": "core/index",
    "description": "A spin off from here: http://www.nabble.com/Excessive-use-of-ensureOpen()-td24127806.html.\n\nWe should stop calling this method when it's not necessary for any internal Lucene code. Currently, this code seems to hurt properly written apps, unnecessarily.\n\nWill post a patch soon",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1707",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Don't use ensureOpen() excessively in IndexReader and IndexWriter",
    "systemSpecification": true,
    "version": ""
}