{
    "comments": [
        {
            "author": "Shai Erera",
            "body": "The very trivial patch",
            "date": "2008-08-13T14:00:20.916+0000",
            "id": 0
        },
        {
            "author": "Doron Cohen",
            "body": "Shai, Thanks for creating this issue and patch!\n\nI noticed you also modified the private reusableSD to be protected.\n\nThis field is just for avoiding creating a new object at each insert to the priority queue. \nNote that TopFieldDocCollector maintains its own reusable object for this matter, and it of a 'slightly' different type.\n\nI am wondering if the right thing to do is to (1) leave that field private, or (2) make it protected but then make TopFieldDocCollector  use it too.\nI'm inclined for option 1.\n\nWhat do you think? Others?",
            "date": "2008-08-13T14:33:06.414+0000",
            "id": 1
        },
        {
            "author": "Shai Erera",
            "body": "IMO, TopFieldDocCollector should be changed to use reusableSD. FieldDoc extends ScoreDoc. That's the reason I modified it to protected - for extensions of TopDocCollector who maintain in PQ ScoreDoc types (either ScoreDoc or extensions).\nI don't see any advantage in marking it private, nor any disadvantage if any extension to TopDocCollector will maintain its own ScoreDoc instance.\nIt's just that we have TopDocCollector, TopFieldDocCollector and my extension to TDC which insert ScoreDoc instances into PQ, so it made sense to me to change it to protected.",
            "date": "2008-08-14T05:23:38.729+0000",
            "id": 2
        },
        {
            "author": "Shai Erera",
            "body": "Re-thinking this - resuableSD should remain private to both TDC and TFDC. The reason is the two classes use it differently and don't share any implementation which involves this member (unlike totalHits and hq).\n\nI was in the middle of adding javadoc to the protected members and constructor (which accepts numHits and PQ) when I noticed that numHits is completely ignored by this constructor --> TopDocCollector(int numHits, PriortityQueue hq).\nThe reason is that PQ is be probably configured to hold a maximum number of hits.\n\nWhat bothers me with this constructor is that it may falsely lead users of the API to think that it limits their PQ with a maximum number of hits. I think we should remove that parameter and expose two constructors:\npublic TopDocCollector(int numHits) AND public TopDocCollector(PriorityQueue hq).\n\nIf you agree, I'll reflect that in the 2nd patch I want to create (which adds javadoc).",
            "date": "2008-08-18T06:26:06.954+0000",
            "id": 3
        },
        {
            "author": "Doron Cohen",
            "body": "You're right, this is confusing indeed.\nAlthough it is not public or protected there may users code \n(residing in same package) relying on this method so it can't\njust be removed but rather just deprecated.\n\n{quote}\nIf you agree, I'll reflect that in the 2nd patch I want to create (which adds javadoc).\n{quote}\nYes thanks!",
            "date": "2008-08-18T07:25:30.494+0000",
            "id": 4
        },
        {
            "author": "Shai Erera",
            "body": "Marked the constructor as deprecated, created another one (protected) which accepts PQ only and modified TopFieldDocCollector to use the new c'tor instead of the deprecated one.\nAlso added javadoc.",
            "date": "2008-08-18T08:09:07.241+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "Doron is this one ready to go in?",
            "date": "2008-09-03T21:50:22.674+0000",
            "id": 6
        },
        {
            "author": "Doron Cohen",
            "body": "It is, applies cleanly and seems correct. \nWill commit as soon as tests complete.\n",
            "date": "2008-09-03T23:09:46.496+0000",
            "id": 7
        },
        {
            "author": "Doron Cohen",
            "body": "Thanks Shai !",
            "date": "2008-09-03T23:19:45.862+0000",
            "id": 8
        }
    ],
    "component": "core/index",
    "description": "TopDocCollector's members and constructor are declared either private or package visible. It makes it hard to extend it as if you want to extend it you can reuse its *hq* and *totatlHits* members, but need to define your own. It also forces you to override getTotalHits() and topDocs().\nBy changing its members and constructor (the one that accepts a PQ) to protected, we allow users to extend it in order to get a different view of 'top docs' (like TopFieldCollector does), but still enjoy its getTotalHits() and topDocs() method implementations.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1356",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Allow easy extensions of TopDocCollector",
    "systemSpecification": true,
    "version": ""
}