{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "That means we can now enable MMap for all 64 bit platforms? Solaris, windows, Linux - any others except FreeBSD? FreeBSD needs to be checked, but I assume its also faster there. We can check on lucene.zones maybe.",
            "date": "2011-06-13T21:55:36.065+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "why jump the gun, we can just enable it for linux/64-bit.\n\nif others like freebsd or macos X are tested, then we add those to the list, but mmap is a little bit scary to just apply as a blanket default?\n\nin all cases it should be like the current logic: if (XYZ_OS && 64_bit && *UNMAP_SUPPORTED*)",
            "date": "2011-06-13T22:00:43.485+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Thats fine, I just wanted to talk about the whole issue what to enable when and bring together all possible platform possibilities. In general we should per default only enable SimpleFSDirectory on unknown platforms. Maybe NIO is heavily broken on OS XY (Android *lol*)?",
            "date": "2011-06-13T22:06:51.908+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "OK I cutover just Linux, 64 bit, when unmap is available.\n\nWe can open new issues for other platforms when we have some data that MMap is better...",
            "date": "2011-06-14T15:43:52.950+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "bulk close for 3.3",
            "date": "2011-07-02T02:40:18.490+0000",
            "id": 4
        }
    ],
    "component": "core/store",
    "description": "Consistently in my NRT testing on Fedora 13 Linux, 64 bit JVM (Oracle 1.6.0_21) I see MMapDir getting better search and merge performance when compared to NIOFSDir.\n\nI think we should fix the default.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-3198",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Change default Directory impl on 64bit linux to MMap",
    "systemSpecification": true,
    "version": ""
}