{
    "comments": [
        {
            "author": "Karl Wettin",
            "body": "patch root is trunk/contrib/spellcheck",
            "date": "2007-01-26T14:59:08.243+0000",
            "id": 0
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Applied, merci Karl.",
            "date": "2007-03-02T18:29:40.544+0000",
            "id": 1
        },
        {
            "author": "Karl Wettin",
            "body": "\nIt might be noteworthy that the spell checker will gather numSug * 10 hits from the a priori corpus. I suppose that number (10) was something the original author came up with when testing. In most cases it is seems to be good enough. In my refactor I've introduced a method parameter for the factor. This is probably a better looking solution than telling the user to increase numSug, as numSug saves a few clock ticks when not adding a suggestion to the priority list.\n\nThe javadocs should probaly state something like that instead.\n",
            "date": "2007-03-03T10:55:38.265+0000",
            "id": 2
        }
    ],
    "component": "general/javadocs",
    "description": "Added some javadocs that explains why the spellchecker does not work as one might expect it to.\n\nhttp://www.nabble.com/SpellChecker%3A%3AsuggestSimilar%28%29-Question-tf3118660.html#a8640395\n\n> Without having looked at the code for a long time, I think the problem is what the\n> lucene scoring consider to be best. First the grams are searched, resulting in a number\n> of hits. Then the edit-distance is calculated on each hit. \"Genetics\" is appearently the\n> third most similar hit according to Lucene, but the best according to Levenshtein.\n>\n> I.e. Lucene does not use edit-distance as similarity. You need to get a bunch of best hits\n> in order to find the one with the smallest edit-distance.\n\nI took a look at the code, and my assessment seems to be right.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-786",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Trivial",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Extended javadocs in spellchecker",
    "systemSpecification": true,
    "version": "2.0.0"
}