{
    "comments": [
        {
            "author": "Mark Miller",
            "body": "bq. I suppose this a misstake or possible due to the ASL header automation tool.\n\nYes. If BSD is an approved license, it would be nice if RAT would recognize it and then we could just add it to these files. But RAT doesn't appear to. It just looks for \"http://dojotoolkit.org/community/licensing.shtml\" and \"TMF854 Version 1.0 - Copyright TeleManagement Forum\" - which it considers modified BSD. Weak.\n\nAnyway, NOTICE should also state the license for Snowball along with the copyright as well. (reads weird - i know the copyright is there with a link - but it should state the license as well)",
            "date": "2009-10-05T16:47:56.308+0000",
            "id": 0
        },
        {
            "author": "Mark Miller",
            "body": "We should actually add a comment in the files about the BSD license as well - to keep this from being a recurring theme.",
            "date": "2009-10-05T18:09:49.192+0000",
            "id": 1
        },
        {
            "author": "Karl Wettin",
            "body": "* Added Snowball license header to static Snowball classes (SnowballProgram, Among and TestApp)\n* Refactored StringBuffer to StringBuilder in all classes\n* Added notes about above in README and package overview.",
            "date": "2009-10-08T06:57:14.541+0000",
            "id": 2
        },
        {
            "author": "Karl Wettin",
            "body": "Committed in revision 823445",
            "date": "2009-10-09T07:58:46.942+0000",
            "id": 3
        }
    ],
    "component": "modules/analysis",
    "description": "All classes in org.tartarus.snowball (but not in org.tartarus.snowball.ext) has for some reason been given an ASL header. These classes are licensed with BSD. Thus the ASL header should be removed. I suppose this a misstake or possible due to the ASL header automation tool.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1947",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Snowball package contains BSD licensed code with ASL header",
    "systemSpecification": true,
    "version": "2.9"
}