{
    "comments": [
        {
            "author": "cutting@apache.org",
            "body": "I think the plan (correct me if I'm wrong) is to fold the most useful of the\nsandbox items into the standard Lucene build tree when Lucene's code is moved to\na top-level project.  They'll still be packaged into separate jar file(s).\n\nOnce this happens, javadocs could either be built in a separate tree, or,\nperhaps better yet, put them in separate javadoc group(s):\n\nhttp://java.sun.com/j2se/1.4.2/docs/tooldocs/windows/javadoc.html#group\n\nFor example, Nutch uses groups to separate the Core \nAPIs from plugins:\n\nhttp://www.nutch.org/docs/api/overview-summary.html\n",
            "date": "2005-01-11T03:47:55.000+0000",
            "id": 0
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Yes, that's what we had agreed upon, I believe.",
            "date": "2005-01-11T04:45:04.000+0000",
            "id": 1
        },
        {
            "author": "Hoss Man",
            "body": "This bug can probably be invalidated, 1.9 will be out real-soon-now, and the initial changes to include contrib code as seperate groups of the primary javadocs is already done.\n\nSee also: LUCENE-499 -- a patch to add the javadocs for the remaining contrib modules.",
            "date": "2006-02-25T09:11:32.000+0000",
            "id": 2
        },
        {
            "author": "Doug Cutting",
            "body": "This is now fixed.  Contrib documentation is part of both the nightly builds and the 1.9 release (and hence hosted on the website).",
            "date": "2006-02-28T05:06:58.000+0000",
            "id": 3
        }
    ],
    "component": "general/website",
    "description": "This isn't something i think is crucial, but since i've been on the lucene-users\nmailing list (less then 2 months) I've seen several people post questions asking\nwhere they can find documentation on some module available in the sandbox.\n\nthe answer of course is usually that they should download the source and build\nthe javadocs themselves, but since it keeps coming up, I figured i'd suggest\nsetting up a nightly \"build\" of the whole sandbox, including the javadocs.\n\nif nothing else, it will cut down on the number of questions -- but i think it\nmay also have an added benefit to the size of the user base.  In my experience,\npeople tend to be more willing to download/install something and try it out\nafter they've read the docs online.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-332",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "nightly build/javadocs for sandbox",
    "systemSpecification": true,
    "version": ""
}