{
    "comments": [
        {
            "author": "Mark Harwood",
            "body": "Change to QueryParser and associated JUnit test",
            "date": "2006-10-30T21:59:18.000+0000",
            "id": 0
        },
        {
            "author": "Yonik Seeley",
            "body": "Looks OK to me.... Solr has had this from the start, but it was unclear if Lucene folks wanted to break scoring backward compatibility (including disabling index-time boosts).",
            "date": "2006-10-31T18:33:37.000+0000",
            "id": 1
        },
        {
            "author": "Mark Harwood",
            "body": "In my opinion the positives of this change outweigh the negatives but  is it worth consulting the java-user mailing list and canvassing  opinion before committing?",
            "date": "2006-11-01T15:19:35.000+0000",
            "id": 2
        },
        {
            "author": "Hoss Man",
            "body": "If we're going to do this, do we want to add support for \"*\" like SolrQueryParser has...\n\nhttps://svn.apache.org/viewvc/incubator/solr/trunk/src/java/org/apache/solr/search/SolrQueryParser.java?view=markup\n\nie...\n\n   fieldName:[a TO *]\n   fieldName:[* TO z]\n",
            "date": "2006-11-01T23:06:48.000+0000",
            "id": 3
        },
        {
            "author": "Otis Gospodnetic",
            "body": "I'm too tired to look at the patch, but I am +1 for this change in principal.  Voted for it in JIRA, too.",
            "date": "2006-11-03T07:10:40.000+0000",
            "id": 4
        },
        {
            "author": "Mark Harwood",
            "body": "So two +1s for this patch and no objections so far.  \n\nLast call - if there's no more comments I'll commit this later.",
            "date": "2006-11-14T21:54:54.000+0000",
            "id": 5
        }
    ],
    "component": "core/queryparser",
    "description": "Change to QueryParser to default to using new ConstantScoreRangeQuery in preference to RangeQuery\nfor range queries. This implementation is generally preferable because it \na) Runs faster \nb) Does not have the scarcity of range terms unduly influence score \nc) avoids any \"TooManyBooleanClauses\" exception.\n\nHowever, if applications really need to use the old-fashioned RangeQuery and the above\npoints are not required then the  \"useOldRangeQuery\" property can be used to revert to old behaviour.\n\nThe patch includes extra Junit tests for this flag and all other Junit tests pass",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-703",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Change QueryParser to use ConstantScoreRangeQuery in preference to RangeQuery by default",
    "systemSpecification": true,
    "version": "2.1"
}