{
    "comments": [
        {
            "author": "Michael Busch",
            "body": "The patch described above.",
            "date": "2006-11-21T07:00:02.000+0000",
            "id": 0
        },
        {
            "author": "Michael Busch",
            "body": "I attach a code coverage report of the current HEAD (revision: 477535), so people can check out how a report looks like. \n\nThe current code coverage looks not bad: 77% of the code lines are being tested by our unit tests. However, the coverage is not perfect: e. g. the PorterStemmer or IndexWriter.addIndexes(IndexReader[]) are not tested at all.",
            "date": "2006-11-21T07:10:44.000+0000",
            "id": 1
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Nice.  I think we can't include EMMA jars int he repository, though, so you'll want to add the ability to download the Jar on the fly, just like Grant did it for the benchmark stuff.\n",
            "date": "2006-11-21T17:46:40.000+0000",
            "id": 2
        },
        {
            "author": "Michael Busch",
            "body": "Good idea, I could do that. But currently we don't fetch the JUnit jars either, just give a hint where to download them in case they cannot be found in the ant classpath. I did the same with the EMMA jars. Should we do it for both (JUnit and EMMA), just for EMMA or leave it like it is for now?",
            "date": "2006-11-21T18:10:47.000+0000",
            "id": 3
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Sounds like my previous comment was off - if we don't distribute EMMA jars and just require the person to have them, what you have will do.  How about the nightly build, if we include this on the site?  I'm not familiar with it enough to comment.  Yonik and Doug will know if/how things can be set up there with EMMA jars, should we include this on the site.\n",
            "date": "2006-11-21T22:59:34.000+0000",
            "id": 4
        },
        {
            "author": "Grant Ingersoll",
            "body": "Care to update this for Clover, Michael?  Then I can hook it into the site and the nightly builds.\n\nThanks,\nGrant",
            "date": "2006-11-25T01:06:03.000+0000",
            "id": 5
        },
        {
            "author": "Michael Busch",
            "body": "Sure Grant, I will update the patch soon to use clover instead of EMMA. Great that you will add it to the website!\n\nThanks,\nMichael\n",
            "date": "2006-11-25T03:34:01.000+0000",
            "id": 6
        },
        {
            "author": "Michael Busch",
            "body": "Here it is, Grant. This new patch uses Clover to generate code coverage reports. Simply add clover.jar to the ant classpath, do a \"clean\" and run the target \"test\". During compiling Clover will automatically instrument all classes under src/java. \n\nAfter the junit tests are done, execute the new target \"generate-clover-reports\". Clover will generate the html report in build/test/clover/reports. \n\nNote: If clover.jar can not be found in the ant classpath then \"test\" will simply print an info message, saying that code coverage reports are disabled, and exeute the junit tests like it did before this patch.",
            "date": "2006-11-26T03:33:59.000+0000",
            "id": 7
        },
        {
            "author": "Grant Ingersoll",
            "body": "I'm not familiar w/ clover, but here's what I did, when trying out your patch (which works):\n\n1. applied the patch :-)\n2. Put clover.jar and clover.license (retrieved from the committers private repository into my ANT lib)\n3. Ran \"ant clover\"  -- this passed and said clover is enabled\n4.  Ran \"ant test\" \n5. ant generate-clover-reports\n6. View the reports!  They look good and I think will prove to be useful, especially for people who are looking for how they can help make Lucene better.\n\nIs there anyway to turn off clover other than removing the jar?  It seems like it takes quite a bit longer to run the tests and I was thinking I may just want to enable it when running nightly, but that most people wouldn't want it on by default even though they may have clover in there ANT lib.  \nI wanted to do something like adding a property named run.clover (off by default) that could then be overridden by -Drun.clover=true on the command line, but I admit I don't see in ANT how to AND together the clover.present attribute with this new property.  The CONDITION and AVAILABLE tasks in ANT don't seem to allow for ANDing two existing properties, or perhaps I am missing something.  I admit, though, my ANT knowledge isn't what it used to be since I moved to Maven a long time ago, so if someone can chime in here it would be appreciated.\n\nOtherwise, the patch looks good and I will commit it once we figure out whether being able to turn it off is important to people and how to do it.",
            "date": "2006-12-09T15:15:37.000+0000",
            "id": 8
        },
        {
            "author": "Grant Ingersoll",
            "body": "OK, I committed this, with a minor change so that it is off by default (thanks Erik, for the ANT info).\n\nTo  run, you need three things:\n1. clover.jar in ANT lib\n2. clover.license in ANT lib\n3. On the command line or in the your ANT properties, if you want it on all the time, you must specify -Drun.clover=true\n\nThanks, Micheal.\n\nI will incorporate this into the nightly build per http://issues.apache.org/jira/browse/LUCENE-708",
            "date": "2006-12-09T16:27:51.000+0000",
            "id": 9
        },
        {
            "author": "Grant Ingersoll",
            "body": "Committed the change.  Linked to the reports from the Resources -> Developers page on the documentation.  Current report was generated on 12/16/06.  Once Lucene 708 is resolved, these reports will be updated nightly.\n\nThanks Michael!",
            "date": "2006-12-16T20:27:15.000+0000",
            "id": 10
        }
    ],
    "component": "core/other",
    "description": "Hi all,\n\nWe should be able to measure the code coverage of our unit testcases. I believe it would be very helpful for the committers, if they could verify before committing a patch if it does not reduce the coverage. \n\nFurthermore people could take a look in the code coverage reports to figure out where work needs to be done, i. e. where additional testcases are neccessary. It would be nice if we could add a page to the Lucene website showing the report, generated by the nightly build. Maybe you could add that to your preview page (LUCENE-707), Grant?\n\nI attach a patch here that uses the tool EMMA to generate the code coverage reports. EMMA is a very nice open-source tool released under the CPL (same license as junit). The patch adds three targets to common-build.xml: \n- emma-check: verifys if both emma.jar and emma_ant.jar are in the ant classpath \n- emma-instrument: instruments the compiled code \n- generate-emma-report: generates an html code coverage report \n\nThe following steps are neccessary in order to generate a code coverage report:\n- add emma.jar and emma_ant.jar to your ant classpath (download emma from http://emma.sourceforge.net/)\n- execute ant target 'emma-instrument' (depends on compile-test, so it will compile all core and test classes)\n- execute ant target 'test' to run the unit tests\n- execute ant target 'generate-emma-report'\n\nTo view the emma report open build/test/emma/index.html",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-721",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Code coverage reports",
    "systemSpecification": true,
    "version": ""
}