{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "This patch looks good to me.  It still applies cleanly to the current [Nov 10 2006] svn head, and I think there's very little risk.  I think it makes sense to guard against double-closing.",
            "date": "2006-11-10T16:07:07.000+0000",
            "id": 0
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Looks fine to me.\n\nMaybe change this a bit:\n   public void close() throws IOException {\n-    if (!isClone)\n-      file.close();\n+    if (!isClone) {\n+      if (file != null) {\n+        file.close();\n+        file = null;\n+      }\n+    }\n   }\n\nThat if (file != null) block could be replaced with closeFile() call, I think.\n\nAlso, what was closing the file when you run this in Eclipse?",
            "date": "2006-11-10T23:31:29.000+0000",
            "id": 1
        },
        {
            "author": "Michael Busch",
            "body": "The method closeFile() belongs to FSDirectory.FSIndexOutput, so I can't call it in FSDirectory.FSIndexInput.close(). (This is hard to see if you just look at the patch file). \n\nI added the method closeFile() to FSDirectory.FSIndexOutput, because the behaviour of finalize() and close() is slightly different: finalize() simply closes the file, whereas close() calls super.close() first and closes the file then. I didn't want to change this behavior, thus I can't just call close() from finalize().\n\nBut now I am actually wondering if this behavior is correct. super.close() triggers a flush of the buffer. So in the current Lucene code, FSDirectory.FSIndexOutput.close() triggers a flush, but FSDirectory.FSIndexOutput.finalize() doesn't. Shouldn't we call flush also inside finalize() surrounded by try/catch?",
            "date": "2006-11-11T00:35:16.000+0000",
            "id": 2
        },
        {
            "author": "Michael Busch",
            "body": "Since the new testcase TestStressIndexing has been added as part of the lockless commits I see this test failing regularly. In ten runs it failed four times with the following exception:\n\n    [junit] Testsuite: org.apache.lucene.index.TestStressIndexing\n    [junit] Tests run: 1, Failures: 1, Errors: 0, Time elapsed: 33.338 sec\n    [junit] ------------- Standard Output ---------------\n    [junit] java.io.IOException: The handle is invalid.\n    [junit] ------------- ---------------- ---------------\n    [junit] ------------- Standard Error -----------------\n    [junit] java.io.IOException: The handle is invalid.\n    [junit] at java.io.RandomAccessFile.close0(Native Method)\n    [junit] at java.io.RandomAccessFile.close(RandomAccessFile.java:573)\n    [junit] at org.apache.lucene.store.FSIndexInput.close(FSDirectory.java:537)\n    [junit] at org.apache.lucene.index.CompoundFileReader.close(CompoundFileReader.java:111)\n    [junit] at org.apache.lucene.index.SegmentReader.doClose(SegmentReader.java:252)\n    [junit] at org.apache.lucene.index.IndexReader.close(IndexReader.java:637)\n    [junit] at org.apache.lucene.index.MultiReader.doClose(MultiReader.java:235)\n    [junit] at org.apache.lucene.index.IndexReader.close(IndexReader.java:637)\n    [junit] at org.apache.lucene.search.IndexSearcher.close(IndexSearcher.java:74)\n    [junit] at org.apache.lucene.index.TestStressIndexing$SearcherThread.run(TestStressIndexing.java:101)\n    [junit] ------------- ---------------- ---------------\n    [junit] Testcase: testStressIndexAndSearching(org.apache.lucene.index.TestStressIndexing):\tFAILED\n    [junit] hit unexpected exception in search2\n    [junit] junit.framework.AssertionFailedError: hit unexpected exception in search2\n    [junit] at org.apache.lucene.index.TestStressIndexing.runStressTest(TestStressIndexing.java:140)\n    [junit] at org.apache.lucene.index.TestStressIndexing.testStressIndexAndSearching(TestStressIndexing.java:161)\n    [junit] Test org.apache.lucene.index.TestStressIndexing FAILED\n\t\nIt appears to be the same problem for which I opened this issue. After applying the patch I did not see the test failing anymore (I ran it about 20 times...)\n\nI attach a new version of this patch. Now FSDirectory.FSIndexOutput.finalize() simply calls close() which triggers a flush of the buffer. I don't see a reason not do that. Anybody does?\n\nAll unit tests pass with the new patch.",
            "date": "2006-11-26T06:56:59.000+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "Hmmm.  Michael, how does the exception in this unit test tie into this issue?  Ie, I thought this issue was that only finalize would be doing a double-close?  I'm confused how the two are connected (it's awesome that your patch fixes this, but I'd like to understand why!).",
            "date": "2006-11-26T11:40:13.000+0000",
            "id": 4
        },
        {
            "author": "Michael Busch",
            "body": "Mike,\n\nyou are right, it is very weird that 1) this problem happens and 2) my patch fixes it. It took me quite a while to figure out what the real problem is but I think I have at least a guess now. \n\nThe problem again only happens on an IBM JVM. It happens rarely with your unmodified TestStressIndexing. If I change this testcase so that is does not perform the stress test on a RAMDirectory but only on a FSDirectory it happens almost always. This is VERY weird, because I did not change the stress test at all... I just commented the lines\n\n//    // First in a RAM directory:\n//    Directory directory = new RAMDirectory();\n//    runStressTest(directory);\n//    directory.close();\n\nand suddenly every test fails with the IOException \"The handle is invalid\". So that makes me think it has something to do with garbage collection and the finalize() methods.\n\nNow if I just comment out the finalize() method of FSDirectory.FSIndexOutput the test passes. This is even stranger, because the IOException occurred in FSDirectory.FSIndexInput.close(), not in FSIndexOutput, so in a different class which uses hence a different file descriptor.\n\nSo I checked how java.io.FileDescriptor is implemented: It simply wraps an int value. I can't see how these int values are computed, because the open() method of RandomAccessFile is native. \n\nSo I believe the following happens:\n(1) FSIndexOutput uses a FileDescriptor with value x\n(2) FSIndexOutput.close() is called, so the underlying file is being closed\n(3) A new FSIndexInput instance is created by a searcher thread. This opens a RandomAccessFile. Because FileDescriptor x is not in use anymore, x is used as the value for the new FileDescriptor.\n(4) Now garbage collection kicks in. It removes the old instance of FSIndexOutput for which close() has been called already. So the garbage collector calls finalize() which calls RandomAccessFile.close() again which still uses the descriptor with value x. So this call of close() actually closes the file used by the IndexInput instance created in (3).\n(5) FSIndexInput.close() is called and tries to close the file which has been closed already in (4) and thus the IOException occurs.\n\nSo it seems to me that the IBM JVM makes file descriptor values available after a file has been closed, whereas Sun waits until the FileDescriptor instance is destroyed. This might be a bug in the JVM, but since this patch is very simple we could just use it to be on the safe side.\n\nDo you think this makes sense? Or does anybody have a better idea why commenting out the finalize() method in FSIndexOutput prevents FSIndexInput.close() from throwing the IOException? ",
            "date": "2006-11-28T08:25:46.000+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "Michael, which OS are you seeing the exception on?  I'm trying to repro on Linux w/ IBM's JVM 1.5.0 with no success.",
            "date": "2006-11-28T17:38:26.000+0000",
            "id": 6
        },
        {
            "author": "Michael Busch",
            "body": "I'm seeing the problem on Windows XP SP2, IBM JVM 1.5 SR3. I'm running the tests in eclipse.",
            "date": "2006-11-28T19:00:24.000+0000",
            "id": 7
        },
        {
            "author": "Michael McCandless",
            "body": "OK I will try to repro.\n\nIn the meantime, I like your theory above!  It seems very plausible that the 2nd close (during finalize) could [incorrectly] close what was in fact a newly opened descriptor (in use elsewhere).  This also means this bug is more serious that I had thought (I thought it would just throw exceptions up to the GC).\n\nOne way to be sure this theory is true is to instrument the finalize() to see that indeed it called close for the second time, and, the close succeeded (instead of throwing the original exception you saw).  Ie, if this event occurs and then corresponds to the above exception in the TestStressIndexing unit test, then we've got this explained, and, it's quite serious since in production this could in theory result in errant IOExceptions like the one above.",
            "date": "2006-11-28T20:11:03.000+0000",
            "id": 8
        },
        {
            "author": "Michael Busch",
            "body": "Mike,\n\nI tried to add some debug to FSIndexOutput and made another observation which makes this issue even odder! I added a boolean variable to FSIndexOutput with the name isOpen. I don't do anything with this variable, I just change the close() method from:\n\n  public void close() throws IOException {\n    super.close();\n    file.close();\n  }\n\nto \n\n  public void close() throws IOException {\n    super.close();\n    file.close();\n    isOpen = false;\n  }\n\nand suddenly the problem disappears! Now I change close() to\n\n  public void close() throws IOException {\n    super.close();\n    isOpen = false;\n    file.close();\n  }\n\nand the IOException occurs again. Notice that I don't use isOpen anywhere else in the code. So it seems that the problem only occurs if file.close() is the last instruction in close(). I bet this is a JVM bug, maybe the compiler makes some kind of optimization (maybe early freeing up the resources of the method's context that are on the stack while the last instruction of the method is being executed). So I'm not completely sure what the real problem is, but I'm pretty sure it is a JVM bug.\n",
            "date": "2006-11-29T06:09:09.000+0000",
            "id": 9
        },
        {
            "author": "Michael McCandless",
            "body": "Ugh!  This bug is clearly a heisenbug.\n\nOK, I can also reproduce this on Windows when I use the IBM 1.5.0 JRE.\nI can't repro with the Sun 1.5.0_07 JRE.\n\nWhen I apply your patch, the IOException goes away.\n\nFurthermore, my best efforts to get a standalone test to show the\nerror have failed.  I don't understand what precise tickling is\nrequired to get the IOException to happen.\n\nFinally, I found this spooky very recent thread on java-user that\nlooks very much like this error (and was never resolved):\n\n    http://www.gossamer-threads.com/lists/lucene/java-user/40357\n\nI think in this case it was on Sun's JRE.  So I tried the test using\n\"java -server\" but it didn't fail.  Sigh.\n\nMy conclusion is: double-closing a RandomAccessFile is dangerous!  And\nquite possibly can cause problems for \"real\" use cases (ie, not just\nwhen testing under Eclipse).\n\nI will commit this patch.\n\nI made a couple of tiny changes: changed the name to \"isOpen\" and\nmoved up the \"isOpen = true\" to be right after the file is actually\nopened.\n\nI also like the change to flush the buffer on finalize (if the file is\nstill open).\n\nThanks Michael!\n",
            "date": "2006-11-29T23:28:42.000+0000",
            "id": 10
        },
        {
            "author": "Michael Busch",
            "body": "Wow that was a tough one!\n\nThanks for trying so hard to reproduce it, Mike. And thanks for committing, the small changes you made to my patch sound good to me!",
            "date": "2006-11-30T00:46:18.000+0000",
            "id": 11
        },
        {
            "author": "Robert Newson",
            "body": "\nThe close() method in RandomAccessFile is defined not to throw IOException if it's merely closed twice. The bug here is with the IBM JDK and not Lucene. \n\nThis stanza;\n\nfinal RandomAccessFile raf = new RandomAccessFile(\"/tmp/raf\", \"rw\");\n\t\tfor (int i = 0; i < 1000; i++) {\n\t\t\traf.close();\n\t\t}\n\nshould run fine everywhere, according to Javadocs;\n\nfile:///home/rnewson/Documents/jdk-1.5/api/java/io/Closeable.html#close()\n\"Closes this stream and releases any system resources associated with it. If the stream is already closed then invoking this method has no effect.\"\n\nThis behavior was clarified with the introduction of the Closeable interface in 1.5, so perhaps IBM are not to blame for this. ",
            "date": "2007-02-06T16:23:13.895+0000",
            "id": 12
        },
        {
            "author": "Michael McCandless",
            "body": "Closing all issues that were resolved for 2.1.",
            "date": "2007-02-27T18:10:34.888+0000",
            "id": 13
        }
    ],
    "component": "core/store",
    "description": "Hi all,\n\nI found a small problem in FSDirectory: The finalize()-methods of FSDirectory.FSIndexInput and FSDirectory.FSIndexOutput try to close the underlying file. This is not a problem unless the file has been closed before by calling the close() method. If it has been closed before, the finalize method throws an IOException saying that the file is already closed. Usually this IOException would go unnoticed, because the GarbageCollector, which calls finalize(), just eats it. However, if I use the Eclipse debugger the execution of my code will always be suspended when this exception is thrown.\n\nEven though this exception probably won't cause problems during normal execution of Lucene, the code becomes cleaner if we apply this small patch. Might this IOException also have a performance impact, if it is thrown very frequently?\n\nI attached the patch which applies cleanly on the current svn HEAD. All testcases pass and I verfied with the Eclipse debugger that the IOException is not longer thrown.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-669",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Trivial",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "finalize()-methods of FSDirectory.FSIndexInput and FSDirectory.FSIndexOutput try to close already closed file",
    "systemSpecification": true,
    "version": ""
}