{
    "comments": [
        {
            "author": "Simon Willnauer",
            "body": "This issue depends on LUCENE_1496 which is set to won't_fix. I guess I can close / resolve this too. \nAny concers? Speak up please!\n\nsimon",
            "date": "2009-06-16T21:28:29.364+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "LUCENE-1496 is \"won't fix\" because trie's NumericUtils subsumes Solr's NumberUtils, ie, we now need to migrate local lucene to NumericUtils.  And we want to do this for 2.9, since local lucene is not yet released and we have the freedom to make such an otherwise drastic change to the index format.\n\nI'll update this issue to reflect it's new goal.",
            "date": "2009-06-17T09:03:21.913+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "I'll take this one, if you haven't started on it Simon...",
            "date": "2009-07-14T18:28:49.135+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "Attached patch.  I added utility methods to NumericUtil to do double/float -> string, and v/v, and then did a straight replacement everywhere NumberUtils was used, and removed NumberUtils.",
            "date": "2009-07-15T18:56:28.261+0000",
            "id": 3
        },
        {
            "author": "Simon Willnauer",
            "body": "Hey Mike, thanks for taking this. I was too busy last week and I rather spent time on Lucene-1566.\nI looked at the patch - looks good to me. I wonder if it would make sense to do some cleanup in the code (final vars and args etc.) and if we should remove this logging code. It makes sense to use logging but afaik there is no ultimate logging api in lucene so i would rather go for removing the logging code before we release. Is that worth a new issue?!\n\nsimon",
            "date": "2009-07-15T19:12:22.395+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "Patch looks good. The best is, that you can now use the double FieldCache which should speed up the LocalLucene queries and needs less memory.\n\nBy the way: I was also tending to add these convenience methods to NumericUtils :-) For completeness, shoudl we also add them for the ones with the shift value at the end? an char[]? I was reluctant to do this.\n\nI think the easy conversion methods to/from String withou shift would be enough.",
            "date": "2009-07-15T19:12:58.332+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "bq. For completeness, shoudl we also add them for the ones with the shift value at the end? an char[]? I was reluctant to do this.\n\nLet's hold off & add these when the need first arises?\n\nbq. I wonder if it would make sense to do some cleanup in the code (final vars and args etc.) and if we should remove this logging code\n\nAgreed -- looks like you've opened a new issue for this already; thanks!\n\nI'll commit shortly.",
            "date": "2009-07-16T15:31:17.642+0000",
            "id": 6
        }
    ],
    "component": "modules/spatial",
    "description": "Currently spatial contrib includes a copy of NumberUtils from solr (otherwise it would depend on solr)\n\nOnce LUCENE-1496 is sorted out, this copy should be removed.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1505",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Change contrib/spatial to use trie's NumericUtils, and remove NumberUtils",
    "systemSpecification": true,
    "version": ""
}