{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Failing test case showing the bug.",
            "date": "2011-10-10T17:20:18.981+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "I think we have to fix it, get the correctness and then worry about performance later.\n\ngiving a document a different score (no matter how little, it will affect ranking) just because you next'ed versus advance'd it is bad news.",
            "date": "2011-10-10T17:22:56.953+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "not a real 'fix' but maybe this solves it for practical purposes?",
            "date": "2011-10-10T18:12:56.401+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "patch with a bugfix to the test (in case it gets slowmultireaderwrapper)",
            "date": "2011-10-10T19:32:27.684+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Bulk close after release of 3.5",
            "date": "2011-11-27T12:29:35.579+0000",
            "id": 4
        }
    ],
    "component": "",
    "description": "Spinoff from LUCENE-1536.\n\nI dug into why we hit a score diff when using luceneutil to benchmark\nthe patch.\n\nAt first I thought it was BS1/BS2 difference, but because of a bug in\nthe patch it was still using BS2 (but should be BS1) -- Robert's last\npatch fixes that.\n\nBut it's actually a diff in BS2 itself, whether you next or advance\nthrough the docs.\n\nIt's because DisjunctionSumScorer, when summing the float scores for a\ngiven doc that matches multiple sub-scorers, might sum in a different\norder, when you had .nextDoc'd to that doc than when you had .advance'd\nto it.\n\nThis in turn is because the PQ used by that scorer (ScorerDocQueue)\nmakes no effort to break ties.  So, when the top N scorers are on the\nsame doc, the PQ doesn't care what order they are in.\n\nFixing ScorerDocQueue to break ties will likely be a non-trivial perf\nhit, though, so I'm not sure whether we should do anything here...",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3503",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "DisjunctionSumScorer gives slightly (float iotas) different scores when you .nextDoc vs .advance",
    "systemSpecification": true,
    "version": ""
}