{
    "comments": [
        {
            "author": "Doron Cohen",
            "body": "I reviewed this patch and think that it is valid.\n\nThis seems like a real bug:\n - In FieldSortedHitQueue, when no locale is specified, a comparator is based on getStringsIndex() - because the natural terms order can be used for comparison. \n- Notice that getStringsIndex() has a special care for docs with no values - their index is set to 0 (default index array initialization) and all terms are placed from index 1 and up. \n- But when a locale is specified, the natural terms cannot be used, and hence getStrings() is used (instead of getStringsIndex()). Here there is no special care for \"no values\", and hence the result strings array can contain nulls. \n- These null values are later passed to the  locale comparator, and e get wa NPE.\n- The Javadocs for java.text.Collator do not specify behavior for null argument, so this can not be regarded as an issue of a certain JDK implementation - we should avoid passing null to the comparator.\n\nI see two ways to solve this: \n- one is to assign \"\" (empty string) in the comparator for all the null values. But this would modify the semantics of the FieldCache, that stores this array of strings. It would be wrong to do so, and it would also take more time.\n- the other way - that seems the right way - is that of this patch, which handles null values just before passing them to the collator compare method. (The 3 if statements added may have performance implications - I did not test performance.)\n\nI ran the TestSort (from the patch) without applying the patch fix to FieldSortedHitQueue, and the test failed. After applying the fix to FieldSortedHitQueue the test passed.  All \"ant test\" tests pass as well.\n\n- Doron",
            "date": "2006-08-18T09:45:23.000+0000",
            "id": 0
        },
        {
            "author": "Hoss Man",
            "body": "Attached patch: demonstrates bug with test, provides fix, applies cleanly, breaks no other existing tests.\n\nApplied and commited.\n\n\nThanx Oliver",
            "date": "2006-08-20T21:16:54.000+0000",
            "id": 1
        }
    ],
    "component": "core/search",
    "description": "If you do a local sensitive sort against a field that is missing from some documents in the index an NPE will get thrown.\n\nAttached is a patch which resolved the issue and updates the sort test case to give coverage to this issue.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-650",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "NPE doing local sensitive sorting when sort field is missing",
    "systemSpecification": true,
    "version": "2.0.0"
}