{
    "comments": [
        {
            "author": "Bill Bell",
            "body": "Fixed code - needs to be put in a release (trunk)",
            "date": "2009-08-04T23:40:03.600+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "I was able to get TestCartesian to hit the issue, but adding 6000.0 radius into its tests, and confirmed that the patch fixed it.\n\nI also changed the two if's in each of the new norm methods to be if / else if instead (they are exclusive, I think).\n\nBut unfortunately my lat/lng arithmetic is rather rusty -- I don't fully understand the normalization that's being added, here.  Can someone (Patrick?) check this?\n\nAlso, what happens if radius is absurdly large and the resulting lat/lngs are ridiculous (say 1000.0)?",
            "date": "2009-08-05T00:54:17.809+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "So, here's one thing that worries me about this change... note that my grasp of geographic math is very tenuous at best, so what follows could be pure folly:\n\nSay the latitude must wrap around, because it's 110.  This means (I think) that the this point has crossed over the north pole.\n\nWith this patch, we'll simply map that 110 to 90 - (110 - 90) = 70.\n\nBut shouldn't we also be flipping the longitude 180 degrees whenever the latitude crosses the north pole?  Ie, in crossing the north pole, the point has moved to the other side of the earth.  We aren't, with the current patch, which I think means the normalization simply bounces the point back where it came from, which doesn't seem right?\n\nAlso, the code has this spooky TODO which looks relevant to this discussion:\n\n{code}\n    // TODO: Prob only works in northern hemisphere?\n{code}\n\nI'm a little too nervous to commit this patch as is... I'm going to clear it from 2.9 for now.  I'm hoping someone with a strong grasp of lat/long math can step in and bring some clarity here, in time for 2.9...",
            "date": "2009-08-06T10:06:58.327+0000",
            "id": 2
        },
        {
            "author": "Bill Bell",
            "body": "I did some additional testing, and here is the new fix that works. The issue is the number of miles per Long is dependent on Latitude. The code checks it but only uses this value from the center point. I converted to the standard way to calculate distances for the Earth, assume 45 and 225 degree right angles. This is working using very large distances.\n\nSee new code.\n\nNot sure if you want the prints.\n",
            "date": "2009-08-06T23:48:39.256+0000",
            "id": 3
        },
        {
            "author": "Bill Bell",
            "body": "Large distance fixer",
            "date": "2009-08-06T23:50:36.218+0000",
            "id": 4
        },
        {
            "author": "Bill Bell",
            "body": "Michael - Please rerun your tests.\n\nThe 2 normalization functions probably are now not needed, but they are there \"as an added check\"...\n\nThis algorithm is standard, several web sites use it from Haversine. One example is at  \"Destination point given distance and bearing from start point\" at http://www.movable-type.co.uk/scripts/latlong.html \n\nThanks.",
            "date": "2009-08-07T07:45:44.432+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks for the updated patch Bill!\n\nThat's a good improvement (taking into account the varying miles per lng, depending on lat), but isn't that fix orthogonal to the normalization issue?  Ie, one could still easily overflow lat or lng with a large enough miles.  EG, I added 6000 miles as a testcase in TestCartesian, and if I turn off the normalization, it hits the same exception (Illegal lattitude value 94.77745787739758).\n\nAnd I'm still concerned that the normalization fails to properly \"cross\" the north (or south) pole, by flipping the lng whenever the lat is too high; instead it seems to incorrectly \"bounce\" the point back?  Am I missing something?",
            "date": "2009-08-07T09:26:33.087+0000",
            "id": 6
        },
        {
            "author": "Bill Bell",
            "body": "Everything is working except when you use a large area like 10000 miles. I get no results at this distance when crossing the anti-meridian (180 degrees).\n\nMost of the time this is fine, but specifically when -181 becomes 178 there appears to be an issue somewhere else in the code and nothing is returned. I believe this code is good, the issue is somewhere else. Maybe lower left is no longer lower left, and upper right is no longer upper right? The box is probably too big for the other algorithms. Not sure what else to check. How it is being used? Regardless this section appears right.\n\nStart here: ctr 39.3209801,-111.0937311\nDistance: 7200\n\nboxCorners: before norm 22.100623434197477,21.15746490712925\nboxCorners: normLng 22.100623434197477,21.15746490712925\nboxCorners: distance: d 7200.0\nboxCorners: ctr 39.3209801,-111.0937311\nboxCorners: normLat 22.100623434197477,21.15746490712925\nboxCorners: before norm -43.22565169384456,-181.34791600031286   note -181\nboxCorners: normLng -43.22565169384456,178.65208399968714 Note 178\nboxCorners: distance: d 7200.0\nboxCorners: ctr 39.3209801,-111.0937311\nboxCorners: normLat -43.22565169384456,178.65208399968714\ncorner 1054.4155877284288\n\nI do get results from Hawaii crossing this at 10,000 miles. This works:\n\nboxCorners: before norm 6.201324582593365,-0.012709669713800501\nboxCorners: normLng 6.201324582593365,-0.012709669713800501\nboxCorners: distance: d 10000.0\nboxCorners: ctr 19.8986819,-155.6658568\nboxCorners: normLat 6.201324582593365,-0.012709669713800501\nboxCorners: before norm -41.508634930577436,-302.4840293070323 note -302\nboxCorners: normLng -41.508634930577436,57.5159706929677 note 57\nboxCorners: distance: d 10000.0\nboxCorners: ctr 19.8986819,-155.6658568\nboxCorners: normLat -41.508634930577436,57.5159706929677\ncorner 1464.4660940672625\n\nNote: This does not get any results. Note the 4.815339955430126 difference. Very weird.\n\nboxCorners: distance: d 10500.0\nboxCorners: ctr 19.8986819,-155.6658568\nboxCorners: normLat 0.8114618951495843,4.815339955430126\nboxCorners: before norm -37.88735182208723,-310.6222696081052\nboxCorners: normLng -37.88735182208723,49.37773039189477\nboxCorners: distance: d 10500.0\nboxCorners: ctr 19.8986819,-155.6658568\nboxCorners: normLat -37.88735182208723,49.37773039189477\ncorner 1537.6893987706253\n\n\n\n\n",
            "date": "2009-08-08T00:44:40.590+0000",
            "id": 7
        },
        {
            "author": "Bill Bell",
            "body": "Added flipping for > 90 degrees if needed. See comment.",
            "date": "2009-08-08T00:47:31.814+0000",
            "id": 8
        },
        {
            "author": "Bill Bell",
            "body": "I did some additional research. The current Spatial ONLY works for one hemisphere at a time. It does a simple min/max for lat/long measurements. This makes the whole solution not useful between one hemisphere and another. Specifically Rectangle.java, getBoundary, etc needs to work on a circle. The first step is to build a rectangle when lat goes from -90 to +89, and long goes from -180 to +179, etc.\n\n new Rectangle(ll.getLng(), ll.getLat(), ur.getLng(), ur.getLat())\n\nAt least LLRect appears correct now... Next step is to fix the CartesianPolyFilterBuilder.\n\n\n",
            "date": "2009-08-08T03:41:38.884+0000",
            "id": 9
        },
        {
            "author": "Michael McCandless",
            "body": "OK the new normLat looks like it handles crossing the pole now, by flipping the lng; thanks.\n\nCan you add a unit test that confirms this was a problem before, and that the new lng-flipping resolves it?  Probably if you just modify TestCartesian, to add a new point, and then add a new test cast that starts from a lat/lng that's near the pole, you could get the issue to happen & be resolved.\n\nAlso, can use \"svn diff\" and post the resulting output (instead of the whole copy of each source file)?  Thanks.\n\nbq. The current Spatial ONLY works for one hemisphere at a time.\n\nActually, shouldn't LLRect work fine if a rect crosses the equator?   Or, a pole?  What I think it cannot handle is crossing the anti-meridian?  (Because, when that projects out, you'll need 2 rectangles, on opposite sides, to handle it?).  I'm not sure what LLRect should even do if it finds it \"needs\" to cross the anti-meridian.  If it had the ability to return 2 rectangles I think it could be fixed.\n\nOr are you saying there are further limitations in contrib/spatial (ie, not caused by LLRect) that cause it to only work within one hemisphere?\n\nAs for the \"we get no results when radius is very large\" bug, I like the theory that the corners need to be flipped.  Or, it could be the rect tried to cross the anti-meridian, and once we fix that, this case will also be fixed.  Finally, it could also be we simply have to floor the the lat after normalizing.  Ie before normalizing we get a ridiculous lat, say 1000.0, which normLat cannot handle since it can only \"undo\" at most \"off by 90\".  I think normLat may need to be changed so that if it still sees lat/lng out of bounds after doing it's normalization, it simply floors the resulting lat?  Can you add a test case for this case as well?  We may as well get test cases for all the problems we're uncovering... then as we iterate on the patches we can see if they are fixed.",
            "date": "2009-08-08T09:19:15.399+0000",
            "id": 10
        },
        {
            "author": "Bill Bell",
            "body": "SVN diff patch",
            "date": "2009-09-06T18:53:22.130+0000",
            "id": 11
        },
        {
            "author": "Bill Bell",
            "body": "New test cases to test Prime and Anti Meridien. Both fail\n",
            "date": "2009-09-09T14:31:47.488+0000",
            "id": 12
        },
        {
            "author": "Bill Bell",
            "body": "In case you cannot figure out the SVN diff.",
            "date": "2009-09-09T14:33:24.451+0000",
            "id": 13
        },
        {
            "author": "Bill Bell",
            "body": "I added the test cases that both fail.",
            "date": "2009-09-09T14:33:55.302+0000",
            "id": 14
        },
        {
            "author": "Michael McCandless",
            "body": "So the anti-meridian test is expected to fail, right?  Ie, LLRect is only able to represent a single rect, which is insufficient (I think?).  Not sure what LLRect should do when it detects that the anti-meridian is crossed.  Would be best if we could return 2 rects somehow...\n\nThe prime-meridan test is testing the \"distance too large\" issue, right?  It fails now, but we should be able to fix this, I think, by capping the corners somehow?\n\nThe last issue is the pole-flipping issue, which we think we fixed but we don't yet have a test case for, right?",
            "date": "2009-09-10T23:05:04.973+0000",
            "id": 15
        },
        {
            "author": "Bill Bell",
            "body": "Not exactly.\n\ntestPrimeM() should be fixed by the new LLRect.java. It goes over 90 degrees, and LLRect.java pole flips. If this is not working with the new LLRect, there is something wrong with that.\n\ntestAntiM() creates a case that should fail. This condition needs to be fixed. The case is: You are located in Hawaii and you should see:\n\nMarshall Island Airfield\",7.06, 171.2\nMidway Island\",25.7, -171.7\n\nIt only shows the Midway Island, since it is still in the same hemisphere (it did not go from -171 to 171 (the Anti-Meridien), This case also errors since the upper right is also going over the pole. So it also is testing testPrimeM(). If we reduce the miles to 3500 it tests only these 2 points. Since it does not show Marshall Island, the Local Lucene is not working right. Once this case works people we can release it.\n\nHere are my thoughts on a fix:\n\nLLRect does calculate the right box across anti-meridien. The issue is elsewhere. Either we have multiple boxes, or check the Point2D since the whole thing is not right crossing boundaries... box.getMaxPoint().getY() is not the max  when going (-) to (+) and vice versa.\n\n    [junit] boxCorners: ur 43.242262719615994,-123.073340742054\n    [junit] boxCorners: cnt 21.6032207,-158.0\n    [junit] boxCorners: ll -5.189678558944157,177.24228397256368\n\n\n",
            "date": "2009-09-11T02:48:54.748+0000",
            "id": 16
        },
        {
            "author": "Bill Bell",
            "body": "Posted new Test Junit tests. The AntiM will still fail, until we get a fix. ",
            "date": "2009-09-11T04:32:41.476+0000",
            "id": 17
        },
        {
            "author": "Michael McCandless",
            "body": "Bill, could you please post a single patch that includes all of your changes (fixing LLRect & TestCartesian)?  Also, please first \"svn up\" to the latest svn trunk so that the patch applies cleanly.\n\nbq.testPrimeM() should be fixed by the new LLRect.java. It goes over 90 degrees, and LLRect.java pole flips. If this is not working with the new LLRect, there is something wrong with that.\n\nHmm I'm seeing testPrimeM fail -- maybe once I sync to your new patch I'll see it pass.  Maybe name that test \"testPoleFlipping\" or something instead?\n\nSo testPrimeM isn't testing the \"miles is too large\" issue?  If not, can you add a new test that explicitly tests this?  We can use something ridiculous like 100000 miles.\n\nbq. LLRect does calculate the right box across anti-meridien.\n\nI agree that it calculates the correct \"upper right\" and \"lower left\", but when those cross the anti-meridian, it's not possible to represent that with a single rect (you need two).  This is where I'm waaaay out of my depth w/ GIS search... in general, how is this \"normally\" handled?  It seems like something higher up must accept two rects and OR them together during the searching?",
            "date": "2009-09-11T09:21:26.990+0000",
            "id": 18
        },
        {
            "author": "Bill Bell",
            "body": "Combined patch. This does not fix Anti Meridien yet. It does test for it.",
            "date": "2009-09-14T06:15:00.378+0000",
            "id": 19
        },
        {
            "author": "Bill Bell",
            "body": "Patch that fixed prime meridian and antimeridian issues. Also pole flipping.\n",
            "date": "2009-09-14T10:13:24.331+0000",
            "id": 20
        },
        {
            "author": "Michael McCandless",
            "body": "Looks like great progress!  I now see all tests pass with your patch.\n\nSo you now explicitly handle 2 different rects in CartesianPolyFilterBuilder.\n\nHowever, I added a \"miles too big\" test, by inserting a 10000.0 miles test case in testRange & testGeoHashRange, which ought to return all points (20) but instead only hits 1.  I think to fix this we just have to detect when the rect wraps around back onto itself, and somehow return \"whole world\" as the degenerate filter?",
            "date": "2009-09-14T11:47:33.465+0000",
            "id": 21
        },
        {
            "author": "Bill Bell",
            "body": "Probably, do we have someone else to tackle that one? I would go further than 10,000 miles as well.\n\nThere should be a switch to return all points, and just keep sorting and distance from lat/long, but I am not sure where to put that one...\n\nBill\n\n\n",
            "date": "2009-09-15T05:04:29.675+0000",
            "id": 22
        },
        {
            "author": "Bill Bell",
            "body": "Can we go with my patch, and address this new large mile issue as a new LUCENE issue? I can probably assist, I just want this committed if possible.",
            "date": "2009-09-21T04:58:51.034+0000",
            "id": 23
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Can we go with my patch, and address this new large mile issue as a new LUCENE issue? \n\nI agree, let's break this out as its own issue.  I'll open it and then commit this one.  Thanks Bill!",
            "date": "2009-09-21T17:25:19.587+0000",
            "id": 24
        },
        {
            "author": "Michael McCandless",
            "body": "I opened LUCENE-1921.",
            "date": "2009-09-21T17:31:47.657+0000",
            "id": 25
        },
        {
            "author": "Michael McCandless",
            "body": "Mark is it OK to commit this now?  I realize it won't make 2.9 if the current RC is it...",
            "date": "2009-09-21T18:06:18.937+0000",
            "id": 26
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Bill!",
            "date": "2009-09-22T00:08:41.704+0000",
            "id": 27
        },
        {
            "author": "Michael McCandless",
            "body": "Correcting fix version.",
            "date": "2009-10-30T21:26:09.127+0000",
            "id": 28
        },
        {
            "author": "Bill Bell",
            "body": "Has this been applied to 2.9.1 ?  Or do I need to apply it manually? I tested it on 2.9.1 and it does not appear to be in there.",
            "date": "2009-11-23T22:15:26.285+0000",
            "id": 29
        },
        {
            "author": "Michael McCandless",
            "body": "No, this is fixed in 3.0 (to be released shortly).",
            "date": "2009-11-23T22:18:04.316+0000",
            "id": 30
        }
    ],
    "component": "modules/spatial",
    "description": "http://amidev.kaango.com/solr/core0/select?fl=*&json.nl=map&wt=json&radius=5000&rows=20&lat=39.5500507&q=honda&qt=geo&long=-105.7820674\n\nGet an error when using Solr when distance is calculated for the boundary box past 90 degrees.\n\n\nAug 4, 2009 1:54:00 PM org.apache.solr.common.SolrException log\nSEVERE: java.lang.IllegalArgumentException: Illegal lattitude value 93.1558669413734\n        at org.apache.lucene.spatial.geometry.FloatLatLng.<init>(FloatLatLng.java:26)\n        at org.apache.lucene.spatial.geometry.shape.LLRect.createBox(LLRect.java:93)\n        at org.apache.lucene.spatial.tier.DistanceUtils.getBoundary(DistanceUtils.java:50)\n        at org.apache.lucene.spatial.tier.CartesianPolyFilterBuilder.getBoxShape(CartesianPolyFilterBuilder.java:47)\n        at org.apache.lucene.spatial.tier.CartesianPolyFilterBuilder.getBoundingArea(CartesianPolyFilterBuilder.java:109)\n        at org.apache.lucene.spatial.tier.DistanceQueryBuilder.<init>(DistanceQueryBuilder.java:61)\n        at com.pjaol.search.solr.component.LocalSolrQueryComponent.prepare(LocalSolrQueryComponent.java:151)\n        at org.apache.solr.handler.component.SearchHandler.handleRequestBody(SearchHandler.java:174)\n        at org.apache.solr.handler.RequestHandlerBase.handleRequest(RequestHandlerBase.java:131)\n        at org.apache.solr.core.SolrCore.execute(SolrCore.java:1328)\n        at org.apache.solr.servlet.SolrDispatchFilter.execute(SolrDispatchFilter.java:341)\n        at org.apache.solr.servlet.SolrDispatchFilter.doFilter(SolrDispatchFilter.java:244)\n        at org.apache.catalina.core.ApplicationFilterChain.internalDoFilter(ApplicationFilterChain.java:235)\n        at org.apache.catalina.core.ApplicationFilterChain.doFilter(ApplicationFilterChain.java:206)\n        at org.apache.catalina.core.StandardWrapperValve.invoke(StandardWrapperValve.java:233)\n        at org.apache.catalina.core.StandardContextValve.invoke(StandardContextValve.java:191)\n        at org.apache.catalina.core.StandardHostValve.invoke(StandardHostValve.java:128)\n        at org.apache.catalina.valves.ErrorReportValve.invoke(ErrorReportValve.java:102)\n        at org.apache.catalina.core.StandardEngineValve.invoke(StandardEngineValve.java:109)\n        at org.apache.catalina.connector.CoyoteAdapter.service(CoyoteAdapter.java:286)\n        at org.apache.coyote.http11.Http11AprProcessor.process(Http11AprProcessor.java:857)\n        at org.apache.coyote.http11.Http11AprProtocol$Http11ConnectionHandler.process(Http11AprProtocol.java:565)\n        at org.apache.tomcat.util.net.AprEndpoint$Worker.run(AprEndpoint.java:1509)\n        at java.lang.Thread.run(Thread.java:619)\n\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1781",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Large distances in Spatial go beyond Prime MEridian",
    "systemSpecification": false,
    "version": "2.9"
}