{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "Here the patch:\n- When SlowMultiReaderWrapper will in future clean up the cache on close, the tests should not simply only close inner reader but instead close wrapper reader (which only delegates currently). This is also the only correct usage for Decoration pattern (see TokenFilter & co.)\n- TestFilterIndexReader had a bug when the \"source\" index has more than one segment, this is fixed now, because we always wrap and wrapped reader delegates close.",
            "date": "2010-11-19T22:29:07.611+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "Looks great Uwe!",
            "date": "2010-11-20T10:10:11.176+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 1037294",
            "date": "2010-11-20T18:48:02.322+0000",
            "id": 2
        }
    ],
    "component": "",
    "description": "The overhead when wrapping an atomic reader using SlowMultiReaderWrapper is very low, the work done in the static wrap method is much higher (instantiate ArrayList, recusively went through all subreaders), just to check the number of readers than simply always wrapping.\n\nMultiFields already is optimized when called by one-segment or atomic readers, so there is no overhead at all. So this patch removes the static wrap method and you simply wrap like a TokenFilter with ctor: new SlowMultiReaderWrapper(reader)\n\nWhen this is done, there is also no risk to close a SegmentReader (which you should not do), when wrap() returns a single SegmentReader. This help in parent issue with cleaning up the case in close().\n\nThe patch aölso removes the now useless mainReader/reader variables and simply closes the wrapper.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2772",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Make SlowMultiReaderWrapper wrap always so close() is safe",
    "systemSpecification": true,
    "version": ""
}