{
    "comments": [
        {
            "author": "Michael Busch",
            "body": "First we need to update contrib to the new TokenStream API.",
            "date": "2009-07-25T00:09:43.888+0000",
            "id": 0
        },
        {
            "author": "Michael Busch",
            "body": "Now that LUCENE-1460 is committed I can create a patch here soon.",
            "date": "2009-08-01T23:02:09.490+0000",
            "id": 1
        },
        {
            "author": "Michael Busch",
            "body": "I converted Mike's patch from LUCENE-1448 to use the new end() method.\n\nAll tests pass. I will commit this shortly.",
            "date": "2009-08-02T02:07:31.380+0000",
            "id": 2
        },
        {
            "author": "Michael Busch",
            "body": "Committed revision 799968.",
            "date": "2009-08-02T02:11:04.600+0000",
            "id": 3
        },
        {
            "author": "Mark Miller",
            "body": "This is under new features in changes, but wasn't this issue a bug fix?",
            "date": "2009-08-02T03:00:46.438+0000",
            "id": 4
        },
        {
            "author": "Michael Busch",
            "body": "Do you mean the entry for LUCENE-1448? I added that as new feature, because the end() method is new and can be used to perform any end-of-stream operations. In this particular case it's used to fix the offset bug. Hmm, maybe I should have made two entries... feel free to move it if you think it doesn't belong there.",
            "date": "2009-08-02T05:46:23.772+0000",
            "id": 5
        },
        {
            "author": "Mark Miller",
            "body": "bq. In this particular case it's used to fix the offset bug. Hmm, maybe I should have made two entries...\n\n+1. Its not that I feel it doesn't belong there, I just want people reading changes to know that bug is fixed - its bitten a couple people in the past (multifields/highlighter). Koji has been waiting patiently for the fix for some time for one ;) Its not a big deal for sure, but I think we should just put it twice - I can copy it to the bug section as well. I've seen an issue make 3 sections, so 2 should be no problem :)\n\nApologize for being in the wrong issue again by the way - finding myself in the wrong place a lot lately.",
            "date": "2009-08-02T13:35:19.120+0000",
            "id": 6
        }
    ],
    "component": "",
    "description": "See LUCENE-1448. Mike's patch there already contains the necessary fixes.\n\nI'll attach a patch here as soon as LUCENE-1460 is committed.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1759",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "OTHER",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Implement TokenStream.end() in contrib TokenStreams",
    "systemSpecification": true,
    "version": ""
}