{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Attached patch.\n\nThe only bizzare thing is... somehow, the changeup in the index causes the scores to be off by a bit (eg 1199.8008 vs 1199.8007), so I had to relax the threshold for comparing float scores from 1e-5 to 1e-3.  We use 1e-3 in other places when comparing scores.  Still, these are function queries, so... I don't yet understand why the scores were tweaked by using RIW.  Any ideas?",
            "date": "2010-07-29T13:30:47.619+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "bq.The only bizzare thing is... somehow, the changeup in the index causes the scores to be off by a bit (eg 1199.8008 vs 1199.8007),\n\nOK I tracked this down: it's due to the ScorerDocQueue inside DisjunctionSumScorer.  The test that was failing was a BQ with 3 SHOULD clauses.  The ScorerDocQueue, which holds the current sub-scorers \"ordered\" by their docIDs, does not break ties (it has no real reason to).  When you simply .nextDoc().score() the matching docs, these three subs' scores were summed in one order.  But then QueryUtil does a scorer.advance() to each doc, and that .advance() was then pulling the matching docs in a different order from the queue.  Summing the same 3 floats in different orders can easily result in a slightly different float due to different truncation.\n\nI'll commit shortly w/ the threshold increased from 1e-5 to 1e-3.",
            "date": "2010-08-04T10:38:09.709+0000",
            "id": 1
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:50:04.305+0000",
            "id": 2
        }
    ],
    "component": "",
    "description": null,
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2578",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "cutover FunctionQuery tests to use RandomIndexWriter, for better testing",
    "systemSpecification": true,
    "version": ""
}