{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "Here's a patch.\n\nTo fix the BoostingQuery in contrib, it overrides BooleanWeight.\n(Also a test that instantiates BooleanScorer with a null weight had to be fixed).\n",
            "date": "2011-01-14T15:44:05.047+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 1061050, 1061052 (3x)",
            "date": "2011-01-19T23:08:34.902+0000",
            "id": 1
        }
    ],
    "component": "",
    "description": "Spinoff of LUCENE-2854.\n\nSee LUCENE-2828 and LUCENE-2854 for reference.\n\nIn general, the SimilarityDelegator was problematic with regards to back-compat, and if queries\nwant to score differently, trying to runtime subclass Similarity only causes trouble.\n\nThe reason we could not fix this in LUCENE-2854 is because:\n{noformat}\nMichael McCandless added a comment - 08/Jan/11 01:53 PM\nbq. Is it possible to remove this method Query.getSimilarity also? I don't understand why we need this method!\n\nI would love to! But I think that's for another day...\n\nI looked into this and got stuck with BoostingQuery, which rewrites to an anon \nsubclass of BQ overriding its getSimilarity in turn override its coord method. \nRather twisted... if we can do this differently I think we could remove Query.getSimilarity.\n{noformat}\n\nhere is the method in question:\n\n{noformat}\n/** Expert: Returns the Similarity implementation to be used for this query.\n * Subclasses may override this method to specify their own Similarity\n * implementation, perhaps one that delegates through that of the Searcher.\n * By default the Searcher's Similarity implementation is returned.*/\npublic Similarity getSimilarity(IndexSearcher searcher) {\n  return searcher.getSimilarity();\n}\n{noformat}\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2869",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "remove Query.getSimilarity()",
    "systemSpecification": true,
    "version": ""
}