{
    "comments": [
        {
            "author": "Grant Ingersoll",
            "body": "Patch that implements the comparator approach.  I didn't incorporate the freq into the scoring b/c this would mean having to look up the freq. for every suggestion, which I think would be pretty bad performance-wise.\n\nI also refactored the Solr SpellCheckComponent a little bit to not have a copy and paste of the SuggestWord* classes.  I intend to commit today or tomorrow.  All tests pass and it is back compatible.  I will also port back to 3.x",
            "date": "2010-08-17T20:31:08.634+0000",
            "id": 0
        },
        {
            "author": "Grant Ingersoll",
            "body": "Committed revision 986477 (trunk).  One minor variation from the patch in that I added a bit more testing.\n\nCommitted revision 986495.(3.x).",
            "date": "2010-08-17T21:33:44.949+0000",
            "id": 1
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:50:00.347+0000",
            "id": 2
        }
    ],
    "component": "modules/spellchecker",
    "description": "This issue was first noticed and reported in this Solr thread; http://lucene.472066.n3.nabble.com/spellcheck-issues-td489776.html#a489788\n\nBasically, there are situations where it would be useful to sort by freq first, instead of the current \"sort by edit distance, and then subsort by freq if edit distance is equal\"\n\nThe author of the thread suggested \"What I think would work even better than allowing a custom compareTo function would be to incorporate the frequency directly into the distance function.  This would allow for greater control over the trade-off between frequency and edit distance\"\n\nHowever, custom compareTo functions are not always be possible (ie if a certain version of Lucene must be used, because it was release with Solr) and incorporating freq directly into the distance function may be overkill (ie depending on the implementation)\n\nit is suggested that we have a simple modification of the existing compareTo function in Lucene to allow users to specify if they want the existing sort method or if they want to sort by freq.\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2479",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "need the ability to also sort SpellCheck results by freq, instead of just by Edit Distance+freq",
    "systemSpecification": true,
    "version": ""
}