{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "\nPatch: I removed the sleep+retry loop in loading the segments.gen\nfile; I don't think SIS should do any sleeping (it's risky; an app\ncould in theory hit the net 0.5 second sleep here).\n\nI also changed SegmentInfos.finishCommit to sync this file, if it\nwas written successfully, but to suppress exceptions (but then try to\ndelete the file) since a reader could have it open as we try to commit\n(which is fine; the file is optional since we use dir listing to\nlocate segments_N).\n",
            "date": "2011-12-20T19:06:15.673+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "I agree... i think we can also remove the now unused defaultGenFileRetryPauseMsec and its setter too?",
            "date": "2011-12-20T23:06:18.150+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "I meant getter... you already nuked the setter",
            "date": "2011-12-20T23:08:05.217+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "Woops -- I'll nuke the getter!",
            "date": "2011-12-21T10:41:48.328+0000",
            "id": 3
        }
    ],
    "component": "",
    "description": "in LUCENE-3601, i worked up a change where we intentionally crash() all un-fsynced files \nin tests to ensure that we are calling sync on files when we should.\n\nI think this would be nice to do always (and with some fixes all tests pass).\n\nBut this is super-slow sometimes because when we corrupt the unsynced segments.gen, it causes\nSIS.read to take 500ms each time (and in checkindex for some reason we do this twice, which seems wrong).\n\nI can workaround this for now for tests (just do a partial crash that avoids corrupting the segments.gen),\nbut I wanted to create this issue for discussion about the sleeping/non-fsyncing of segments.gen, just\nbecause i guess its possible someone could hit this slowness.\n ",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3605",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "revisit segments.gen sleeping",
    "systemSpecification": true,
    "version": ""
}