{
    "comments": [
        {
            "author": "Simon Willnauer",
            "body": "Here is a first patch which all testcases passing. I also changed {{TestPerFieldCodecSupport}} to exhaustively use codec writing files with the same extension - all passes.\n\nsimon",
            "date": "2010-11-15T13:52:11.839+0000",
            "id": 0
        },
        {
            "author": "Simon Willnauer",
            "body": "If nobody objects I will commit this soon!",
            "date": "2010-11-15T15:41:22.232+0000",
            "id": 1
        },
        {
            "author": "Simon Willnauer",
            "body": "Committed in revision: 1035354",
            "date": "2010-11-15T17:02:52.414+0000",
            "id": 2
        },
        {
            "author": "Simon Willnauer",
            "body": "For the record : this is also a file format change and requires reindexing if somebody uses indexes build with Lucene-Trunk",
            "date": "2010-11-15T17:07:22.696+0000",
            "id": 3
        }
    ],
    "component": "core/index",
    "description": "Currently we have a rather simple file naming scheme which prevents us from using more than one codec in a segment that relies on the same file.  For instance pulsing and standard codec can not be used together since they both need the .frq .tii .tis etc. To make this work we either need to write distinct per codec files or set a per field / codec file ID. While the first solution seems to be quiet verbose the second one seems to be more flexible too.\n\nOne possibility to do that would be to assign a unique id to each SegmentsWriteState when opening the FieldsConsumer and write the IDs into the segments file to eventually load it once the segment is opened. Otherwise our PerFieldCodec feature will not be really flexible nor useful though.  ",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2741",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Several Codecs use the same files - PerFieldCodecWrapper can not hold two codec using the same files",
    "systemSpecification": true,
    "version": "4.0-ALPHA"
}