{
    "comments": [
        {
            "author": "Doron Cohen",
            "body": "Attached 840-benchmark-tests.patch adds unit tests. \nNo bugs exposed, but it would be useful for future changes.\n\nThe patch code is relative to contrib/benchmark of current trunk, but it is based on the pending changes of 837 and in fact contains these changes, so it can be tried now. Once 837 is committed I will update this patch.\n\nI had to modify a little the Benchmark class API so that it is easy to run a benchmark from a String, using StringReader (rather than from a file).\n\nAdded two tests only - a \"parse\" one that verifies that tasks are parsed to what they should, and a \"logic\" one that verifies that the test side effects (index creation, docs adding, search being called, etc.) is as expected. I think it should be fairly easy now to add further tests to the \"logic\" one, should that be needed.\n\nTo use it:\n -  cd to contrib/benchmark\n -  apply patch\n -  ant test\n",
            "date": "2007-03-21T05:14:58.431+0000",
            "id": 0
        },
        {
            "author": "Doron Cohen",
            "body": "Patch updated to apply cleanly on current code.\n\nShould be applied from trunk because it also modifies common-build.xml (to allow the test to scan for PerfTask classes, and attempt to test their parsing, in case their names were not added to TestPerfTasksParse. \n\nIf no comments will commit this pretty soon.",
            "date": "2007-03-21T19:53:51.246+0000",
            "id": 1
        },
        {
            "author": "Doron Cohen",
            "body": "Just commited this. \n\n(Note: tests added are quite basic, however structure is now there for adding more.)\n",
            "date": "2007-03-22T23:43:14.616+0000",
            "id": 2
        }
    ],
    "component": "modules/benchmark",
    "description": "The need came up in this thread: \nhttp://www.mail-archive.com/java-dev@lucene.apache.org/msg09260.html\n\n: We might want to start thinking about Unit Tests...  :-)  Seems kind\n: of weird to have tests for tests, but this is becoming sufficiently\n: complex that it should have some tests.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-840",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "contrib/benchmark unit tests",
    "systemSpecification": true,
    "version": ""
}