{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "here's a patch, i didnt add support for existing scorers though:\n\nin my opinion, all scorers that contain other scorers should implement this api so that you can traverse them.",
            "date": "2011-07-20T20:34:16.106+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "I like this simplification!  I agree baking in BQ's relationships into this Scorer API is not good, and it's better to let the caller decide how/when/what subs to visit.\n\n+1 to commit",
            "date": "2011-08-15T13:45:56.228+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "Thanks for taking a look, if there are no objections i'll commit in a few days, and open a followup issue to ensure that all scorers support traversing, there are still a lot that need to implement the method in order to support access to any inner scorers.\n\nFor example, in my opinion even ConstantScoreQuery shoudl allow you to get access to its inner scorer via some \"CONSTANT_SCORED\" relationship or similar.",
            "date": "2011-08-15T17:54:59.545+0000",
            "id": 2
        }
    ],
    "component": "",
    "description": "Currently there is an (expert) API in scorer to allow you to take a scorer, and visit its children etc (e.g. booleanquery).\n\nI think we should improve this, so its general to all queries.\n\nThe current issues are:\n* the current api is hardcoded for booleanquery's Occurs, but we should support other types of children (e.g. disjunctionmax)\n* it can be difficult to use the API, because of the amount of generics and the visitor callback API. \n* the current API enforces a DFS traversal when you might prefer BFS instead.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3330",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "revise Scorer visitor API",
    "systemSpecification": true,
    "version": ""
}