{
    "comments": [
        {
            "author": "Shai Erera",
            "body": "Patch includes changes to SegmentMerger, IndexReader, SegmentReader, CHANGES, and TestSegmentReader (on tags as well).\n\nI think this is ready to commit (all tests pass). Before commit, we should complete the \"Shai Erera via\" in CHANGES.",
            "date": "2009-06-21T08:42:03.872+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "I see lots of cleanups snuck in here ;)",
            "date": "2009-06-22T15:35:47.489+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "Attached another iteration on the patch, basically cosmetic changes (removing un-needed args, naming things more verbosely, etc.).  I think it's ready to be committed.  I'll wait a day or two.",
            "date": "2009-06-22T16:29:52.330+0000",
            "id": 2
        },
        {
            "author": "Shai Erera",
            "body": "bq. I see lots of cleanups snuck in here\n\nNot all cleanups are bad, i.e. changing to iteration-based loops, rather than calling list.size() in each loop and list.get(i), is better, and cleaner :). I admit though that some of the cleanups just helped me understand the code better.",
            "date": "2009-06-22T19:57:31.527+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Not all cleanups are bad,\n\nOh, they are all good cleanups!  I just wish they were in a dedicated \"cleanup\" issue, somehow, instead... because then it's harder for me to focus on the \"real\" changes (though I realize \"clean as you go\" is mighty convenient).",
            "date": "2009-06-22T20:12:27.558+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Shai!",
            "date": "2009-06-23T20:32:39.696+0000",
            "id": 5
        },
        {
            "author": "Mark Miller",
            "body": "I cant find the back compat discussion on this. Did I miss?\n\nI do see where mike mentions the isDeleted change should happen with deprecation, but this patch appears to just make the change. Our current back compat policy doesn't allow that. It doesn't even really allow the really special exceptions that we have had to make (and I think it should spell that out, as well as our 'experiemental trick'). We have not officially allowed a relaxed back compat policy right?\n\nI'm not trying to police back compat, but I think we need to do our best to live up to it until its officially changed. Having had to make a couple exceptions doesn't mean we can just toss it for this release.\n\nSorry if I missed the relevant discussion on this - didn't see anything in the attached email thread.",
            "date": "2009-07-02T16:36:00.047+0000",
            "id": 6
        },
        {
            "author": "Mark Miller",
            "body": "I suppose, to be fair, we do mention that we might change runtime behaviour and document it - its just that we don't usually say, code around it.\n\nI guess its simple enough here thats its not really a big deal. I was just surprised I saw no mention of back compat in the discussion other than Mike mentioning that the change should be made through deprecation early on in the attached email thread.",
            "date": "2009-07-02T17:13:34.197+0000",
            "id": 7
        },
        {
            "author": "Shai Erera",
            "body": "There is a paragraph in CHANGES under \"Changes to Runtime Behavior\" that explains this. I think it was on the email thread and not on this issue, that people preferred the runtime change vs. the deprecation and a new method name for document(), under the assumption that it's very unlikely that someone relies on IndexReader.document() checking for isDeleted (i.e., it passes a document which may or may not be deleted).",
            "date": "2009-07-02T17:54:57.903+0000",
            "id": 8
        },
        {
            "author": "Mark Miller",
            "body": "bq. There is a paragraph in CHANGES under \"Changes to Runtime Behavior\" that explains this. \n\nRight, I saw that - I just wondered about the discussion to do it.\n\nbq. I think it was on the email thread and not on this issue, that people preferred the runtime change vs. the deprecation and a new method name for document(), under the assumption that it's very unlikely that someone relies on IndexReader.document() checking for isDeleted (i.e., it passes a document which may or may not be deleted).\n\nThanks - thats the discussion I wasn't able to spot.\n\nI see - it was a quick back and forth at the end. Got lazy towards the end :) Thanks for pointing out.",
            "date": "2009-07-02T18:03:52.987+0000",
            "id": 9
        },
        {
            "author": "Shai Erera",
            "body": "bq. it was a quick back and forth at the end. Got lazy towards the end\n\nSometimes it's a valid way to pass a decision ;).",
            "date": "2009-07-02T18:37:42.620+0000",
            "id": 10
        }
    ],
    "component": "core/index",
    "description": "A spin off from here: http://www.nabble.com/Some-thoughts-around-the-use-of-reader.isDeleted-and-hasDeletions-td23931216.html.\nTwo changes:\n# Optimize SegmentMerger work when a reader has no deletions.\n# IndexReader.document() will no longer check if the document is deleted.\n\nWill post a patch shortly",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1708",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Improve the use of isDeleted in the indexing code",
    "systemSpecification": true,
    "version": ""
}