{
    "comments": [
        {
            "author": "Chris Male",
            "body": "Actually I now see the ability to set the full jarfile in the contrib-uptodate macro.  I still want to avoid this, since it requires the invoker of the macro to know the full path.\n\nInstead I think having an optional 'project-name' property will suffice.",
            "date": "2011-06-26T23:48:38.898+0000",
            "id": 0
        },
        {
            "author": "Chris Male",
            "body": "Patch adds contrib-src-name attribute to contrib-uptodate.  This allows the name of the src for the contrib to be different to the contrib's project name.  \n\nThe name attribute is now assumed to be the project name.  \n\nIf the contrib-src-name property is omitted, name is used.\n\nI have code that makes use of this (in changing the queries contrib to queries-contrib) and have verified it works.\n\nI'd be great if someone could review this to see any implications I might have missed.",
            "date": "2011-06-27T00:31:48.958+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "just a thought: should we have a queries contrib and a queries module?\n\nCan the \"good\" stuff in the queries contrib move to the module, and the \"sandbox\" stuff (if any) go somewhere else?!\n",
            "date": "2011-06-27T00:58:00.408+0000",
            "id": 2
        },
        {
            "author": "Steve Rowe",
            "body": "bq. Can the \"good\" stuff in the queries contrib move to the module, and the \"sandbox\" stuff (if any) go somewhere else?!\n\n+1",
            "date": "2011-06-27T01:04:59.226+0000",
            "id": 3
        },
        {
            "author": "Chris Male",
            "body": "Absolutely.  I intended to do that after I had resolved the FunctionQuery moving (as its a dependency for many other issues).  Would you guys prefer I do that and not make this change? Or are you okay with this change as well?",
            "date": "2011-06-27T01:11:34.888+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "i think you should make this change and proceed forward!",
            "date": "2011-06-27T01:21:44.166+0000",
            "id": 5
        },
        {
            "author": "Chris Male",
            "body": "Committed revision 1139989.\n\nI'm going to leave module-uptodate alone till there is a need to change it.",
            "date": "2011-06-27T01:30:55.996+0000",
            "id": 6
        },
        {
            "author": "Robert Muir",
            "body": "I committed a tiny fix, a ${name} -> @{name}",
            "date": "2011-06-27T01:35:03.296+0000",
            "id": 7
        },
        {
            "author": "Chris Male",
            "body": "Thanks Robert!",
            "date": "2011-06-27T01:36:34.555+0000",
            "id": 8
        },
        {
            "author": "Chris Male",
            "body": "Murphy's law, I needed to fix module-uptodate.\n\nCommitted revision 1139996.",
            "date": "2011-06-27T01:45:17.316+0000",
            "id": 9
        }
    ],
    "component": "general/build",
    "description": "With adding a new 'queries' module, I am trying to change the project name of contrib/queries to queries-contrib.  However currently the contrib-uptodate assumes that the name property is used in the path and in the jar name.\n\nBy using the name in the path, I must set the value to 'queries' (since the path is contrib/queries).  However because the project name is now queries-contrib, the actual jar file will be lucene-queries-contrib-${version}.jar, not lucene-queries-${version}.jar, as is expected.\n\nConsequently I think we need to separate the path name from the jar name properties.  For simplicity I think adding a new jar-name property will suffice, which can be optional and if omitted, is filled in with the name property.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3244",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Contrib/Module-uptodate assume name matches path and jar",
    "systemSpecification": true,
    "version": ""
}