{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "Here's a patch.\n\nIn general i fixed our tests too (to not use SecureRandom, this has been a problem for Mike before). The only hack is in QueryUtil where we test the serialization.\n\nBut in my opinion its good to workaround this in the tests so that we know we aren't doing it in the code.\n",
            "date": "2010-12-27T07:04:56.148+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "Hi Robert,\n\npatch looks theoretically fine, although I dislike the code duplication and the duplication of temp file code.\n\nI dont understand the whole problem why you care of this additional thread. Just put this thread name on the rogue list and we are fine. The badest thing is interrupting this thread for no reason. The PKCS thread is generated on MacOSX, because its underlying security system is different from Windows or Linux. On Windows and MacOSX the PKCS system uses the trusted root certificates from the operating system and it seems that on MacOSX this needs some thread to handle the OS' PKCS library. Its as stupid as killing processes on Android phones as recreating them uses more resources than keep them running. If you start to kill this thread you can also kill all GC threads just for fun :-)\n\nThe reason why serialization starts the thread: Serialization uses hashing, too :-) - The PKCS thread is for me just a system thread with the difference that its started lazily when first accessed.\n\nOne thing: I don't like the empty catch blocks /* cannot happen */. Even if this is the case, please throw at least a RuntimException. Some user may stiull use a broken JVM where the charsets.jar file is lost :-) (ok, that should not happen, but I like it more to have that).\n\n+1 for the UTF-8 fix (this will not break most lock file names, as filenames and hopefully index dir pathes are mostly ASCII)\n-1 for MD5Digest code duplication\n-1 for the temp file code dumplication\n\nMy opinion:\nLazy init the static MessageDigest class in FSDirectory. Its almost never used.\n\nWill post an alternative patch soon (lazy init MessageDigest only when needed first, add fixed UTF-8 charset).",
            "date": "2010-12-27T09:55:55.738+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Here my patch. With the System.out in FSDir.getLockID I checked when this method is called now. I changed the code in FSDir.setLockFactory() a little bit to not always call getLockId() and then lazy init the MessageDigest. Now its only called two times during the whole test run: once in TestIndexWriter (because there is some test with a lock file in foreign dir) and once in the LockFactory test (same reason). All other tests never call getLockID() useless.\n\nI don't like it to kill the PKCS thread, I just added it to the exclusion list in LuceneTestCase (using a regex on SunPKCS12). There may be other platform doing the same (as the SunPKCS provider uses for performance and consistency native algorithm routines from the underlying operating system, like the root certificates).",
            "date": "2010-12-27T10:39:08.032+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "I forgot to mention: Patch not yet tested, as I first need to boot my Snow Leopard VirtualBOX and install SVN there. Maybe someone else can check this patch.",
            "date": "2010-12-27T10:41:47.510+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Here the two tests that use the LockID:\n- TestLockFactory.testNativeFSLockFactoryPrefix(TestLockFactory.java:240) [this explicitely sets another dir as lock dir, so the hash is enforced]\n- TestIndexWriter.testEmptyFSDirWithNoLock(TestIndexWriter.java:2644) [this uses another lock factory than FSLockFactory, so the LockId is passed to the LockFactory]",
            "date": "2010-12-27T10:50:38.041+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "{quote}\nI don't like it to kill the PKCS thread, I just added it to the exclusion list in LuceneTestCase (using a regex on SunPKCS12). There may be other platform doing the same (as the SunPKCS provider uses for performance and consistency native algorithm routines from the underlying operating system, like the root certificates).\n{quote}\n\nplease do not do this. i do not want the exclusion list growing.\n\nin fact, if we don't fix this TimeLimitingCollector soon, I'm gonna remove it too (which will cause tests to fail).\nWhen we hide things like this, then nobody will fix them.",
            "date": "2010-12-27T12:44:53.087+0000",
            "id": 5
        },
        {
            "author": "Uwe Schindler",
            "body": "This thread is a \"system thread\" and has nothing to do with Lucene. Killing it is something you should not do in a running JVM. To remove it from the exclusion list, just get a MessageDigest or somehow else access the PKCS library before you build the system thread map (the static while loop in LTC).\n\nSorry, this time I don't agree with you and will revert all commits like that!",
            "date": "2010-12-27T12:51:21.894+0000",
            "id": 6
        },
        {
            "author": "Robert Muir",
            "body": "Sorry, I don't agree with you about the MessageDigest use.\n\nThe fact MD5 exists *is not guaranteed*.\n\nSo, you can say \"-1 for the Md5 duplication\" all you want but there is no duplication at all if the JVM does not support it!\n\n-1 for non-portable code.\n",
            "date": "2010-12-27T12:55:53.977+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "setting this as a bug for 2.9.x and 3.0.x too, as its very serious.\n\nbesides the fact we use non-portable code (the algorithm may not exist), we rely upon the default charset so the entire idea is completely broken.\n",
            "date": "2010-12-27T13:03:09.694+0000",
            "id": 8
        },
        {
            "author": "Robert Muir",
            "body": "bq. This thread is a \"system thread\" and has nothing to do with Lucene.\n\nExactly, so we shouldn't be starting it in our code.\n",
            "date": "2010-12-27T13:05:30.938+0000",
            "id": 9
        },
        {
            "author": "Robert Muir",
            "body": "{quote}\nOne thing: I don't like the empty catch blocks /* cannot happen */. Even if this is the case, please throw at least a RuntimException. Some user may stiull use a broken JVM where the charsets.jar file is lost  (ok, that should not happen, but I like it more to have that).\n{quote}\n\nYour comment makes no sense, unlike the MD5 case, UTF-8 support is guaranteed in all versions of java.\n\n\"Every implementation of the Java platform is required to support the following standard charsets.\n...\nUTF-8\tEight-bit UCS Transformation Format\"\n\nI think you are somehow confused about things that are mandatory to be supported in java,\nand things that only *happen to exist in all sun jvms*.\n",
            "date": "2010-12-27T13:19:34.121+0000",
            "id": 10
        },
        {
            "author": "Michael McCandless",
            "body": "I just hit this (got spooky leftover thread warning running test on OS\nX).  I think we should fix it.\n\nI like the initial approach: let's not use MessageDigest at all\n(import our own MD5, that does not spawn threads!!).  Sure it's code\ndup but it's tiny and it mitigates risk so I think it's well worth\nit.\n\nIn general Lucene should not use \"interesting\" (risky) parts of the\nJVM/Java if we can avoid it w/o much cost, and this is a really silly\nreason to be using MessageDigest (similar to our now-gone crazy usage\nof ManagementFactory just to acquire a test lock).  We are a search\nlibrary!  We must use the bare minimum of the OS/filesystem/JVM that\nwe need.\n\nIn fact in this case... can't we nuke DIGESTER altogether?  Lucene now\nstores lock files in the index dir by default as \"write.lock\".  We\nonly need this digest if you change that dir.  So, if your app somehow\nwants to put the lock file elsewhere (unusual), it should be up to you\nto name it \"uniquely\" relative to other IWs storing locks in the same\ndir (we can do this under a separate issue).\n\nAnd not using SecureRandom to create temp files is a no-brainer -- the\nbuiltin File.createTempFile must be secure, by design, but we\nobviously don't need that here. I've had awful problems in the past w/\nSecureRandom (because my machine didn't have enough true\nrandomness!).  Again: Lucene should only use what's we really need.\n\nI think we can remove the controversial \"interrupt the weird OS X\nPKCS11 thread\" from the patch since serialization is now gone?  I'd\nlike to know if this thread suddenly pops up again in our tests... and\nI agree it's dangerous to interrupt this thread (it could then cause\nweird failures in subsequent tests, eg if the thread doesn't restart).\n\nbq. One thing: I don't like the empty catch blocks /* cannot happen */. Even if this is the case, please throw at least a RuntimException\n\n+1 -- I like this idea (I don't do it now but I'll try to going\nforward). Defensive programming...\n",
            "date": "2011-03-08T20:17:37.523+0000",
            "id": 11
        },
        {
            "author": "Michael McCandless",
            "body": "\nNew patch, just modernized to current trunk, removed special-case\nchecking of OS X's PKCS11 thread (since we no longer serialize), and\nthrow new RE() in those \"impossible\" catch clauses.\n\nI think it's important we poach our own MD5 impl because 1) Java's\ncrypto lib is not guaranteed to impl MD5, 2) using MD5 has hidden\ncosts (spawning this thread in OS X), and 3) no longer using\nSecureRandom just to create our temp test dirs makes great sense\n(we've had crazy problems w/ SecureRandom in the past).\n\nI think it's ready to commit.  Uwe do you still have such strong\nobjections?\n",
            "date": "2011-05-22T13:31:31.608+0000",
            "id": 12
        },
        {
            "author": "Michael McCandless",
            "body": "New patch, I think it's ready to commit!\n\nI dropped MD5 entirely and cutover to our own simple digest computation (same as String.hashCode).",
            "date": "2011-05-25T17:28:48.591+0000",
            "id": 13
        },
        {
            "author": "Uwe Schindler",
            "body": "Hi Mike,\nfrom my point of view, this seems fine. We broke the MD5 already by forcing UTF-8 instead of the default character set, so we can even change the whole hashing :-)\n\nCollisions are not really an issue, this lock file naming is only used for lock files outside index directory to make the chance of file name collisions less. Normal users will store lock files in index directory, so this is not really an issue (lock prefix is null for this case).\n\nAlternatively, to prevent collision, instead of hashing we could also collect all characters that are valid for file names (remove all non-ASCII chars and '/'). But this could produce a too-long filename.",
            "date": "2011-05-25T18:21:59.512+0000",
            "id": 14
        },
        {
            "author": "Robert Muir",
            "body": "bulk close for 3.3",
            "date": "2011-07-02T02:40:17.961+0000",
            "id": 15
        }
    ],
    "component": "",
    "description": "on the Mac, creating the digester starts up a PKCS11 thread.\n\nI do not think threads should be created statically (I have this same issue with TimeLimitedCollector and also FilterManager).\n\nUwe discussed removing this md5 digester, I don't care if we remove it or not, just as long as it doesn't create a thread,\nand just as long as it doesn't use the system default locale.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2834",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "don't spawn thread statically in FSDirectory on Mac OS X",
    "systemSpecification": true,
    "version": ""
}