{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "patch with mod to wordlistloader, test, and snowball stoplists for danish, dutch, english, finnish, french, german, hungarian, italian, norwegian, russian, spanish, and swedish",
            "date": "2010-01-13T14:36:35.512+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "I will commit this in a few days if no one objects. Again i add the getSnowballWordSet to WordListLoader, but if this is inappropriate we could instead have a SnowballWordListLoader in our snowball package or something, doesn't matter to me.\n",
            "date": "2010-01-13T23:52:01.820+0000",
            "id": 1
        },
        {
            "author": "Simon Willnauer",
            "body": "Robert, patch looks good except of one thing. \n{code}\n  public static HashSet<String> getSnowballWordSet(Reader reader)\n{code}\n\nit returns a hashset but should really return a Set<String>. We plan to change all return types to the interface instead of the implementation.\n",
            "date": "2010-01-16T13:22:10.953+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "thanks Simon, I agree",
            "date": "2010-01-16T13:30:24.334+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 899955.",
            "date": "2010-01-16T14:07:55.806+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "Hi Robert,\n\nwhen i changed the backwards tests i added a new param to svn exec task. With this patch it now behaves equal to bw checkouts:\n\n- If you have no svn.exe available, it will ignore the checkout. If this is so, the test should pass, so I added an exit condition, if the data dir is not available.\n- If you have a svn.exe available, but the checkout fails, there is an network error or something else. The data dir now exists but the build should stop in this case.",
            "date": "2010-01-17T15:43:43.699+0000",
            "id": 5
        },
        {
            "author": "Uwe Schindler",
            "body": "Sorry some whitespace issues. Fixed here.",
            "date": "2010-01-17T15:46:29.334+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed Revision: 900160",
            "date": "2010-01-17T16:13:35.159+0000",
            "id": 7
        }
    ],
    "component": "modules/analysis",
    "description": "The snowball project creates stopword lists as well as stemmers, example: http://svn.tartarus.org/snowball/trunk/website/algorithms/english/stop.txt?view=markup\n\nThis patch includes the following:\n* snowball stopword lists for 13 languages in contrib/snowball/resources\n* all stoplists are unmodified, only added license header and converted each one from whatever encoding it was in to UTF-8\n* added getSnowballWordSet  to WordListLoader, this is because the format of these files is very different, for example it supports multiple words per line and embedded comments.\n\nI did not add any changes to SnowballAnalyzer to actually automatically use these lists yet, i would like us to discuss this in a future issue proposing integrating snowball with contrib/analyzers.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2206",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "integrate snowball stopword lists",
    "systemSpecification": true,
    "version": ""
}