{
    "comments": [
        {
            "author": "Adriano Crestani",
            "body": "These classes have not relation with the queryparser code, the queryparser only uses it. Maybe in future other parts of lucene may start using it. So I vote to leave it outside queryParser package for now, and when other parts of lucene start using it, we can think about moving it to core.",
            "date": "2009-09-02T19:16:43.942+0000",
            "id": 0
        },
        {
            "author": "Luis Alves",
            "body": "+1 to keep outside parser.\n\nThese small utility classes are designed to handle Message translation, for the queryparser but can be used by any other component in lucene that wants to display translated resources.",
            "date": "2009-09-02T22:36:48.041+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "I agree it would be nice to have a package for localized messages in general.\nIn the future this leaves open the door for localization of other parts of lucene.\n\nsince it uses MessageFormat etc, I think it would be very reusable.\n",
            "date": "2009-09-02T22:54:44.300+0000",
            "id": 2
        },
        {
            "author": "Mark Miller",
            "body": "The window is closing on this one - the current code is 1.5 - do we want to convert to 1.4 and move to core? Move to messages contrib? Else it will remain the same.",
            "date": "2009-09-07T02:16:21.499+0000",
            "id": 3
        },
        {
            "author": "Hoss Man",
            "body": "bq. These classes have not relation with the queryparser code, the queryparser only uses it.\n\nthat seems like a pretty strong argument to promote it into it's own contrib ... no other contrib is going to start depending on queryParser just to get access to a messages class -- And if we wait until 3.x to move it to it's own contrib, we make a lot of headaches for any users who start(ed) using the queryParser contrib in 2.9, because all of hte sudden their code will stop working at runtime because the classes can't be found.\n\n(it's an easy problem to fix: tell them to use the new jar as well, but it reflects badly on the project when people encounter annoyances like that when upgrading)\n\nThat said: i'm not going to argue that hard if no more closely involved in the contrib thinks it's worth moving .. removing 2.9 fix-for.",
            "date": "2009-09-08T18:11:04.782+0000",
            "id": 4
        },
        {
            "author": "Luis Alves",
            "body": "The original idea is to have messages and the new queryparser moved into core on 3.0. But this was discussed in the mailing list and the community thinks it's better to give it some more time for the API's on the new QP to get stable and allow more time for review of the new queryparser.\n\nI think there is an understanding to move the new QueryParser to core, when 3.1 is released.\n\nWhen the new messages and the queryparser is moved to core, it will be more usable.  If we keep it on contrib, in my opinion we should leave it as is for release 2.9 and 3.0\n\nWe should re-look at this issue when 3.0 is done, by moving message and the queryparser to core.\n\n",
            "date": "2009-09-09T17:38:31.594+0000",
            "id": 5
        },
        {
            "author": "Luis Alves",
            "body": "{quote}\nThe window is closing on this one - the current code is 1.5 - do we want to convert to 1.4 and move to core? Move to messages contrib? Else it will remain the same.\n{quote}\n\n+1 I am OK with making the o.a.l.messages.* 1.4 compatible and move it to core in 2.9.\n\nNOTE: We also would have to move the testcases for the o.a.l.messsages.*",
            "date": "2009-09-09T18:00:57.589+0000",
            "id": 6
        },
        {
            "author": "Adriano Crestani",
            "body": "+1 to make it 1.4 compatible and move it to core in 2.9\n\n+1 to move it to another contrib project called, e.g. \"messages\"\n\nI think Hoss made his point about not leaving this code in queryparser contrib project and I agree.",
            "date": "2009-09-09T23:37:29.801+0000",
            "id": 7
        },
        {
            "author": "Mark Miller",
            "body": "Can you do it right now? So I can do rc4 tonight?",
            "date": "2009-09-09T23:41:06.069+0000",
            "id": 8
        },
        {
            "author": "Adriano Crestani",
            "body": "Hi Mark,\n\n{quote}\nCan you do it right now? So I can do rc4 tonight? \n{quote}\n\nWho is \"you\"? And do what, move to core or move to a new contrib project?",
            "date": "2009-09-10T01:05:47.057+0000",
            "id": 9
        },
        {
            "author": "Robert Muir",
            "body": "first do:\n{noformat}\nsvn move contrib/queryparser/src/java/org/apache/lucene/messages src/java/org/apache/lucene\nsvn move contrib/queryparser/src/test/org/apache/lucene/messages src/test/org/apache/lucene\n{noformat}\nthen apply patch",
            "date": "2009-09-10T01:17:31.353+0000",
            "id": 10
        },
        {
            "author": "Luis Alves",
            "body": "I created a patch it should apply clean in main.\n\nI'm looking at Robert's patch, only notice he posted after I created the patch :)\n\n",
            "date": "2009-09-10T01:29:34.093+0000",
            "id": 11
        },
        {
            "author": "Mark Miller",
            "body": "Okay - just let me know which to go with",
            "date": "2009-09-10T01:31:25.217+0000",
            "id": 12
        },
        {
            "author": "Robert Muir",
            "body": "Luis the only real difference from yours is i used Object[] for the varags like the 1.4 MessageFormat\n\ndo we really need to deprecate the Object[] when it becomes ... in 1.5? sun didnt.\nI am java5 brain-dead :) this is documented to be compatible: http://java.sun.com/j2se/1.5.0/docs/guide/language/varargs.html",
            "date": "2009-09-10T01:32:12.546+0000",
            "id": 13
        },
        {
            "author": "Luis Alves",
            "body": "I looked at Robert's patch it is very similar to mine, \nbut Robert changed the testcases and the queryparser code to use a new method signature.\n\nMy patch added more utility methods (deprecated) on NLS and MessageImpl and does not require any changes the QP and the tescases.\n\nI prefer my approach because it will be compatible to jdk1.5, once we remove the utility methods from these classes and revert back to the jdk 1.5 syntax in 3.0.\n\nRobert please take a look at my patch and see if you like it.",
            "date": "2009-09-10T01:43:56.023+0000",
            "id": 14
        },
        {
            "author": "Robert Muir",
            "body": "Luis, yeah, the difference is your patch has the deprecated methods.\n\nin my patch there are no deprecated methods, it uses Object[] instead of varargs.\nbut these are compatible to jdk1.5: http://java.sun.com/j2se/1.5.0/docs/guide/language/varargs.html\nso you can change it to ... (varargs) and it will be backwards compatible, without any deprecation.\nthen at your leisure, once on jdk1.5, you can remove the new Object[] {}, it will be autoboxed.\n",
            "date": "2009-09-10T01:46:38.938+0000",
            "id": 15
        },
        {
            "author": "Luis Alves",
            "body": "I agree with you on the compatibility, I'll remove the deprecated from the getLocalizedMessage method on \nNLS class and submit again\n{code}\npublic static String getLocalizedMessage(String key, Locale locale, Object[] args)\n{code}\n\nI just think it is ugly having to create a Object array for every call to the Message classes.\nSee Example below.\n\nOriginal or with my patch\n{code}\nthrow new ParseException(new MessageImpl(QueryParserMessages.INVALID_SYNTAX_ESCAPE_NONE_HEX_UNICODE, c));\n{code}\n\nExample using your patch:\n{code}\nthrow new ParseException(new MessageImpl(QueryParserMessages.INVALID_SYNTAX_ESCAPE_NONE_HEX_UNICODE, new Object[]{c}));\n{code}\n\nThis is not a big thing for me.\nIf we don't care that the users of these classes in 2.9 are required to create the object arrays for most method calls, then\nI am totally ok with your patch.\n\nWe can clean the new QueryParser code, of those object arrays in 3.0.\n\nRobert or Mark pick any of the patches, they both look good to me.\nNeed to go home, I'll check the issue later.",
            "date": "2009-09-10T02:10:49.214+0000",
            "id": 16
        },
        {
            "author": "Luis Alves",
            "body": "I updated the my patch to remove the deprecated from\n{code}\npublic static String getLocalizedMessage(String key, Locale locale, Object[] args)\n{code}\n\nI'm also ok with Robert patch, they are almost identical.",
            "date": "2009-09-10T02:15:07.973+0000",
            "id": 17
        },
        {
            "author": "Robert Muir",
            "body": "bq. I just think it is ugly having to create a Object array for every call to the Message classes.\n\nmy reasoning here was that this is how MessageFormat works in java 1.4, since this is a wrapper around MessageFormat, it is consistent with MessageFormat.\n",
            "date": "2009-09-10T02:18:39.044+0000",
            "id": 18
        },
        {
            "author": "Robert Muir",
            "body": "Luis, if we go with your patch, I think we should add MessageImpl(Object[]) constructor back , not deprecated, to be changed to MessageImpl(Object ...) in 1.5\notherwise it is limited to 3 arguments :)\n",
            "date": "2009-09-10T02:22:30.128+0000",
            "id": 19
        },
        {
            "author": "Mark Miller",
            "body": "I agree on the consistency front - Robert, I'll go with yours it looks - is it ready, or need to make any last changes?",
            "date": "2009-09-10T02:28:01.582+0000",
            "id": 20
        },
        {
            "author": "Robert Muir",
            "body": "bq. I agree on the consistency front - Robert, I'll go with yours it looks - is it ready, or need to make any last changes? \n\ni think it is ready, all the tests pass.",
            "date": "2009-09-10T02:31:34.919+0000",
            "id": 21
        },
        {
            "author": "Mark Miller",
            "body": "Thanks a million guys.",
            "date": "2009-09-10T02:53:33.572+0000",
            "id": 22
        },
        {
            "author": "Uwe Schindler",
            "body": "One small thing:\nThe javadocs-all still list the messages package in queryparser contrib. I will attach a patch.",
            "date": "2009-09-10T06:15:35.789+0000",
            "id": 23
        },
        {
            "author": "Uwe Schindler",
            "body": "Revision: 813268",
            "date": "2009-09-10T07:11:25.757+0000",
            "id": 24
        },
        {
            "author": "Luis Alves",
            "body": "I was not able to read the thread late yesterday :(.\n\nBut great work, it's good to see the message classes in main.\nEven if is not my patch I like it :)\n\nThanks guys\n",
            "date": "2009-09-10T17:14:04.471+0000",
            "id": 25
        }
    ],
    "component": "modules/other",
    "description": "contrib/queryParser contains an org.apache.lucene.messages package containing some generallized code that (claims in it's javadocs) is not specific to the queryParser.\n\nIf this is truely general purpose code, it should probably be moved out of hte queryParser contrib -- either into it's own contrib, or into the core (it's very small)\n\n*EDIT:* alternate suggestion to rename package to fall under the o.a.l.queryParser namespace retracted due to comments in favor of (eventually) promoting to it's own contrib",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1887",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "o.a.l.messages should be moved to core",
    "systemSpecification": true,
    "version": ""
}