{
    "comments": [
        {
            "author": "Hoss Man",
            "body": "The best way to see that this happens would be to provide information in this bug about how it can/should be done ... ideally this information should be added directly to the \"ReleaseTodo\" info so it not only gets done for the 1.9.1 and 2.0.0 releases, but also for future releases...\n\nhttp://wiki.apache.org/jakarta-lucene/ReleaseTodo\n\n..i can't find the refrence now, but i seem to recall someone somehwere saying that things put i nthe maven2 repos were automagically copied to maven1 ...  i guess that's not true afterall.",
            "date": "2006-11-30T22:34:46.000+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "The ReleaseTodo page is immutable so I can't modify it directly.\n\nAt least the Maven sync directory information is outdated, the new official path (although I think the previous one is still symlinked) is /www/people.apache.org/repo/m2-ibiblio-rsync-repository.\n\nYou are right in that the artifacts in the Maven 2 repository above should (AFAIK) get automatically copied also to the Maven 1 repository. At least it works the other way. I'll check that and report back.",
            "date": "2006-11-30T22:49:13.000+0000",
            "id": 1
        },
        {
            "author": "Hoss Man",
            "body": "FYI: anyone can edit the wiki if you create an account and login.",
            "date": "2006-11-30T23:19:54.000+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "Digging deeper I found that the artifacts are actually located in the Maven 1 repository thanks to some URL rewrite magic, i.e. http://repo1.maven.org/maven/org.apache.lucene/jars/lucene-core-2.0.0.jar exists even though http://repo1.maven.org/maven/org.apache.lucene/jars/ returns a 404 error. So from my perspective it's OK to resolve this issue as Invalid.\n\n> FYI: anyone can edit the wiki if you create an account and login.\n\nYes, thanks. I probably had the page locally cached since I still got the \"immutable\" message on the page after creating an account and logging in. Now it shows up as editable, I'll update the instructions.",
            "date": "2006-12-17T09:19:54.000+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "From the last comment, it looks like the 2.0 Lucene core JAR is in maven 1.",
            "date": "2006-12-18T20:18:33.000+0000",
            "id": 4
        }
    ],
    "component": "core/other",
    "description": "The Lucene 2.0 artifacts can be found in the Maven 2 repository, but not in the Maven 1 repository. There are still projects using Maven 1 who might be interested in upgrading to Lucene 2, so having the artifacts also in the Maven 1 repository would be very helpful.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-734",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Upload Lucene 2.0 artifacts in the Maven 1 repository",
    "systemSpecification": true,
    "version": ""
}