{
    "comments": [
        {
            "author": "Tim Smith",
            "body": "Patch that makes BooleanWeight and DisjunctionMaxWeight protected\n\nalso makes weights on DisjunctionMaxWeight protected",
            "date": "2009-08-06T13:21:47.373+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "I'm a little nervous in general about opening up the Weight impls for Lucene's core Queries, simply because in 2.9 (very much fresh on our minds right now) there have been very sizable changes to how Weight works in general, and how certain queries (esp. BooleanQuery) create scorers.  Opening up these classes further makes carrying out our back-compat policy even more challenging, and they are already amazingly challenging.  In particular, the back-compat implications of external subclasses to Lucene's core classes are the trickiest to get right.",
            "date": "2009-08-08T09:51:08.685+0000",
            "id": 1
        },
        {
            "author": "Tim Smith",
            "body": "it could be noted that the class will change in future versions (no back-compat guaranteed)\n\ni need the ability to be able to walk the weights recursively in order to do some rather nasty post-query analysis \n\nanother alternative would be to add a \"getWeights() method to the Weight/QueryWeight interface/class in order to allow generically walking query weights\nthis would then allow me to walk the weights as needed. Sadly i cannot walk the queries themselves because what i need is something that isn't resolved until Weight creation time (and this could be very expensive to recreate from the query)\n\ni guess this idea is somewhat complicated by the fact that Weight is an interface (and you then get compile time back compat issues)\n\nif the ability to walk the weights is not exposed, i'll just have to hack it in (copy source of these 2 classes and expose them as protected) and i prefer to not do this (much prefer using a pristine lucene distro)",
            "date": "2009-08-10T12:36:38.261+0000",
            "id": 2
        },
        {
            "author": "Tim Smith",
            "body": "Here's another approach that may be more desirable:\n\nadd a TraversableWeight interface:\n{code}\npublic interface TraversableWeight extends Weight {\n  List/*<Weight>*/ getWeights(); \n}\n{code}\n\nthen, DisjunctionMaxWeight and BooleanWeight could implement TraversableWeight\n\nthis way, as i traverse the weights, I can check (weight instanceof TraversableWeight) and then traverse the child weights as needed\ni can call weight.getQuery() to see if it was a BooleanQuery or a DisjunctionMaxQuery\n\nIf this is more acceptable, i can work up a patch",
            "date": "2009-08-10T12:53:50.804+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "I like the \"make Boolean/DisjunctionMaxWeight protected and note in the javadocs these APIs can suddenly change\" approach best... could you work up a patch, but on 2.9 not 2.4?",
            "date": "2009-08-10T14:15:17.730+0000",
            "id": 4
        },
        {
            "author": "Tim Smith",
            "body": "ok, will work up a patch on 2.9 making the classes (and members) protected with javadoc noting the volatility of the classes\n\npeople will only be able to get at these classes if they first override BooleanQuery/DisjunctionMaxQuery, and then in these overridden implementation also override BooleanWeight/DisjunctionMaxWeight (casual user will never do this anyway)",
            "date": "2009-08-10T14:20:48.969+0000",
            "id": 5
        },
        {
            "author": "Tim Smith",
            "body": "New patch that adds some javadoc marking these as EXPERT and \"subject to change\"",
            "date": "2009-08-10T15:13:18.051+0000",
            "id": 6
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Tim!  I plan to commit soon...",
            "date": "2009-08-10T15:22:35.338+0000",
            "id": 7
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Tim!",
            "date": "2009-08-10T18:36:52.136+0000",
            "id": 8
        }
    ],
    "component": "",
    "description": "Currently, BooleanWeight is private, yet it has 2 protected members (similarity, weights) which are unaccessible from custom code\n\ni have some use cases where it would be very useful to crawl a BooleanWeight to get at the sub Weight objects\n\nhowever, since BooleanWeight is private, i have no way of doing this\n\nIf BooleanWeight is protected, then i can subclass BooleanQuery to hook in and wrap BooleanWeight with a subclass to facilitate this walking of the Weight objects\n\nWould also want DisjunctionMaxWeight to be protected, along with its \"weights\" member\n\nWould be even better if these Weights were made public with accessors to their sub \"weights\" objects (then no subclassing would be necessary on my part)\n\nthis should be really trivial and would be great if it can get into 2.9\n\nmore generally, it would be nice if all Weight classes were public with nice accessors to relevant \"sub weights\"/etc so custom code can get its hooks in where and when desired",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1784",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Make BooleanWeight and DisjunctionMaxWeight protected",
    "systemSpecification": true,
    "version": "2.4"
}