{
    "comments": [
        {
            "author": "Chris Male",
            "body": "Patch which removes the QP dependency from the queries module and from highlighter.  \n\nThe only other module which depends on QP in its test is analysis-common, which combines some complex analysis with some reasonably complex queries.  Consequently I will leave this till later when we can examine the QP needs for the analysis module in general.",
            "date": "2011-07-07T05:16:16.573+0000",
            "id": 0
        },
        {
            "author": "Chris Male",
            "body": "After looking at the analysis-common dependencies, I think they can be refactored out. There isn't any need to actually form Querys, the same testing can be done by asserting the tokenstream contents. I'll work on those and upload a new patch.",
            "date": "2011-07-07T12:07:55.717+0000",
            "id": 1
        },
        {
            "author": "Chris Male",
            "body": "New patch which also addresses the analysis-common dependencies.\n\nIn both situations Querys were being created and executed needlessly instead of assertions being made on the contents of the tokenstream.  \n\nIn the case of the ShingleAnalyzerWrapperTest, some tests were dependent on the behavior of QueryParser and therefore were tests of QP parsing.\n\nThis is ready to go.",
            "date": "2011-07-08T02:45:48.729+0000",
            "id": 2
        },
        {
            "author": "Chris Male",
            "body": "Committed revision 1144566.",
            "date": "2011-07-09T01:12:00.135+0000",
            "id": 3
        }
    ],
    "component": "core/queryparser, modules/queryparser",
    "description": "Some contribs and modules depend on the core QueryParser just for simplicity in their tests.  We should apply the same process as I did to the core tests, and move them away from using the QueryParser where possible.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3284",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Move contribs/modules away from QueryParser dependency",
    "systemSpecification": true,
    "version": ""
}