{
    "comments": [
        {
            "author": "Randy Puttick",
            "body": "Implements union operation on a priority queue and scores multi-term based on maximum over terms versus essentially the average",
            "date": "2006-03-18T08:49:49.000+0000",
            "id": 0
        },
        {
            "author": "Mark Miller",
            "body": "Anyone think this still has merit? It looks interesting to me but I'm not so sure its the right approach...",
            "date": "2008-11-12T23:55:46.257+0000",
            "id": 1
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Based on the description, yes.  Doesn't this also sound a lot like that old Mark H's LUCENE-329 issue?\n",
            "date": "2008-11-13T04:28:35.705+0000",
            "id": 2
        },
        {
            "author": "Mark Miller",
            "body": "This patch is getting old and the code base has changed in this area. Would you like to submit another patch Randy? If not, I'd like to close this issue.\n\n(be sure to remove the Java 1.5 code if you update the patch)",
            "date": "2009-01-04T14:49:55.434+0000",
            "id": 3
        },
        {
            "author": "Mark Miller",
            "body": "I'm going to say its time to close this with all of the changes/improvements that have gone on here. Most of the issues brought up are addressed in a different manner. Further changes should be brought up in a new issue.",
            "date": "2009-12-06T20:19:39.436+0000",
            "id": 4
        }
    ],
    "component": "core/search",
    "description": "The implementation of MultiTermQuery in terms of BooleanQuery introduces several problems:\n\n1) Collisions with maximum clause limit on boolean queries which throws an exception.  This is most problematic because it is difficult to ascertain in advance how many terms a fuzzy query or wildcard query might involve.\n\n2) The boolean disjunctive scoring is not appropriate for either fuzzy or wildcard queries.  In effect the score is divided by the number of terms in the query which has nothing to do with the relevancy of the results.\n\n3) Performance of disjunctive boolean queries for large term sets is quite sub-optimal",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-524",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Current implementation of fuzzy and wildcard queries inappropriately implemented as Boolean query rewrites",
    "systemSpecification": false,
    "version": "1.9"
}