{
    "comments": [
        {
            "author": "Doron Cohen",
            "body": "Patch fixing int / long cast issues in RAMInputStream.\n\nAll tests pass but non of those actually demonstrates the bug being fixed. I don't currently have a large enough index to test this.\n\nI will wait for a manual test by Murali (who reported this issue), and for at least one patch review.",
            "date": "2007-07-12T23:05:33.907+0000",
            "id": 0
        },
        {
            "author": "Doron Cohen",
            "body": "Previous patch apparently did not fix the bug - a casting problem in RAMOutputStream had to be fixed. \nUpdated patch adds a test imitating ramFile larger than maxint. \nFor this had to make the allocation of a new byte array in RAMFile overridable. \nThe new test fails before fixing RAMOutputStream (affecting RAMDirectory constructor from FS). However the issues in RAMInputStream in fact do not cause failures, yet they should be fixed. \n\nWith a test in place I now feel confident in this fix - will commit it in a day or two if there are no reservations.",
            "date": "2007-07-15T21:52:36.850+0000",
            "id": 1
        },
        {
            "author": "Doron Cohen",
            "body": "committed.",
            "date": "2007-07-19T16:51:20.314+0000",
            "id": 2
        },
        {
            "author": "Murali Varadarajan",
            "body": "Doron Cohon,\n\nThanks a tonne. I tried your first patch and it didn't work. Today i saw your message and checked out the source from head and built it.\nIt worked !!!\n\n:-)",
            "date": "2007-07-28T01:49:17.219+0000",
            "id": 3
        }
    ],
    "component": "core/store",
    "description": "from user list - http://www.gossamer-threads.com/lists/lucene/java-user/50982\n\nProblem seems to be casting issues in RAMInputStream.\n\nLine 90:\n      bufferStart = BUFFER_SIZE * currentBufferIndex;\nboth rhs are ints while lhs is long.\nso a very large product would first overflow MAX_INT, become negative, and only then (auto) casted to long, but this is too late. \n\nLine 91: \n     bufferLength = (int) (length - bufferStart);\nboth rhs are longs while lhs is int.\nso the (int) cast result may turn negative and the logic that follows would be wrong.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-957",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Lucene RAM Directory doesn't work for Index Size > 8 GB",
    "systemSpecification": true,
    "version": ""
}