{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "bq. Maybe before this issue we should remove the Term class completely.\n\nSounds great... but there is a lot of code (eg in contrib, Solr) to fix if you want to do this.\nI guess when i considered this option, i thought it was gonna be a ton of work.",
            "date": "2010-07-18T11:31:01.289+0000",
            "id": 0
        },
        {
            "author": "Shai Erera",
            "body": "Why remove Term? I think it's a nice API, and for most cases, a term will still be a Term and not a BytesRef + Field. Isn't it a convenient class? Is there an alternative one?",
            "date": "2010-07-18T11:38:07.301+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "bq. I think it's a nice API, and for most cases, a term will still be a Term and not a BytesRef + Field\n\nEven if a term is a Term, a Term now is always a BytesRef + field behind the scenes anyway.\n\nbq. Isn't it a convenient class?\n\nBasically, this is why i didnt go this route of removing it (instead modifying Term class to work with bytesref).\nThe problem I saw was: if we have to modify tons of code to get rid of it, so would users too on upgrading.\n",
            "date": "2010-07-18T11:57:51.398+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "I think the discussion about Term removal is not really related to this issue. Removing Term would only have the big advantage that we don't suddenly change Term to no longer intern() the field name and so maybe code outside Lucene using Terms and relying on the fact that the term field name is interned, may break. Removal of intern() must then be clearly noted in migration.",
            "date": "2010-07-18T12:12:25.117+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "Uwe, but removing intern() from Term is almost just as bad as removing Term, because we at least have to review all uses (e.g. Solr) and see if it would cause incorrect code (e.g. == comparison that is suddenly wrong) or performance problems in containers sorting terms or anything of the like?\n\nAgain, I don't personally have an opinion either way, I just mentioned why I didn't remove it, its like Token, still lots of code using it :) \n",
            "date": "2010-07-18T12:27:47.893+0000",
            "id": 4
        },
        {
            "author": "Shai Erera",
            "body": "I agree. Term is frequently used (at least in our apps) and the wrapping around BytesRef is nice too. One can still call text() or the like and get the string rep. of it which in most cases is what you put there in the first place.\n\nAnd I also agree about stopping interning field suddenly. What is the reason for stop doing that?",
            "date": "2010-07-18T17:11:46.718+0000",
            "id": 5
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. And I also agree about stopping interning field suddenly. What is the reason for stop doing that?\n\nI don't understand the question.\n\nThe reason for removing interning is to remove the cost of doing this without need in trunk. The interning was solely done for speeding up typical TermEnum iteration where each term's field need to be compared to detect a change. As fields are now no longer coupled to terms and Term*s*Enums (TermEnum was removed) only iterate over one field, this is useless and the cost for creating terms does no retify to keep it.",
            "date": "2010-07-18T18:01:00.371+0000",
            "id": 6
        },
        {
            "author": "Shai Erera",
            "body": "Ohh, I see. I don't remember if I ever relied on interning for other purposes, but if that's the only reason, then I agree there's no point in interning anymore. But perhaps we should allow that through another API, in case someone relies on it elsewhere?",
            "date": "2010-07-19T04:55:55.126+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "after seeing LUCENE-3105, i think we should take steps to remove this interning.\n\nit looks like this can probably be done safely, according to http://www.cs.umd.edu/~jfoster/papers/issre04.pdf , findbugs, PMD, and JLint all support looking for string equality with == or !=, so we should be able to review all occurrences.",
            "date": "2011-05-16T22:39:55.245+0000",
            "id": 8
        },
        {
            "author": "Michael McCandless",
            "body": "Initial patch.\n\nTests are passing, at least a few iterations (I'll beast it).  There are still a few nocommits...\n\nI used PMD and findbugs to find == and != on strings, but surprisingly there are cases that these tools seem to miss.  I also did various greps to try to find cases... but I'm sure I've missed some!",
            "date": "2011-06-20T15:01:17.135+0000",
            "id": 9
        },
        {
            "author": "Robert Muir",
            "body": "is there any reason to keep Term.createTerm() after we do this? seems useless after interning is removed.",
            "date": "2011-06-20T16:00:01.169+0000",
            "id": 10
        },
        {
            "author": "Michael McCandless",
            "body": "I agree -- I removed createTerm!\n\nAnd fixed the nocommits....\n\nBeast chewed on this for a while and didn't hit any failures except various Solr tests that still intermittently fail... I think it's ready!",
            "date": "2011-06-20T19:27:39.733+0000",
            "id": 11
        },
        {
            "author": "Uwe Schindler",
            "body": "Yupee Juhee. I was on business trip whole day. Insane! Will review soon!",
            "date": "2011-06-20T19:36:50.385+0000",
            "id": 12
        },
        {
            "author": "Uwe Schindler",
            "body": "Hi Mike,\n\npatch looks great, thanks for doing this hard work :-) PreFlexCodec looks fine, see no problems there. Lucene code iterating TermsEnums was successfully cleaned up (the lovely MTQs) from T.createTerm and equals added at some places.\n\nI cannot check if there are comparisons missing, I wonder why PMD/Findbugs has bugs that it does not find all occurences, maybe because some SuppressWarnings also hiding those occurences? Can you explain shortly what \"Unable to render embedded object: File\" has to do with interning?\n\nSolr code is fine, I expected more to change. Some places in Solr still seems to use some \"placeholder\" terms (called idTerm and other names). We should maybe check if they are only field names in reality?\n\nGREAT WORK! I AM SO HAPPY, dumdidumm...!",
            "date": "2011-06-20T20:56:49.275+0000",
            "id": 13
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. Can you explain shortly what \"Unable to render embedded object: File\" has to do with interning?\n\nThat was just a JIRA formatting issue in Mike's comment I was referring to.",
            "date": "2011-06-20T21:41:31.391+0000",
            "id": 14
        },
        {
            "author": "Michael McCandless",
            "body": "Woops -- my comment was just saying that both == and ! = cases weren't always caught by PMD/findbugs.  But maybe I somehow messed up running them!",
            "date": "2011-06-20T21:44:50.019+0000",
            "id": 15
        },
        {
            "author": "Michael McCandless",
            "body": "Committed!  Uwe, I think I fixed all the places where we were making a placeholder term just to hold a field...",
            "date": "2011-06-21T15:43:19.965+0000",
            "id": 16
        }
    ],
    "component": "",
    "description": "In previous versions of Lucene, interning of fields was important to minimize string comparison cost when iterating TermEnums, to detect changes in field name. As we separated field names from terms in flex, no query compares field names anymore, so the whole performance problematic interning can be removed. I will start with doing this, but we need to carefully review some places e.g. in preflex codec.\n\nMaybe before this issue we should remove the Term class completely. :-) Robert?",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2548",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Remove all interning of field names from flex API",
    "systemSpecification": true,
    "version": ""
}