{
    "comments": [
        {
            "author": "Grant Ingersoll",
            "body": " Removed all deprecated methods/classes/tests/files.  I know the paint isn't dry on 1.9, but thought I would get a leap on 2.0...\n\nOther notes:\n\n1. Analyzer.java -- Made the tokenStream(String, Reader) into an abstract method.\n\n2. Some items that were marked as deprecated actually needed a reduction in visibility from public to private, and the getter/setters referenced instead\n\n3. All tests pass.\n\n4. Removed test-deprecated.\n\n5. The file deprecation-notes.txt are most likely included in the patch, but they can be deleted, as this comment is more recent.\n\n6.  I _did not_ review the documentation (i.e. javadocs, demo/tutorial, etc.) to look for references to deprecated items\n\nLet me know if there is anything else that is needed.\n\n-Grant",
            "date": "2006-02-26T07:35:31.000+0000",
            "id": 0
        },
        {
            "author": "Doug Cutting",
            "body": "+1\n\nThis looks like a good start towards 2.0.",
            "date": "2006-03-02T05:54:08.000+0000",
            "id": 1
        },
        {
            "author": "Daniel Naber",
            "body": "DateField should not be removed, as that would mean people cannot easily access date values created with Lucene 1.4. I know the fact that it's deprecated is strange, but I didn't know how else to draw people's attention to the fact that they should (not must) use DateTools.\n",
            "date": "2006-03-03T04:35:55.000+0000",
            "id": 2
        },
        {
            "author": "Grant Ingersoll",
            "body": "Does that mean, then, that the usages of it in the QueryParser and the DateFilter need to be preserved as well?  Doesn't that mean that anyone using the QP to do range queries will need their index to be created using DateField instead of DateTools?\n\nIs there a way we can make DateTools be backward compatible to DateField when appropriate?  So that we could still remove DateField?",
            "date": "2006-03-03T21:25:18.000+0000",
            "id": 3
        },
        {
            "author": "Daniel Naber",
            "body": "Answer to the first questions: yes and yes. DateTools could be made to read the old values transparently. Also the method to create the old format strings could be moved to DateTools, but the comment in DateField actually says that the class will not be removed.",
            "date": "2006-03-05T08:17:02.000+0000",
            "id": 4
        },
        {
            "author": "Grant Ingersoll",
            "body": "OK, but then what is the plan for generating Range Queries in the QueryParser for those indexes that use DateTools instead?  Or is it not an issue?",
            "date": "2006-03-05T22:30:39.000+0000",
            "id": 5
        },
        {
            "author": "Daniel Naber",
            "body": "I have no plan to fix this, because I consider this a rather exotic feature and because it should not be difficult to extend QueryParser so that it supports the new format. If you know an elegant solution, patches are welcome.",
            "date": "2006-03-06T01:31:48.000+0000",
            "id": 6
        },
        {
            "author": "Grant Ingersoll",
            "body": "I am not sure what the implications of not changing it are.  Are Query Parser generated Range Queries really that exotic?   \n\nI am more than happy to roll back the involved code, but I am not sure if that is the right thing to do.   I know we have a large install base, but it seems to me that people understand that a major revision (i.e moving from 1.x to 2.x) is going to result in some things breaking and that, if they want to upgrade to 2.0, then they will have to do some more work.\n\nAt any rate, I will take another look at the code involved and see if I have any bright ideas for how to deal with it.",
            "date": "2006-03-07T06:17:54.000+0000",
            "id": 7
        },
        {
            "author": "Daniel Naber",
            "body": "RangeQueries built via QueryParser are probably common, but not necessarily those that parse the local date format to a DateField, and only these are affected. I'm not sure what to do either, but we can read old index files so we somehow need to make sure the data in the old format can still be interpreted.\n",
            "date": "2006-03-07T06:36:56.000+0000",
            "id": 8
        },
        {
            "author": "Grant Ingersoll",
            "body": "What can I do to move this forward?",
            "date": "2006-03-14T22:56:12.000+0000",
            "id": 9
        },
        {
            "author": "Yonik Seeley",
            "body": "My take is that QueryParser should have never attempted to guess the type of the field.\nIt creates errors when you query on something that looks like a date, but isn't indexed using DateField or DateTools.\n\nI guess we still need to make a choice on whether breaking the QueryParser compatability is OK or not for 2.0",
            "date": "2006-03-17T01:54:26.000+0000",
            "id": 10
        },
        {
            "author": "Doug Cutting",
            "body": "I think we should commit this, except leave DateField deprecated rather than remove it, since that is the promise made.  We should probably remove that promise, however, so that we can eventually remove it.\n\nWe said we'd remove all deprecated code, and we won't.  But that won't break anyone who compiles in 1.9.1 without deprecation warnings, which is the more important promise.\n\nThen we'll have a proto-2.0 release for developers to test.  We can separately decide how to handle dates in the QueryParser.  It would not be wrong to continue doing the same thing we've done in 1.9, would it?  That won't break anyone.\n\nIn short, let's not let this issue stop us from removing all of the other deprecated code and finding out whether anything else breaks.\n",
            "date": "2006-03-17T02:14:16.000+0000",
            "id": 11
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Grant, it looks like we have a good plan for going forward.\nCan you/do you want to submit a new patch, or should I try to modify the original one?\n",
            "date": "2006-03-17T08:06:27.000+0000",
            "id": 12
        },
        {
            "author": "Grant Ingersoll",
            "body": "OK, here is the update.  I restored DateField (so it is not removed in the patch) and it's usage in QueryParser. \n\nI did _not_ restore it's usage anywhere else outside of QP and it's Test.\n\nAll tests pass.",
            "date": "2006-03-19T06:30:07.000+0000",
            "id": 13
        },
        {
            "author": "Yonik Seeley",
            "body": "Patch applied, thanks Grant!\n\nNote: for some reason, I couldn't get the patch to apply cleanly to files being removed.  I removed those by hand.",
            "date": "2006-03-21T23:38:00.000+0000",
            "id": 14
        },
        {
            "author": "Yonik Seeley",
            "body": "Looks like there are still some things in contrib that use deprecated stuff... I'll look into it.\n",
            "date": "2006-03-21T23:43:34.000+0000",
            "id": 15
        },
        {
            "author": "Yonik Seeley",
            "body": "OK, I think I got all of the deprecation related failures in \"ant test-contrib\".\nIt's tough to tell for sure since there are many other types of failures in test-contrib.",
            "date": "2006-03-22T01:04:16.000+0000",
            "id": 16
        },
        {
            "author": "Daniel Naber",
            "body": "Did files like DateFilter really get removed? On my local checkout DateFilter.java is now an empty file. ViewCVS on the web also still shows the file. Or is that expected behavior with subversion?\n",
            "date": "2006-03-22T05:08:49.000+0000",
            "id": 17
        },
        {
            "author": "Yonik Seeley",
            "body": "OK, I removed the zero length files.\nShould should the empty src/test-deprecated directory hierarchy also be removed, or should it be left in place when other tests become deprecated?",
            "date": "2006-03-22T05:21:53.000+0000",
            "id": 18
        },
        {
            "author": "Doug Cutting",
            "body": "+1 for removing the empty directory.  It can always be recreated if it is needed again.",
            "date": "2006-03-22T05:43:15.000+0000",
            "id": 19
        },
        {
            "author": "Daniel Naber",
            "body": "It seems QueryParser.java has been patched, but not QueryParser.jj.\n",
            "date": "2006-03-22T06:47:34.000+0000",
            "id": 20
        },
        {
            "author": "Yonik Seeley",
            "body": "Good catch Daniel... I'll try and get to it later tonight.",
            "date": "2006-03-22T07:28:48.000+0000",
            "id": 21
        },
        {
            "author": "Paul Elschot",
            "body": "Here, at revision 387786, the target common.compile-test fails because a few previously deprecated methods\nare still being used in test code (Field creation and BooleanQuery.add() in TestKipping* and TestRewriting).\nIs there someone looking into this, or shall I provide a patch?\n\n\n",
            "date": "2006-03-22T16:10:11.000+0000",
            "id": 22
        },
        {
            "author": "Paul Elschot",
            "body": "Oops, I checked svn status for the test code, and the two tests that cause these compiler errors\nnever made it into the trunk, so please ignore this.",
            "date": "2006-03-22T16:21:16.000+0000",
            "id": 23
        },
        {
            "author": "Yonik Seeley",
            "body": "Closing... I think we pretty much covered this.",
            "date": "2006-04-07T01:33:56.000+0000",
            "id": 24
        }
    ],
    "component": "",
    "description": "Per the move to Lucene 2.0 from 1.9, remove all deprecated code and update documentation, etc.\n\nPatch to follow shortly.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-500",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Lucene 2.0 requirements - Remove all deprecated code",
    "systemSpecification": false,
    "version": "1.9"
}