{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Patch.\n\nI ran quick perf test -- single pass was ~18% faster than two-pass (using cache).  Not as much as I expected... but every bit counts!",
            "date": "2011-05-22T12:32:29.143+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "That patch also requires you first apply LUCENE-3112.",
            "date": "2011-05-22T12:32:48.105+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "\nNew patch attached; I think it's ready to commit.\n\nI changed the approach, poaching an improvement from nested docs\n(LUCENE-2454): instead of pulling a DocTermsIndex from the field\ncache, and detecting new group by changing ord, I require the app\nprovides a Filter to denote the transition between groups.\n\nNot only is this better because it uses far less RAM, it's also more\ngeneral than the 2-pass collector in that the app is free to\narbitrarily set the groups by indexing the right doc blocks.  All\nthat's necessary is the app has some way to create the Filter noting\nthe last doc in each group.  It need not be a \"single valued indexed\nfield\"...\n\nPerformance is good ~ 25-28% faster than the two-pass collector with\ncaching.\n",
            "date": "2011-05-25T12:29:43.887+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "New patch with small changes: renamed to BlockGroupingCollector, fixed it to set the totalGroupCount in the returned TopGroups, removed some dead code and shuffled some params from ctor -> getTopGroups.\n\nI'll commit shortly...",
            "date": "2011-06-02T16:40:16.950+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "Bulk closing for 3.2",
            "date": "2011-06-03T16:37:21.076+0000",
            "id": 4
        }
    ],
    "component": "modules/grouping",
    "description": "LUCENE-3112 enables adding/updating a contiguous block of documents to\nthe index, guaranteed (yet, experimental!) to retain adjacent docID\nassignment through the full life of the index as long the app doesn't\ndelete individual docs from the block.\n\nWhen an app does this, it can enable neat features like LUCENE-2454\n(nested documents), post-group facet counting (LUCENE-3097).\n\nIt also makes single-pass grouping possible, when you group by\nthe \"identifier\" field shared by the doc block, since we know we will\nsee a given group only once with all of its docs within one block.\n\nThis should be faster than the fully general two-pass collectors we\nalready have.\n\nI'm working on a patch but not quite there yet...\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3129",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Single-pass grouping collector based on doc blocks",
    "systemSpecification": true,
    "version": ""
}