{
    "comments": [
        {
            "author": "Karl Wettin",
            "body": "I propose for this patch to be included in Lucene 3.0.0 (3.0.1?)\n",
            "date": "2008-04-01T12:31:41.813+0000",
            "id": 0
        },
        {
            "author": "Grant Ingersoll",
            "body": "Karl,\n\nThis is marked as 2.4, but your comment suggests 3.0.  Which do you prefer?  We are, again, in that tricky spot of how to handle changes where the API is compatible, but the index can change.\n\nOne thing to check, maybe, is how many terms are going to be affected?   Maybe we put this in now and we mark it in CHANGES.txt that users of Snowball will need to re-index, or at least thoroughly test to see if there are any issues in their setup.  \n\nI can go either way.",
            "date": "2008-08-19T14:46:12.232+0000",
            "id": 1
        },
        {
            "author": "Karl Wettin",
            "body": "I can try to trace the changes of the snowball code, but probably not anytime soon. That could be one reason to wait for 3.0. I also think that people are more likely to check for changes when they switch to 3.0 than when upgrading to 2.4. ",
            "date": "2008-08-19T16:07:28.939+0000",
            "id": 2
        },
        {
            "author": "Grant Ingersoll",
            "body": "One other thought on this, and I think it is consistent w/ how we've handled other token changes is to do the upgrade, mark it in the CHANGES.txt clearly per the http://wiki.apache.org/lucene-java/BackwardsCompatibility and to also note that to retain the old behavior, one needs to drop in the old jars.  \n\nCould this work?  I haven't tried it, but it seems like it could, except for your one comment above about the use of reflection.  Of course, there may be a way around that too.\n\nAdditionally, we have an out in that the back compat. link above says:\n{quote}\n\"All contribs are not created equal.\"\n\nThe compatibility commitments of a contrib package can vary based on it's maturity and intended usage. The README.txt file for each contrib should identify it's approach to compatibility. If the README.txt file for a contrib package does not address it's backwards compatibility commitments users should assume it does not make any compatibility commitments. \n{quote}\n\nThus, I think we should include this for 2.4 and we should note it in CHANGES.txt and in the Snowball README.",
            "date": "2008-08-20T14:31:58.218+0000",
            "id": 3
        },
        {
            "author": "Karl Wettin",
            "body": " * Fixed some conflicts against trunk\n * Backwards compatibility messages\n\nThis is what I did with README:\n{noformat}\n+IMPORTANT NOTICE ON BACKWARDS COMPATIBILITY!\n+\n+An index created using the Snowball module in Lucene 2.3.2 and below\n+might not be compatible with the Snowball module in Lucene 2.4 or greater.\n+\n+For more information about this issue see:\n+https://issues.apache.org/jira/browse/LUCENE-1142\n{noformat}\n\nI also added this text the the package javadocs.\n\nAbout LUCENE-740, all changes in the patches of that issue originates from the Snowball repository and is thus also available in this patch.\n\nShould I go ahead and commit this for 2.4?",
            "date": "2008-08-23T16:58:02.841+0000",
            "id": 4
        },
        {
            "author": "Grant Ingersoll",
            "body": "+1\n\n\n\n--------------------------\nGrant Ingersoll\nhttp://www.lucidimagination.com\n\nLucene Helpful Hints:\nhttp://wiki.apache.org/lucene-java/BasicsOfPerformance\nhttp://wiki.apache.org/lucene-java/LuceneFAQ\n\n\n\n\n\n\n\n",
            "date": "2008-08-23T21:10:45.241+0000",
            "id": 5
        },
        {
            "author": "Karl Wettin",
            "body": "Committed in rev 688420",
            "date": "2008-08-23T22:05:39.266+0000",
            "id": 6
        },
        {
            "author": "Yonik Seeley",
            "body": "I just tried updating Solr... I guess this isn't so backward compatible (code-wise) because of the package change?\n{code}\n    [javac] f:\\code\\solr\\src\\java\\org\\apache\\solr\\analysis\\EnglishPorterFilterFactory.java:78: package net.sf.snowball.ext does not exist\n    [javac]   private net.sf.snowball.ext.EnglishStemmer stemmer;\n{code}\n\nOh, nevermind... SnowballFilter should be the public interface that this is accessed through.",
            "date": "2008-08-27T14:46:58.321+0000",
            "id": 7
        }
    ],
    "component": "modules/analysis",
    "description": "Updated Snowball contrib package\n\n * New org.tartarus.snowball java package with patched SnowballProgram to be abstract to avoid using reflection.\n * Introducing Hungarian, Turkish and Romanian stemmers\n * Introducing constructor SnowballFilter(SnowballProgram)\n\nIt is possible there have been some changes made to the some of there stemmer algorithms between this patch and the current SVN trunk of Lucene, an index might thus not be compatible with new stemmers!\n\nThe API is backwards compatibile and the test pass.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-1142",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Updated Snowball package",
    "systemSpecification": true,
    "version": ""
}