{
    "comments": [
        {
            "author": "Grant Ingersoll",
            "body": "Not sure why this is different then anywhere else IndexInput.clone() is used, can you provide more details?  Isn't the whole point of cloning to make it thread safe (which is why it is stored in the ThreadLocal)",
            "date": "2006-10-19T17:29:29.000+0000",
            "id": 0
        },
        {
            "author": "Yonik Seeley",
            "body": "It seems to me like if you clone an object in an unknown state, you get another object in an unknown state unless it's clone() is able to explicitly put it back into a known state.\n\nLet's take TermDocs as an example of why it's use is OK:\nSegmentTermDocs() *always* makes a clone of the SegmentReader's freqStream, and the SegmentReader itself never directly uses the freqStream (and hence freqStream is used for nothing other than cloneing).  \nThis analysis only takes into account SegmentTermDocs and SegmentReader... if there is another class that directly uses SegmentReader.freqStream, then all bets are off again.\n\nI don't know if all other clones() of IndexInput are safe, but it does seem like LazyField's use is unsafe.",
            "date": "2006-10-19T17:44:08.000+0000",
            "id": 1
        },
        {
            "author": "Grant Ingersoll",
            "body": "Defnitely an issue for a closed IndexInput, but that has been discussed elsewhere and there isn't really anything satisfying to say there other than it is undeclared what will happen (although my tests on local Directories indicate that it is \"safe\" in a simple environment).\n\nOtherwise,  my understanding is that the seek() call before reading should put it into a known state, but I am guessing your not so sure on that point.  So the question is seek() sufficient to put an IndexInput into a known safe state, right?\n\nIf it doesn't, what would you suggest for a fix?  I suppose maybe you could clone it as you create the LazyField (which would put it in right at the correct position and there would be no need to seek, right)  This would save a little time at the tradeoff of memory, right?",
            "date": "2006-10-19T18:12:37.000+0000",
            "id": 2
        },
        {
            "author": "Grant Ingersoll",
            "body": "Comment from Hoss, which I think should be on the issue:\n\n: Otherwise, my understanding is that the seek() call before reading\n: should put it into a known state, but I am guessing your not so sure on\n: that point.  So the question is seek() sufficient to put an IndexInput\n: into a known safe state, right?\n\nisn't it more subtle then that? ... IndexInput.clone() states that the\nclone will be \"positioned at the same point as the stream they were cloned\nfrom\" ... that implies that the clone will be in a consistent usable state\neven with the client calling seek on the clone() .... is that\ninvarient currently met by BufferedIndexInput in a multithreaded case?\n\n\n\n\n-Hoss\n",
            "date": "2006-10-19T18:59:36.000+0000",
            "id": 3
        },
        {
            "author": "Grant Ingersoll",
            "body": "Possibly reading wrong, but it seems like that invariant is not met by BufferedIndexInput, right?\n\nIf clone was called while the IndexInput was in the refill() operation before readInternal() was called but after the buffer was allocated (i.e. line 64) and then clone finished it would copy an empty buffer on line 103, right?  This would be bad, b/c I don't see that it could recover from an empty buffer there when it thinks it has data.\n\nSo, I guess that would argue that it is not safe and that we should aggressively clone (b/c we know it is in a good state) or that we should synchronize, right? \n\n",
            "date": "2006-10-19T19:21:00.000+0000",
            "id": 4
        },
        {
            "author": "Yonik Seeley",
            "body": ": If clone was called while the IndexInput was in the refill() operation before readInternal() was called but after the buffer was allocated (i.e. line 64) and then clone finished it would copy an empty buffer on line 103, right?\n\nCorrect.  BufferedIndexInput also has multiple \"pointers\", and in the absense of synchronization, you can't guarantee the order that things will be flushed back to memory.\n\n: So, I guess that would argue that it is not safe and that we should aggressively clone (b/c we know it is in a good state) or that we should synchronize, right?\n\nRight, you either never use what you are cloning, or you synchronize.\n",
            "date": "2006-10-19T19:25:14.000+0000",
            "id": 5
        },
        {
            "author": "Yonik Seeley",
            "body": "On 10/19/06, Ning Li <ning.li.li@gmail.com> wrote:\n> What makes, for example, FSIndexInput and its clones, thread-safe is\n> the following.\n> That is, the method is synchronized on the file object.\n> \n>   protected void readInternal(byte[] b, int offset, int len)\n>        throws IOException {\n>     synchronized (file) {\n\nI don't think that's sufficient in part because the IndexInput's state is manipulated outside that sync block.  The sync block is to protect the file only, not the IndexInput, which isn't thread-safe (by design).\n\nLook at BufferedIndexInput.seek() and BufferedIndexInput.refill()\n",
            "date": "2006-10-19T19:32:29.000+0000",
            "id": 6
        },
        {
            "author": "Grant Ingersoll",
            "body": "Do you have a preference on aggressive cloning vs. synching?  cloning is easier to implement, but then the Field is no longer as lazy as it could be, on the other hand synching on the fieldsStream in LazyField and doc() could be pretty expensive, too, right?\n",
            "date": "2006-10-19T19:49:14.000+0000",
            "id": 7
        },
        {
            "author": "Yonik Seeley",
            "body": "Here's one possible patch... not sure if it's the best approach or not.",
            "date": "2006-10-19T20:18:00.000+0000",
            "id": 8
        },
        {
            "author": "Yonik Seeley",
            "body": "> Do you have a preference on aggressive cloning vs. synching?\n\nNot too much... synching was presumably avoided for better concurrency.  If we wanted to sync in LazyField, it would currently need to be on the SegmentReader object, since that's the monitor protecting the fieldStream.\n\nCould also perhaps lazily create the \"cloneable stream\"  the first time a lazy field is created, since we are currently in a synchronized context when that happens.\n\nA different route would be to convert normal document() loading to also use thread-local fieldStreams for better concurrency.  It would mean a thread-local lookup per document though, and I'm not sure what the expense of that would be.",
            "date": "2006-10-19T20:27:01.000+0000",
            "id": 9
        },
        {
            "author": "Grant Ingersoll",
            "body": "Patch seems reasonable, and your idea of waiting till we have a lazy field before cloning seems reasonable, as my guess is, at least for now, that Lazy Fields are not in widespread use just yet.",
            "date": "2006-10-19T20:35:47.000+0000",
            "id": 10
        },
        {
            "author": "Paul Elschot",
            "body": "I have not followed this, but some time ago I've had a problem with cloning and BufferedIndexInput, see LUCENE-430.\nSearching jira for BufferedIndexInput gives 5 hits currently.\n\nRegards,\nPaul Elschot",
            "date": "2006-10-19T21:18:42.000+0000",
            "id": 11
        },
        {
            "author": "Yonik Seeley",
            "body": "OK, I committed this fix for now.\nFor BufferedIndexInput, the buffer is allocated lazily, so the extra clone doesn't use much space.",
            "date": "2006-10-20T03:07:53.000+0000",
            "id": 12
        },
        {
            "author": "Yonik Seeley",
            "body": "OK, this problem is no longer hypothetical!\nI was able to produce a test that failed quickly most of the time w/o the patch.\nI've just committed it.",
            "date": "2006-10-20T05:10:35.000+0000",
            "id": 13
        },
        {
            "author": "Michael McCandless",
            "body": "Closing all issues that were resolved for 2.1.",
            "date": "2007-02-27T18:10:35.348+0000",
            "id": 14
        }
    ],
    "component": "core/store",
    "description": "Hypothetical problem: IndexInput.clone() of an active IndexInput could result in a corrupt copy.\nLazyField clones the FieldsReader.fieldsStream, which could be in use via IndexReader.document()",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-690",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "LazyField use of IndexInput not thread safe",
    "systemSpecification": true,
    "version": "2.1"
}