{
    "comments": [
        {
            "author": "Shai Erera",
            "body": "I am not sure we should mark getFileLength deprecated though, in order to alert users that it will become abstract. Can we instead just note that in its Javadocs? It will be awkward if we deprecate both fileLength and getFileLength :).",
            "date": "2010-03-13T14:12:04.452+0000",
            "id": 0
        },
        {
            "author": "Marvin Humphrey",
            "body": "Is it really necessary to obtain the length of a file from the Directory? Lucy\ndoesn't implement that functionality, and we haven't missed it -- we're able\nto get away with using the length() method on InStream and OutStream. \n\nI see that IndexInput and IndexOutput already have length() methods. Can you\nsimply eliminate all uses of Directory.fileLength() within core and deprecate\nit without introducing a new method?",
            "date": "2010-03-13T15:49:24.989+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "I don't think Lucene relies on file length; we do use it for diagnostics/logging (eg IW's infoStream).\n\nHmm I guess we do use it for merging purposes (LogByteSizeMergePolicy), where we try to merge roughly similarly sized (by net size in bytes) segments.\n\nI would rather not increase our reliance on it (eg LUCENE-2373 proposes to do so) -- it's a piece of metadata that is sometimes (eg over NFS) less reliable than file contents.  The less we rely on from the filesystem the more robust/portable Lucene will be...\n\nNet/net I think we should keep the method, but restrict our use of it.\n\nI do think we should move to throwing FNFE if the file does not exist... though I think a break in back compat may be OK, here?  (Vs do the new method/deprecated/abstract approach).",
            "date": "2010-04-11T15:01:26.818+0000",
            "id": 2
        },
        {
            "author": "Earwin Burrfoot",
            "body": "I like Marvin's suggestion - deprecate/delete Dir.fileLength, and rely on InStream.length if needed (I believe if we actually open the file for reading, NFS gives us the correct length?).\nIf not - throw FNFE, and go for backcompat break instead of new/deprecate cycle.",
            "date": "2010-04-11T22:38:21.947+0000",
            "id": 3
        },
        {
            "author": "Shai Erera",
            "body": "Well ... dir.fileLength is also used by SegmentInfos.sizeInBytes to compute the size of all the files in the Directory. If we remove fileLength, then SI will need to call dir.openInput.length() and the close it? Seems like a lot of work to me, for just obtaining the length of the file. So I agree that if you have an IndexInput at hand, you should call its length() method rather than Dir.fileLength. But otherwise, if you just have a name at hand, a dir.fileLength is convenient?\n\nI'm also ok w/ the bw break rather than going through the new/deprecate cycle.",
            "date": "2010-04-12T07:28:25.227+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "bq. I'm also ok w/ the bw break rather than going through the new/deprecate cycle.\n\n+1\n\nI think we should keep both Dir.fileLength and II.fileLength.",
            "date": "2010-04-12T10:34:32.600+0000",
            "id": 5
        },
        {
            "author": "Shai Erera",
            "body": "Patch clarifies the contract, fixes the directories to adhere to it and adds a CHANGES under backwards section. All tests pass.",
            "date": "2010-04-13T16:15:18.844+0000",
            "id": 6
        },
        {
            "author": "Shai Erera",
            "body": "That's a fairly trivial patch, therefore I plan to commit tomorrow. Just FYI",
            "date": "2010-04-13T18:16:00.308+0000",
            "id": 7
        },
        {
            "author": "Shai Erera",
            "body": "Committed revision 933879.",
            "date": "2010-04-14T08:29:50.000+0000",
            "id": 8
        },
        {
            "author": "Shai Erera",
            "body": "backport to 3.1",
            "date": "2010-05-05T20:17:19.373+0000",
            "id": 9
        },
        {
            "author": "Shai Erera",
            "body": "Committed revision 941468.",
            "date": "2010-05-05T20:25:17.305+0000",
            "id": 10
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:49:53.676+0000",
            "id": 11
        }
    ],
    "component": "core/index",
    "description": "On this thread: http://mail-archives.apache.org/mod_mbox/lucene-java-dev/201003.mbox/%3C126142c1003121525v24499625u1589bbef4c0792e7@mail.gmail.com%3E it was mentioned that Directory's fileLength behavior is not consistent between Directory implementations if the given file name does not exist. FSDirectory returns a 0 length while RAMDirectory throws FNFE.\n\nThe problem is that the semantics of fileLength() are not defined. As proposed in the thread, we'll define the following semantics:\n\n* Returns the length of the file denoted by <code>name</code> if the file exists. The return value may be anything between 0 and Long.MAX_VALUE.\n* Throws FileNotFoundException if the file does not exist. Note that you can call dir.fileExists(name) if you are not sure whether the file exists or not.\n\nFor backwards we'll create a new method w/ clear semantics. Something like:\n\n{code}\n/**\n * @deprecated the method will become abstract when #fileLength(name) has been removed.\n */\npublic long getFileLength(String name) throws IOException {\n  long len = fileLength(name);\n  if (len == 0 && !fileExists(name)) {\n    throw new FileNotFoundException(name);\n  }\n  return len;\n}\n{code}\n\nThe first line just calls the current impl. If it throws exception for a non-existing file, we're ok. The second line verifies whether a 0 length is for an existing file or not and throws an exception appropriately.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2316",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Define clear semantics for Directory.fileLength",
    "systemSpecification": true,
    "version": ""
}