{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "attached is a patch.\n\nafter applying it run 'ant genrbbi', which compiles the rule tailorings to binary DFAs for faster loading.\nyou dont have to do this, e.g. if you want you can always create these from String, but this is much faster.\n",
            "date": "2010-04-22T20:54:40.666+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "attached is a patch with some suggestions from Uwe:\n* use reflection for the compiler instead of a regex-like tunnel\n* remove a unused variable in the tokenizer",
            "date": "2010-04-22T21:51:51.330+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Hi Robert,\n\nI attached a patch with almost everything unchanged, only two problems in build.xml and the rule compiler. This one did not work on my computer:\n- If the src dir is not found, File.listFiles() returns null, I added an IOException here\n- The above line NPE/IOExceptioned, because of spaces in file path. In general you should never use <arg line=\"...\"/> in ant execs, instead list parameters separately (this is also suggested by ANT docs). This will enable proper parameter escaping. We do this everywhere else in Lucene, but not in ICU.\n\nAll other files keep unchanged, tests pass after compiling the rule files.",
            "date": "2010-04-23T06:52:46.384+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Previous patch missed file additions.",
            "date": "2010-04-23T06:56:01.614+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "One more comment:\nThe abstract ICUTokenizerConfig is public, but only has package protected methods. So nobody can ever implement an own one. Abstract classes are different than interfaces, whose methods are always public (that the nature of interfaces).\nI would make the methods public, else the whole configuration makes no sense.\n\nI would also change the method name of getTokenizer() to getBreakIterator().",
            "date": "2010-04-23T09:45:04.999+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "ah thanks for finding these bugs Uwe. I'll upload a new patch.",
            "date": "2010-04-23T10:57:16.147+0000",
            "id": 5
        },
        {
            "author": "Robert Muir",
            "body": "updated patch with Uwe's comments addressed.\n",
            "date": "2010-04-24T14:42:02.517+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "Looks good! Will test again later!",
            "date": "2010-04-24T16:18:14.310+0000",
            "id": 7
        },
        {
            "author": "Uwe Schindler",
            "body": "Hi Robert,\n\nAll fine. No more problems found!",
            "date": "2010-04-25T15:40:52.613+0000",
            "id": 8
        },
        {
            "author": "Robert Muir",
            "body": "I added tests for offsets and type, added some docs to overview.html, \ncleared up javadocs warnings, and marked everything experimental (for now).\n\nI will commit in a few days unless there are any objections.",
            "date": "2010-05-01T12:10:16.053+0000",
            "id": 9
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 940447.",
            "date": "2010-05-03T13:21:27.684+0000",
            "id": 10
        },
        {
            "author": "Robert Muir",
            "body": "backported to 3x, revision 941706",
            "date": "2010-05-06T12:55:40.327+0000",
            "id": 11
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:50:23.660+0000",
            "id": 12
        }
    ],
    "component": "modules/other",
    "description": "I pulled out the last part of LUCENE-1488, the tokenizer itself and cleaned it up some.\n\nThe idea is simple:\n* First step is to divide text into writing system boundaries (scripts)\n* You supply an ICUTokenizerConfig (or just use the default) which lets you tailor segmentation on a per-writing system basis.\n* This tailoring can be any BreakIterator, so rule-based or dictionary-based or your own.\n\nThe default implementation (if you do not customize) is just to do UAX#29, but with tailorings for stuff with no clear word division:\n* Thai (uses dictionary-based word breaking)\n* Khmer, Myanmar, Lao (uses custom rules for syllabification)\n\nAdditionally as more of an example i have a tailoring for hebrew that treats the punctuation special. (People have asked before\nfor ways to make standardanalyzer treat dashes differently, etc)\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2414",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "add icu-based tokenizer for unicode text segmentation",
    "systemSpecification": true,
    "version": "3.1"
}