{
    "comments": [
        {
            "author": "Martijn van Groningen",
            "body": "Attached initial patch. IWC has the following added methods:\n{code}\nIWC.setOptimizeBytesDocValuesForSpeed(...)\nIWC.isOptimizeBytesDocValuesForSpeed()\n{code}",
            "date": "2011-10-23T20:29:20.241+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "I think it would be good to make the naming consistent with \"fasterButMoreRAM\" in fieldcache?",
            "date": "2011-10-23T20:42:14.248+0000",
            "id": 1
        },
        {
            "author": "Martijn van Groningen",
            "body": "For naming consistency that would be better, but this option is only for DV of type sorted bytes (BYTES_VAR_SORTED and BYTES_FIXED_SORTED).\nSo maybe something like \"sortedBytesDocValuesFasterButMoreRam\". I know it is a long name but it describes when the option is applicable. Or maybe just \"docValuesFasterButMoreRam\" but then the jdoc should clearly state that is only applicable for sorted bytes DV.",
            "date": "2011-10-23T21:05:16.327+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "well one thing that confuses me about the long name is, should it be in IndexWriterConfig at all? \n\nThe reason I say this, it seems to be very specific to a certain implementation of DV.\n\nFor example, this (expert) option doesnt make much sense if I make my own implementation of sortedbytes (maybe for SimpleText :P), that doesnt use packed integers.",
            "date": "2011-10-23T21:09:34.958+0000",
            "id": 3
        },
        {
            "author": "Martijn van Groningen",
            "body": "Maybe this makes sense IWC is high level. Maybe this should be just an option somewhere in IndexDocValues with the name \"fasterButMoreRAM\". If this option is set to true an implementation will choose performance over RAM. In the case that an implementation uses SimpleText this option wouldn't have an influence, but for packed integers it would have an influence.\n\nMaybe we should have IndexDocValuesConfig class for DV based settings. I can imagine that we will have more DV based settings in the future...",
            "date": "2011-10-23T21:27:04.335+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "well the same applies to having an IndexDocValuesConfig.\n\nIf my implementation doesn't use packed integers, it doesnt make a lot of sense?\n\nSo I think it would be best if this was only a parameter to this particular implementation... otherwise we end out with a ton of options across all possible implementations, which won't make a lot of sense at all.\n\nI think at the end of the day, we should imagine having tons of implementations for the different index parts (look how many term dictionaries we have), and let impls have their own parameters.\n\nIf someone wants to toggle these crazy parameters, thats something they can do in their codec definition. For solr users etc, thats something they can tweak in the xml on a per-implementation basis just like when they provide crazy parameters to various tokenfilters in their analysis chain.\n",
            "date": "2011-10-23T21:34:04.209+0000",
            "id": 5
        },
        {
            "author": "Martijn van Groningen",
            "body": "bq. So I think it would be best if this was only a parameter to this particular implementation... otherwise we end out with a ton of options across all possible implementations, which won't make a lot of sense at all.\nMakes sense if you write it down like that :)\n\nI think it should be an option inside DefaultDocValuesConsumer (since this creates the writer) that defaults to true and if users want to change this behaviour they will need to change their codec.",
            "date": "2011-10-23T22:13:18.819+0000",
            "id": 6
        },
        {
            "author": "Simon Willnauer",
            "body": "We should expose this via low level DocValues implementation and maybe not via IWC. I think a consistent way would be enableing this in MemoryCodec and use the more ram efficient variant by default. This is just like CFS which is disabled in SepCodec. ",
            "date": "2011-10-24T07:39:15.895+0000",
            "id": 7
        },
        {
            "author": "Michael McCandless",
            "body": "I think enabling at the codec impl level makes sense.\n\nBut I'd prefer to have the defaulting match what we do for FieldCache, ie default to \"fasterButMoreRAM\".",
            "date": "2011-10-24T12:48:52.062+0000",
            "id": 8
        },
        {
            "author": "Martijn van Groningen",
            "body": "I also prefer to have a default that matches with the FieldCache. I will change the patch so that the option is at the codec impl level (DefaultDocValuesConsumer).",
            "date": "2011-10-24T17:54:09.660+0000",
            "id": 9
        },
        {
            "author": "Martijn van Groningen",
            "body": "Updated the patch. The option with name \"sortedBytesFasterButMoreRam\" is now in DocValuesWriterBase class and defaults to true.",
            "date": "2011-10-25T19:38:15.704+0000",
            "id": 10
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. Updated the patch. The option with name \"sortedBytesFasterButMoreRam\" is now in DocValuesWriterBase class and defaults to true.\n\nit might make sense to give it a more general name since we use packed ints in various places? The question is if we want to use this option elsewhere... not sure though",
            "date": "2011-10-25T19:44:36.675+0000",
            "id": 11
        },
        {
            "author": "Martijn van Groningen",
            "body": "We currently only use it for types BYTES_VAR_SORTED and BYTES_FIXED_SORTED hence the name. I think we can use it for the other types as well. This option basically decides whether DirectInt or PacketInt is used (in PacketInt#getReader()). The DirectInt classes are faster for when using BYTES_VAR_SORTED and BYTES_FIXED_SORTED types. I'll try and test if this is also the case for for the other types (I think it will be faster for the other types as well).",
            "date": "2011-10-25T21:07:24.895+0000",
            "id": 12
        },
        {
            "author": "Michael McCandless",
            "body": "Maybe just packedIntsFasterButMoreRAM?",
            "date": "2011-10-26T11:19:22.874+0000",
            "id": 13
        },
        {
            "author": "Simon Willnauer",
            "body": "maybe just call it optimizeForSpeed or fasterButMoreRam or alignPackedInts?",
            "date": "2011-10-26T20:18:17.775+0000",
            "id": 14
        },
        {
            "author": "Martijn van Groningen",
            "body": "I think fasterButMoreRam is fine, since it is a dv codec parameter now.",
            "date": "2011-10-26T21:02:47.134+0000",
            "id": 15
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. I think fasterButMoreRam is fine, since it is a dv codec parameter now.\n+1 go ahead",
            "date": "2011-11-14T10:32:59.062+0000",
            "id": 16
        },
        {
            "author": "Martijn van Groningen",
            "body": "Updated the patch to the trunk. I think it is ready. For now this is only an optimization for doc values of type sorted bytes. I will commit this in the coming days if everyone is fine with it.",
            "date": "2011-12-23T13:19:06.993+0000",
            "id": 17
        },
        {
            "author": "Martijn van Groningen",
            "body": "Committed to trunk. ",
            "date": "2011-12-30T09:41:32.136+0000",
            "id": 18
        }
    ],
    "component": "core/index",
    "description": "spinnoff from LUCENE-3496 - we are seeing much better performance if required bits for PackedInts are rounded up to a 8/16/32/64. We should add this option to IWC and default to round up ie. more RAM & faster lookups.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3509",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Add settings to IWC to optimize IDV indices for CPU or RAM respectivly",
    "systemSpecification": true,
    "version": "4.0-ALPHA"
}