{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "I'd really like to commit these asserts, but this query is in the way.\n\nAs a temporary measure we can @Ignore its tests.",
            "date": "2012-01-25T13:33:56.174+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "Patch enabling the assertions, and disabling FieldMaskingSpanQuery's query tests unless the sim for the masked field is TFIDFSimilarity.\n\nI also changed the javadoc:\n{noformat}\n  * <p>Note: as {@link #getField()} returns the masked field, scoring will be \n- * done using the norms of the field name supplied. This may lead to unexpected\n- * scoring behaviour.</p>\n+ * done using the Similarity and collection statistics of the field name supplied,\n+ * but with the term statistics of the real field. This may lead to exceptions,\n+ * poor performance, and unexpected scoring behaviour.</p>\n  */\n{noformat}\n\nI think because this query doesn't really work except with certain scoring models, we should at least move it to contrib if we aren't going to fix its scoring or remove it.\n",
            "date": "2012-01-25T13:54:51.906+0000",
            "id": 1
        }
    ],
    "component": "",
    "description": "In Lucene 4.0 we added new scoring mechanisms, but FieldMaskingSpanQuery is a serious problem:\n\nBecause it lies about the fields of its terms, this sometimes results in totally bogus\nstatistics, cases where a single terms totalTermFreq exceeds sumTotalTermFreq for the entire field (since its lying about it).\n\nSuch lying could result in NaN/Inf/Negative scores, exceptions, divide by zero, and other problems,\nbecause the statistics are impossibly bogus.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3723",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Remove FieldMaskingSpanQuery (or fix its scoring)",
    "systemSpecification": true,
    "version": "4.0-ALPHA"
}