{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "+1",
            "date": "2010-02-04T10:20:32.414+0000",
            "id": 0
        },
        {
            "author": "Simon Willnauer",
            "body": "Uwe, as I already said while we where discussion this, I would add the version to LuceneTestCase (or equivalent for JU4)  and then we can do the tests in sub-issues which prevents those super huge patches.\n\nthoughts?!",
            "date": "2010-02-04T10:26:03.461+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Here my first patch. Please tell me which name for the static constant should be used, I use CURRENT_VERSION. Maybe something with \"test\" in it?\n\nI transformed TestCharArraySet as a demonstation.",
            "date": "2010-02-06T17:27:14.253+0000",
            "id": 2
        },
        {
            "author": "Simon Willnauer",
            "body": "Patch looks good uwe, I think we should reflect its purpose in the name maybe TEST_VERSION_LATEST or TEST_VERSION_CURRENT\n\nsimon ",
            "date": "2010-02-06T18:40:25.140+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Simon: I opened a sub-issue for contrib and assigned you to it!\n\nI will change to TEST_VERSION_CURRENT and then run eclipse to do the refactoring.",
            "date": "2010-02-06T18:54:16.640+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "Patch with updated constant name.\n\nSimon, if you like you can use it as basis and start with contrib. ",
            "date": "2010-02-06T18:57:31.098+0000",
            "id": 5
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. Simon, if you like you can use it as basis and start with contrib. \nwill do...",
            "date": "2010-02-06T19:00:03.808+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "Here the patch for all core tests.\n\nI also did a eclipse import cleanup to remove the unused Version imports. Now the code is also clean from a full-specified class name (o.a.l.util.Version.LUCENE_CURRENT), I introduced during my 3.0 refactoring (I did not add the import statements at this time).\n\nI would like to commit this soon, if nobody objects, because the patch could get out of sync very fast.",
            "date": "2010-02-08T12:40:18.581+0000",
            "id": 7
        },
        {
            "author": "Uwe Schindler",
            "body": "Updated patch, I missed some LUCENE_CURRENT occurences. Now all are catched and changed. My sed-command was wrong (missed to replace all occurences in one line) :-)\n\nAll test pass still. Will commit if nobody objects this evening.",
            "date": "2010-02-08T13:30:26.172+0000",
            "id": 8
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 908496",
            "date": "2010-02-10T13:36:35.418+0000",
            "id": 9
        },
        {
            "author": "Uwe Schindler",
            "body": "I forgot to add the latest patch.",
            "date": "2010-02-10T13:37:56.773+0000",
            "id": 10
        }
    ],
    "component": "core/index, core/other, core/query/scoring, core/queryparser, core/search, core/store, core/termvectors, general/javadocs, modules/analysis, modules/benchmark, modules/highlighter, modules/other, modules/spatial, modules/spellchecker",
    "description": "A lot of tests for the most-recent functionality in Lucene use Version.LUCENE_CURRENT, which is fine in trunk, as we use the most recent version without hassle and changing this in later versions.\n\nThe problem is, if we copy these tests to backwards branch after 3.1 is out and then start to improve analyzers, we then will have the maintenance hell for backwards tests. And we loose backward compatibility testing for older versions. If we would specify a specific version like LUCENE_31 in our tests, after moving to backwards they must work without any changes!\n\nTo not always modify all tests after a new version comes out (e.g. after switching to 3.2 dev), I propose to do the following:\n- declare a static final Version TEST_VERSION = Version.LUCENE_CURRENT (or better) Version.LUCENE_31 in LuceneTestCase(4J).\n- change all tests that use Version.LUCENE_CURRENT using eclipse refactor to use this constant and remove unneeded import statements.\n\nWhen we then move the tests to backward we must only change one line, depending on how we define this constant:\n- If in trunk LuceneTestCase it's Version.LUCENE_CURRENT, we just change the backwards branch to use the version numer of the released thing.\n- If trunk already uses the LUCENE_31 constant (I prefer this), we do not need to change backwards, but instead when switching version numbers we just move trunk forward to the next major version (after added to Version enum).",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2248",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Tests using Version.LUCENE_CURRENT will produce problems in backwards branch, when development for 3.2 starts",
    "systemSpecification": true,
    "version": ""
}