{
    "comments": [
        {
            "author": "Ryan McKinley",
            "body": "If we chance the jar file names from -dev to -SNAPSHOT, the same build can be easily integrated with a maven snapshot repository (and tested -- LUCENE-2268).\n\nI'd like to avoid a discussion about the odities of maven, but lets just take as a given that if the artifact is named \"-SNAPSHOT\" then eveytime you use it, it makes sure it is the most recent version.  To be able to test (or have a real SNAPSHOT repository) we will either have to:\n  1. rename the .jar to -SNAPSHOT\n  2. run ant twice, once with the current -dev settings, then again with -Ddev.verrsion=4.0-SNAPSHOT\n\nIn my book, the aesthetic loss of \"-dev\" is worth the gain to let the maven community use (and test!) snapshot builds.  This also greatly simplifies building a test case for our maven files (LUCENE-2268)\n\nThoughts?  Objections?  \n\n",
            "date": "2010-09-20T03:56:53.028+0000",
            "id": 0
        },
        {
            "author": "David Smiley",
            "body": "Of course we should do this.  I've had to do this on my end with that -Ddev.verrsion=4.0-SNAPSHOT trick in the mean time.",
            "date": "2010-09-20T15:09:37.387+0000",
            "id": 1
        },
        {
            "author": "Ryan McKinley",
            "body": "added to /trunk and 3.x\n\nnothing in CHANGES.txt since it does not affect releases at all",
            "date": "2010-09-24T06:27:38.589+0000",
            "id": 2
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:50:13.037+0000",
            "id": 3
        }
    ],
    "component": "",
    "description": "Currently the lucene dev jar files end with '-dev.jar' this is all fine, but it makes people using maven jump through a few hoops to get the -SNAPSHOT naming convention required by maven.  If we want to publish snapshot builds with hudson, we would need to either write some crazy scripts or run the build twice.\n\nI suggest we switch to -SNAPSHOT.jar.  Hopefully for the 3.x branch and for the /trunk (4.x) branch",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2493",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Rename lucene/solr dev jar files to -SNAPSHOT.jar",
    "systemSpecification": true,
    "version": ""
}