{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "This class is used internally only. There is no need for hashCode(), the equals is only needed for TeeSinkTokenStream, that compares the attribute factories. Normally, factories are singletons, but this special case needs the extra equals check because two wrapper factories are equal if the inner delegate is equal.",
            "date": "2009-08-20T22:05:27.994+0000",
            "id": 0
        },
        {
            "author": "Mark Miller",
            "body": "I disagree - whatever a classes original intent, its good style to follow the contract. We can't predicate the future evolution of these classes.\n\nAt a minimum they should return a constant hashCode ie 42",
            "date": "2009-08-20T22:09:22.070+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "I implemented the two hashCodes. The wrapper returns the hashcode of the delegate and the other one the filter's hashCode. I commit shortly.",
            "date": "2009-08-20T22:13:05.046+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "I will commit this shortly.",
            "date": "2009-08-20T22:16:35.115+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Forgot a static xor for a difference in hashCode.",
            "date": "2009-08-20T22:19:59.829+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed rev 806381",
            "date": "2009-08-20T22:24:48.244+0000",
            "id": 5
        }
    ],
    "component": "modules/analysis",
    "description": "its part of the contract of Object \n\nbq. If two objects are equal according to the equals(Object) method, then calling the hashCode method on each of the two objects must produce the same integer result.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1831",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "TokenWrapperAttributeFactory, CachingWrapperFilterHelper implements equals and so should also implement hashCode",
    "systemSpecification": true,
    "version": ""
}