{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Patch.\n\nI also fixed a concurrency issue with MockDirWrapper, and an intermittent failure in TestCachingWrapper/SpanFilter.\n",
            "date": "2010-11-13T18:42:14.284+0000",
            "id": 0
        },
        {
            "author": "Jason Rutherglen",
            "body": "RT's usage of doc stores, ie, reading from them while they're still being written to will likely break this.",
            "date": "2010-11-14T22:06:15.474+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "bq. RT's usage of doc stores, ie, reading from them while they're still being written to will likely break this.\n\nTrue, we need to cross that bridge w/ RT.\n\nActually I think Michael & I discussed it already on an issue but I can't remember where.",
            "date": "2010-11-14T23:28:40.562+0000",
            "id": 2
        },
        {
            "author": "Jason Rutherglen",
            "body": "bq. Actually I think Michael & I discussed it already on an issue but I can't remember where.\n\nYeah we discussed it before in LUCENE-1313, and possibly in the RT issue.  In the LUCENE-2312 patch the doc stores are being flushed on get reader and the doc stores read successfully.  ",
            "date": "2010-11-15T00:34:46.487+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "bq. In the LUCENE-2312 patch the doc stores are being flushed on get reader and the doc stores read successfully.\n\nFlushed by not closed?  And that works fine on Windows?  That's fascinating to me :)\n\nIe, that our dir impls are able to get an IndexInput when there's still an IndexOutput writing to it.\n\nBut for RT this will be necessary.  I had thought that we'd have to extend Directory to explicitly add eg an IndexInputOutput, ie designed for full read/write.",
            "date": "2010-11-15T14:16:51.156+0000",
            "id": 4
        }
    ],
    "component": "core/index",
    "description": "I modified MockDirWrapper to assert this (except for\nsegments_N/segments.gen, where it's expected), and, it uncovered a\ncouple of places involving NRT readers where we open a shared doc\nstore file that's still open for writing.\n\nFirst, if you install a merged segment warmer, we were failing to\nforce the merge of the doc stores in this case, thus potentially\nopening the same doc stores that are also still open for writing.\n\nSecond, if you're actively adding docs in other threads when you call\nIW.getReader(), the other threads could sneak in and flush new\nsegments sharing the doc stores.  The returned reader then opens the\ndoc store files that are still open for writing.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2759",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "We should never open an IndexInput when an IndexOutput is still open",
    "systemSpecification": true,
    "version": ""
}