{
    "comments": [
        {
            "author": "Mark Miller",
            "body": "bq. reopenIfNeeded\n\n+1 - can't think of anything better yet",
            "date": "2011-09-25T20:20:03.717+0000",
            "id": 0
        },
        {
            "author": "Simon Willnauer",
            "body": "just a couple of variants:\n\ntryReopen()\nreopenOnChange()\n\n\njust and idea, we could also have a higherlevel api here on IR that refreshes the reader something like IR IR#refresh(IR prefious, boolean closePrevious)",
            "date": "2011-09-26T07:01:54.725+0000",
            "id": 1
        },
        {
            "author": "Martijn van Groningen",
            "body": "+1 reopenOnChange()\n\nNames that contain maybe or try sound vague to me as a user.",
            "date": "2011-09-26T07:58:31.538+0000",
            "id": 2
        },
        {
            "author": "Doron Cohen",
            "body": "I liked reopen()... (but also like returning null in case there's nothing newer...)\n\nIf the name is going to change, two additional names to consider:\n* newest()\n* newer()\n\nFor \"newest()\" I think current behavior of returning \"this\" makes sense when \"this\" is the newest.\nFor \"newer()\" returning null in that case seems right.\n\nOne problem I have with these names is that they both seem to hide the fact that things are going on down there, when it is required to open a new reader...",
            "date": "2011-09-26T13:22:08.952+0000",
            "id": 3
        },
        {
            "author": "Ryan McKinley",
            "body": "maybe: \nreopenIfChanged()\n\nreopenOnChange suggests, it will reopen when something changes.",
            "date": "2011-09-26T13:31:29.490+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "We can even do the change in 3.x, if we keep the old method delegating to the new one. In 3.x we also need some sophisticated VirtualMethod usage then, as we have to take care of custom IR implementations that may only override the old one :( - unfortunately, reopen() is not final in IR and uses doReopen, like the other methods.\n\nreopenIfChanged() - my favourite!",
            "date": "2011-09-26T13:37:26.172+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "I like reopenIfChanged too!\n\nbq. unfortunately, reopen() is not final in IR and uses doReopen,\n\nCan we just make it final when we backport this change?  It's very expert to externally subclass IR and override reopen...",
            "date": "2011-09-26T16:08:33.019+0000",
            "id": 6
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Can we just make it final when we backport this change? \n\nDuh no we can't since we have core IR impls subclassing IR...",
            "date": "2011-09-26T16:23:38.150+0000",
            "id": 7
        },
        {
            "author": "Michael McCandless",
            "body": "Another trappiness I've seen on IR.reopen is... the method implies that the reopen will happen \"in place\".  And I've seen users try to simply do IR.reopen().\n\nMaybe, the public API we expose should be something like IR.openIfChanged(oldReader), a static method?  This would open a new reader only if there are changes vs the old one, and would try to share resources (ie shared segments) with the old reader, when possible.\n\nWe'd have to add protected IR methods that \"really\" try to do the reopen.",
            "date": "2011-09-26T17:09:23.887+0000",
            "id": 8
        },
        {
            "author": "Michael McCandless",
            "body": "Patch, changing to .reopenIfChanged.\n\nStill wondering about IR.openIfChanged though....",
            "date": "2011-09-26T22:42:53.972+0000",
            "id": 9
        },
        {
            "author": "Ryan McKinley",
            "body": "bq. the method implies that the reopen will happen \"in place\". And I've seen users try to simply do IR.reopen().\n\nfunny, that's what i thought it did!\n\nIf you have to use the results value, should it be:\ngetFreshReader(oldReader)\nor something?\n\nwithout the 'get' it seems like it operates on the reader itself, not the return value.\n\n\n",
            "date": "2011-09-26T23:22:37.425+0000",
            "id": 10
        },
        {
            "author": "Michael McCandless",
            "body": "New patch, cutting over to IndexReader.openIfChanged(oldReader) static\nmethods... I like this much better since it in no way implies the old\nreader is reopened / altered in place.  It returns null if there is no\nchange to the index.  I think it's ready!\n",
            "date": "2011-09-30T12:33:56.113+0000",
            "id": 11
        },
        {
            "author": "Michael McCandless",
            "body": "Tentative 3.x patch.\n\nI had to whip out VirtualMethod for back compat.... would appreciate a review that I did this correctly!  Heavy guns.",
            "date": "2011-10-03T23:33:33.072+0000",
            "id": 12
        },
        {
            "author": "Uwe Schindler",
            "body": "This sophisticated backwards seems fine.\n\nThe most common use-case is:\nOne has a FilterIndexReader. All FilterIndexReaders should override reopen(), as the reopened reader has to be wrapped, too. In that case the filter would call super.reopen (or delegate.reopen), this would then trigger backwards. IndexReader.openIfChanged() would also work on this filtered reader, as it would detect the FilterIR to be old-style and would call its reopen method (so the call chain would be: IR.openIfChanged(filter) -> filter.reopen() -> wrappedReader.reopen() -> IR.openIfChanged(wrappedReader)) [wrappedReader is new-style in this example]\n\nI have to think about other use-cases, but the most common one seems to be fine.",
            "date": "2011-10-04T11:13:20.213+0000",
            "id": 13
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks everyone!",
            "date": "2011-10-05T15:23:05.808+0000",
            "id": 14
        },
        {
            "author": "Uwe Schindler",
            "body": "I am reopening this issue as there is some API problem which makes openIfChanged not consistently useable with FilterIndexReader:\n\nIf you have a FilterIndexReader that did in the past not implement reopen(...), the base class IndexReader throwed UOE. This was fine, as a FilterIndexReader cannot support reopen unless specifically supported. A FilterIndexReader of course must reopen the delegate reader and then wrap it again to Filter. This was done by overriding reopen() methods, checking if the delegate returned another reader and if yes, wrapping it.\n\nI tried to transform code that implement this pattern to Lucene 3.5RC1 but failed to do it in the clean way: Reopen was replaced by a static IR.openIfChanged(IR oldReader) that delegates to the specific IndexReaders implementation of doOpenIfChanged (which is protected).\n\nTo implement the above pattern, doOpenIfChanged must be overridden in FilterIndexReader (again the default *must* thorw UOE, otherwise reopening a filtered reader returns a non-filtered one). This method must call delegate's doOpenIfChanged and if it returns != null, wrap by our FilterIndexReader implementation. The problem: This cannot be implemented if the custom Filter is in a 3rd party package, as it cannot call the protected doOpenIfChanged. The workaround is to use IndexReader.openIfChanged(delegate), but this look borken and violates the pattern.\n\nThe good thing with the workaround is that the VirtualMethod sophisticated backwards works correctly. We must at least document this behaviour in FilterIndexReader or fix the API.",
            "date": "2011-11-21T20:02:16.377+0000",
            "id": 15
        },
        {
            "author": "Robert Muir",
            "body": "{quote}\nThe problem: This cannot be implemented if the custom Filter is in a 3rd party package, as it cannot call the protected doOpenIfChanged.\n{quote}\n\nI don't understand this statement, because FilterReader extends IndexReader so it should be able to call protected IR methods.",
            "date": "2011-11-21T20:06:26.929+0000",
            "id": 16
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. I don't understand this statement, because FilterReader extends IndexReader so it should be able to call protected IR methods.\n\n\nbut not the delegates method though.",
            "date": "2011-11-21T20:09:47.903+0000",
            "id": 17
        },
        {
            "author": "Robert Muir",
            "body": "Thats no problem, it just calls super.doOpenIfChanged, see my proof of concept.",
            "date": "2011-11-21T20:16:17.136+0000",
            "id": 18
        },
        {
            "author": "Uwe Schindler",
            "body": "This code does not compile (fails by saying IndexReader has no accessible method doOpenIfChanged()):\n\n{code:java}\npackage my.sophisticated.package;\n\n@Override\nprotected IndexReader doOpenIfChanged() throws CorruptIndexException, IOException {\n  final IndexReader n=in.doOpenIfChanged();\n  return (n==null) ? null : new MySophisticatedIndexReader(n);\n}\n{code}\n\nThis is the working workaround but looks wrong (and works around the VirtualMethod issues):\n\n{code:java}\n@Override\nprotected IndexReader doOpenIfChanged() throws CorruptIndexException, IOException {\n  final IndexReader n=IndexReader.openIfChanged(in);\n  return (n==null) ? null : new MySophisticatedIndexReader(n);\n}\n{code}\n",
            "date": "2011-11-21T20:16:36.823+0000",
            "id": 19
        },
        {
            "author": "Robert Muir",
            "body": "Uwe, see my patch, it uses its own sophisticated packaged and works fine.",
            "date": "2011-11-21T20:18:15.310+0000",
            "id": 20
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. Thats no problem, it just calls super.doOpenIfChanged, see my proof of concept.\n\nThis throws UOE as FilterIndexReader (correctly!!!) does not implement doOpenIfChanged. If it would implement if a FilterIndexReader without any doOpenIfChanged impl would be horribly broken as it would return an unfiltered reader!!!",
            "date": "2011-11-21T20:18:15.477+0000",
            "id": 21
        },
        {
            "author": "Robert Muir",
            "body": "In my patch FIR returns whatever the underlying reader does.\n\nIf you want this to be UOE *if doReopen is not overridden*, well, you know how to do that :)",
            "date": "2011-11-21T20:19:30.648+0000",
            "id": 22
        },
        {
            "author": "Uwe Schindler",
            "body": "Robert read my comment about the reason why FilterIndexReader should never delegate to doOpenIfChanged(), as it would return an unfiltered reader on reopening, which would be a hidden bug for an implementor!",
            "date": "2011-11-21T20:20:04.224+0000",
            "id": 23
        },
        {
            "author": "Uwe Schindler",
            "body": "Robert: If you wrap a standard SegmentReader, it supports doOpenIfChanged. If I wrap it with my own custom FilterIndexReader that does not implement doOpenIfChanged, it will silently pass the return value of SegmentReader.doOpenIfChanged() which is no longer filtered. By throwing UOE in the default FilterIndexReader the user will see this when he tries to reopen.",
            "date": "2011-11-21T20:22:26.996+0000",
            "id": 24
        },
        {
            "author": "Robert Muir",
            "body": "As I said before, this is simple, FIR's impl only delegates if its overriden. otherwise throws UOE.",
            "date": "2011-11-21T20:23:03.261+0000",
            "id": 25
        },
        {
            "author": "Uwe Schindler",
            "body": " bq. As I said before, this is simple, FIR's impl only delegates if its overriden. otherwise throws UOE.\n\nNot in your proof of concept. And this proof of concept is no proof as it modifies FilteredIndexReader, so it would not work with 3.5.0RC1.\n\nPlease note: For the above reason: FilterIndexReader in the past never delegated reopen() - for this exact reason (there was an issue open why delegating is wrong - have to look it up).",
            "date": "2011-11-21T20:26:00.519+0000",
            "id": 26
        },
        {
            "author": "Robert Muir",
            "body": "{quote}\nNot in your proof of concept. And this proof of concept is no proof as it modifies FilteredIndexReader, so it would not work with 3.5.0RC1.\n{quote}\n\nI'm not arguing that nothing needs to be done: I'm just saying that the fact its protected isnt really a problem.\n\nFor 3.5.0 there is already a workaround.",
            "date": "2011-11-21T20:31:00.573+0000",
            "id": 27
        },
        {
            "author": "Robert Muir",
            "body": "And just again: I want to point out this is the same fundamental problem as LUCENE-2828.\n\nThis is why abstract classes are NOT the solution to backwards compatibility, because\ndelegators over abstract classes get all jacked up.\n",
            "date": "2011-11-21T20:35:29.850+0000",
            "id": 28
        },
        {
            "author": "Uwe Schindler",
            "body": "I will add a comment to the javadocs with a simple statement:\n\n{noformat}\n * <p><b>Note:</b> The default implementation of {@link FilterIndexReader#doOpenIfChanged}\n * throws {@link UnsupportedOperationException} (like the base class),\n * so it's not possible to reopen a <code>FilterIndexReader</code>.\n * To reopen, you have to first reopen the underlying reader\n * and wrap it again with the custom filter.\n{noformat}\n\nIn this case the responsibility is moved over to the consumer. Its the same like with SlowMultiReaderWrapper: It does not support reopen, to support this, reopen the underlying reader and make it slow again :-)",
            "date": "2011-11-22T13:14:17.387+0000",
            "id": 29
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed 3.x revision: 1204970\nMerged to trunk revision: 1204971",
            "date": "2011-11-22T13:17:18.923+0000",
            "id": 30
        },
        {
            "author": "Uwe Schindler",
            "body": "Bulk close after release of 3.5",
            "date": "2011-11-27T12:29:37.122+0000",
            "id": 31
        }
    ],
    "component": "",
    "description": "Spinoff from LUCENE-3454 where Shai noted this inconsistency.\n\nIR.reopen sounds like an unconditional operation, which has trapped users in the past into always closing the old reader instead of only closing it if the returned reader is new.\n\nI think this hidden maybe-ness is trappy and we should rename it (maybeReopen?  reopenIfNeeded?).\n\nIn addition, instead of returning \"this\" when the reopen didn't happen, I think we should return null to enforce proper usage of the maybe-ness of this API.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3464",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Rename IndexReader.reopen to make it clear that reopen may not happen",
    "systemSpecification": true,
    "version": ""
}