{
    "comments": [
        {
            "author": "Steve Rowe",
            "body": "Patch implementing above-described changes.",
            "date": "2008-04-01T00:04:17.609+0000",
            "id": 0
        },
        {
            "author": "Steve Rowe",
            "body": "The issue that introduced generation of Changes.html",
            "date": "2008-04-01T00:10:53.930+0000",
            "id": 1
        },
        {
            "author": "Steve Rowe",
            "body": "Since the Lucene Bugzilla bugs mentioned in CHANGES.txt are no longer present in the Apache Bugzilla database, it doesn't make sense to auto-linkify these any longer.\n\nInstead, this version of the patch links from each mentioned Bugzilla bug number to the JIRA issue that was cloned from it, and includes the JIRA issue name.  For example, the following text:\n\nbq. ArrayIndexOutOfBoundsExceptions (patch #9110); \n\nbecomes:\n\nbq. ArrayIndexOutOfBoundsExceptions ([patch #9110 \\[LUCENE-35\\]|http://issues.apache.org/jira/browse/LUCENE-35]); \n",
            "date": "2008-04-02T14:56:28.346+0000",
            "id": 2
        },
        {
            "author": "Doron Cohen",
            "body": "I didn't try it but from the description it sounds great.\nI'll try it over the weekend.\nFor the fancy stylesheet - I put those colors but no sentiments for them here - please feel free to modify them to your taste..:-)",
            "date": "2008-04-02T16:24:57.781+0000",
            "id": 3
        },
        {
            "author": "Steve Rowe",
            "body": "One last bugfix: item #3.1 under 2.3.0's \"New features\" section is intended to be understood as a component of item #3.  This version of the patch renumbers this item to #4, like all previous versions, but it no longer includes a '1' at the beginning of the item's text, as all previous versions did.\n\nShould hierarchical change item formatting be supported?  AFAICT, the above-described item #3.1 is the only occurrence of this phenomenon currently in CHANGES.txt.",
            "date": "2008-04-02T18:37:15.601+0000",
            "id": 4
        },
        {
            "author": "Steve Rowe",
            "body": "One last feature: added \"Expand All\" and \"Collapse All\" buttons at the top of the page.  \n\nThese buttons are added via Javascript, so they don't appear when Javascript disabled and everything is always expanded.\n\nThis version also cleans up some mis-identified change attributions, e.g. \"(see #3 above)\".",
            "date": "2008-04-02T20:02:24.493+0000",
            "id": 5
        },
        {
            "author": "Doron Cohen",
            "body": "Patch looks great! \nOne minor issue the dynamically inserted buttons do not work on IE 6 for me. \nI changed that to create them in the static HTML lines and now it works in both IE and FF. \nAlso modified the colors of the  fancy style to be more pleasant and made it default again - for visible separation between the three parts (trunk, last release, older releases).\nAttaching the update - will commit soon. \nDoron",
            "date": "2008-04-18T19:36:49.045+0000",
            "id": 6
        },
        {
            "author": "Steve Rowe",
            "body": "Hi Doron, I like the Fancy stylesheet now - thanks.  Attaching a new patch that contains a couple of small changes from your version:\n\n# I found a way to fix the bad IE6 behavior with the dynamic Expand All/Collapse All buttons, so I removed your static <input> tags and put the button creation back in the <head><SCRIPT> tag.  I prefer this way, because the buttons will not appear at all if javascript is disabled.\n# Removed an extra copy of styles in ChangesFixedWidthStyle.css\n# Removed the alternative stylesheets <link> to the Fancy stylesheet (not necessary since it's the default stylesheet)\n",
            "date": "2008-04-18T20:29:45.330+0000",
            "id": 7
        },
        {
            "author": "Doron Cohen",
            "body": "I just realized that adding the buttons statically means they are shown also when javascript is disabled and then they do nothing.\nI would like to have both - buttons that work also in IE6 and view that is consistent also with javascript disabled.\nIf this is not possible I think it is more important for IE6 to work properly. Steven?\n",
            "date": "2008-04-18T20:31:50.718+0000",
            "id": 8
        },
        {
            "author": "Doron Cohen",
            "body": "cool, thanks, that was fast!",
            "date": "2008-04-18T20:38:57.585+0000",
            "id": 9
        },
        {
            "author": "Steve Rowe",
            "body": "I just realized that I didn't save the editor buffer where I removed the extra styles from ChangesFixedWidthStyle.css -- somehow, there are *three* copies of each style in there.  Not attaching (yet another) patch - can you manually remove the extras, Doron?",
            "date": "2008-04-18T20:48:37.615+0000",
            "id": 10
        },
        {
            "author": "Doron Cohen",
            "body": "Actually there are now 3 duplicates in ChangesFixedWidthStyle.css - never mind I'll remove that. \nYes now without the setAttribute() it works for me too in IE6 as well. \nSo I am committing this.\n",
            "date": "2008-04-18T20:51:27.077+0000",
            "id": 11
        },
        {
            "author": "Doron Cohen",
            "body": "Second time in a row(e) :-) that I am too slow for your fast response... ",
            "date": "2008-04-18T20:52:42.262+0000",
            "id": 12
        },
        {
            "author": "Steve Rowe",
            "body": "One tiny display issue I noticed: the Bugzilla issue autolinkification places the </a> tag before the closing right square bracket (']') around the LUCENE-XXXX issue, so the closing bracket is not part of the link text, but it should be. \n\nThis occurs on line #389 on changes2html.pl:\n\n{code}\n   . qq!$issue&nbsp;[LUCENE-$jira_issue_num</a>]!\n{code}\n\nshould be\n\n{code}\n   . qq!$issue&nbsp;[LUCENE-$jira_issue_num]</a>!\n{code}\n\nAgain, not including another patch - would you mind fixing this for me, Doron?",
            "date": "2008-04-18T21:14:08.452+0000",
            "id": 13
        },
        {
            "author": "Doron Cohen",
            "body": "sure np",
            "date": "2008-04-19T16:11:03.328+0000",
            "id": 14
        },
        {
            "author": "Doron Cohen",
            "body": "Committed, Thanks Steve!",
            "date": "2008-04-20T18:32:36.969+0000",
            "id": 15
        }
    ],
    "component": "general/website",
    "description": "Some improvements to the Changes.html generated by the changes2html.pl script via the 'changes-to-html' ant task:\n\n# Simplified the Simple stylesheet (removed monospace font specification) and made it the default.  The Fancy stylesheet is really hard for me to look at (yellow text on light blue background may provide high contrast with low eye strain, but IMHO it's ugly).\n# Moved the monospace style from the Simple stylesheet to a new stylesheet named \"Fixed Width\"\n# Fixed syntax errors in the Fancy stylesheet, so that it displays as intended.\n# Added <span style=\"attrib\">  to change attributions.\n# In the Fancy and Simple stylesheets, change attributions are colored dark green.\n# Now properly handling change attributions in CHANGES.txt that have trailing periods.\n# Clicking on an anchor to expand its children now changes the document location to show the children.\n# Hovering over anchors now causes a tooltip to be displayed - either \"Click to expand\" or \"Click to collapse\" - the tooltip changes appropriately after a collapse or expansion.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1256",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Trivial",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Changes.html formatting improvements",
    "systemSpecification": true,
    "version": "2.4"
}