{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "I would add this extra seeting to BoostAttribute itsself, because it correlates with the retunred boost. This way the attribute is used in two directions. The only thing:\n- clear() should leave this setting untouched\n- equals and hashcode maybe should also ignore this, too\n- the default will be Float.NEGATIVE_INFINITY\n\nThe code to support this is added into the newest patch of LUCENE-2123 with few lines, as it now also did not even try to insert uncompetitive hits into the PQ. The TermCollector would be changed from interface to abstract class that has a protected final accessor to the boostAttr. But for now, we should wait with adding this to BoostAttr.",
            "date": "2009-12-10T07:00:23.178+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "bq. I would add this extra seeting to BoostAttribute itsself,\n\n+1\n\nSo BoostAttr would have something like set/getMinCompetiveValue or something?\n\n",
            "date": "2009-12-10T10:28:51.304+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "This same sort of optimization would be interesting to explore for Lucene's sorting, btw.\n\nEG, say I'm sorting by an int field, keeping top 10 resuls, and, I'm collecting alot of hits.  I see at some point that the \"bottom\" of the queue has int value 7.  At this point, because the int[] from FieldCache is RAM resident, it'd likely be faster, possibly much faster for complex queries, to jump into the field cache, skip forward until you find a doc that has < 7 as its value, and ask the Scorer to advance to that doc.\n\nIe, there comes a time in the search where the int value of that field is a more performant way to drive the scoring.\n\nI wonder if sorting by relevance could do something similar... eg if we know at some point the worst (bottom) relevance in our queue is 2.0, can any Scorer out there somehow use that info to efficiently skip forward.  Maybe only TermScorer, when norms aren't in use, though...",
            "date": "2009-12-10T10:35:30.691+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Here the patch.\n\nRobert: Is this what you need? Any better method names?",
            "date": "2009-12-12T14:56:40.054+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Maybe the method should have a better name instead of minXXXX: This is not the minimum possible boost, that would go into the PQ, it is the largest boost that would not go into the PQ (so the check in the enum should be: accept term only if its boost is > boost hint).",
            "date": "2009-12-12T15:04:34.590+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "minCompetitiveBoost?  minRequiredBoost?",
            "date": "2009-12-12T15:37:38.657+0000",
            "id": 5
        },
        {
            "author": "Uwe Schindler",
            "body": "The problem with minCompetitiveBoost/minRequiredBoost is, that exactly that boost is not competitive, it must be slightly larger...",
            "date": "2009-12-12T15:47:05.926+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "get/setMaxNonCompetitiveBoost() ?",
            "date": "2009-12-12T16:40:33.270+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "... get/setYouMustBeTallerThanThisToRide()\n",
            "date": "2009-12-12T16:43:59.297+0000",
            "id": 8
        },
        {
            "author": "Michael McCandless",
            "body": "bq. get/setMaxNonCompetitiveBoost() ?\n\n+1",
            "date": "2009-12-12T17:47:51.775+0000",
            "id": 9
        },
        {
            "author": "Uwe Schindler",
            "body": "Patch with further access modifier changes and new method name & javadocs.",
            "date": "2009-12-12T18:03:40.462+0000",
            "id": 10
        },
        {
            "author": "Uwe Schindler",
            "body": "I will commit this patch later today.",
            "date": "2009-12-14T10:38:05.769+0000",
            "id": 11
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 890308\n\nThanks all!",
            "date": "2009-12-14T13:27:21.880+0000",
            "id": 12
        }
    ],
    "component": "core/search",
    "description": "when using the TopTermsScoringBooleanQueryRewrite (LUCENE-2123), it would be nice if MultiTermQuery could set an attribute specifying the minimum required score once the Priority Queue is filled. \n\nThis way, FilteredTermsEnums could adjust their behavior accordingly based on the minimal score needed to actually be a useful term (i.e. not just pass thru the pq)\n\nAn example is FuzzyTermsEnum: at some point the bottom of the priority queue contains words with edit distance of 1 and enumerating any further terms is simply a waste of time.\nThis is because terms are compared by score, then termtext. So in this case FuzzyTermsEnum could simply seek to the exact match, then end.\n\nThis behavior could be also generalized for all n, for a different impl of fuzzyquery where it is only looking in the term dictionary for words within edit distance of n' which is the lowest scoring term in the pq (they adjust their behavior during enumeration of the terms depending upon this attribute).\n\nOther FilteredTermsEnums could make use of this minimal score in their own way, to drive the most efficient behavior so that they do not waste time enumerating useless terms.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2140",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "TopTermsScoringBooleanQueryRewrite minscore",
    "systemSpecification": true,
    "version": "4.0-ALPHA"
}