{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Initial patch... still a couple nocommits...",
            "date": "2010-09-27T16:08:05.114+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "Another rev, fixes the 2 nocommits plus a few other issues.\n\nI think it's ready to commit!",
            "date": "2010-09-27T17:42:22.746+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "Fixed TQ to actually use the docFreq passed to it...",
            "date": "2010-09-27T18:05:43.042+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "Another iter.\n\nThis time I added a cache in SimpleText codec, to map field -> Terms instance.  With this patch, running all tests w/ SimpleText is only 50% slower than Standard, so I put SimpleText back into the random rotation.",
            "date": "2010-09-27T21:10:07.229+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "Patch looks good to me. \n\nEnabling the caching for seeking in the TermsEnum itself wasnt very good, because some queries (e.g. Fuzzy) seek to more terms than they will end out \"using\" in the BooleanQuery. Its much better to be in the rewrite method. And I like passing docfreq so we the queries are less fragile and depend on this cache less.\n\nMaybe we should consider the small patch to Standard's terms dict cache in LUCENE-2672? The issue is that clone() with this hierarchy can be expensive, its new in flex because of the TermState abstraction i think. This might be important in rewrite methods that are going to add a lot of these terms (it certainly showed up in my profiler and made a big difference)\n\nUwe found an excellent explanation of this: http://forums.java.net/jive/thread.jspa?messageID=16538&tstart=0\nIt even affects arrays too, there is a bug for the array case, but its only fixed in -server: http://bugs.sun.com/bugdatabase/view_bug.do?bug_id=6195753\n",
            "date": "2010-09-28T16:03:52.126+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Maybe we should consider the small patch to Standard's terms dict cache in LUCENE-2672?\n\n+1\n\nI'll fold it in...",
            "date": "2010-09-28T16:16:19.719+0000",
            "id": 5
        }
    ],
    "component": "core/index",
    "description": "Some small improvements:\n\n  * Adds a TermsEnum.cacheCurrentTerm \"hint\" (codec can make this a no-op)\n\n  * Removes the FTE.useTermsCache\n\n  * Changes MTQ's TermCollector API to accept the TermsEnum so collectors can eg call .docFreq directly\n\n  * Adds expert ctor to TermQuery allowing you to pass in the docFreq",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2674",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "improve how MTQs interact with the terms dict cache",
    "systemSpecification": true,
    "version": ""
}