{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Uwe are you working out a patch for this?",
            "date": "2009-04-07T23:14:05.256+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "Here is it, not fully tested, but seems to work at least for norms and all Lucene Tests pass.\nThe changes in Field could be left out, the important thing are FieldInfo cahnges.\nWhen a FieldInfo is generated without indexing switched on, all the indexing-only flags are set to defaults.\n\nThe update method, that merges the existing field infos with new ones, only updates the indexing flags, if the added field is indexed. For all merging that results in an OR operation (all excl. omitNorms) the c'tors default is false, for all flags that merge with AND (omitNorms), the c'tors default is true.\n\nThe problem is: Luke does not show the omitTf thing, as this flag seems not be loaded by IndexReader, so I cannot find out if the omitTf was really done in index (Luke does not show this flag even for fields that were added once with omitTf).\n\nFinally, I wanted to add a test, that exactly does what I have done, and tests if it works.",
            "date": "2009-04-07T23:22:46.730+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. The problem is: Luke does not show the omitTf thing, as this flag seems not be loaded by IndexReader, so I cannot find out if the omitTf was really done in index (Luke does not show this flag even for fields that were added once with omitTf).\n\nAhhh, I found the problem: FieldsReader does not set this flag in the generated Field instances with the flag from FieldInfo. Patch follows shortly that fixes this, too. My Luke now displays this flag, too.",
            "date": "2009-04-07T23:38:26.047+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Here the patch that also fixes the missing omitTf settings in FieldsReader.\n\nI will create the TestCase tomorrow, it's to late for that, I want to go to bed now.\n\nJust a note: The behavior in Luke is with this patch a little bit different: Stored-Only fields now show in Luke always \"omitNorms\" (O), because this is the default for non-indexed fields. As soon as a field is added that is indexed and has not explicitely set omitNorms, norms are enabled again (as noted in the FieldInfo.update() method). So everything behaves correctly, only the display is now correct in Luke.\n",
            "date": "2009-04-08T00:06:52.016+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Here is the final patch. I added two tests (one for the bug itsself) and one for the additional bug in FieldsReader, that does not propagate omitNorms and omitTf to the Fieldable on loading. I also found a bug in FieldInfos, that forgets to add omitTf if the FieldInfos are loaded from a Document instance (I realized this during changing the FieldsReader test).\n\nAll core tests pass.\n\nIt would be really good, if somebody with good knowledge of the internals could review the patch, as there are a lot of things, I do not understand completely.",
            "date": "2009-04-08T10:19:29.691+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "\nPatch looks good!  All tests pass.  That was trickier than I expected;\nthanks Uwe.  I plan to commit in a day or two.\n\nIt's a good catch, all the places in FieldsReader where we fail to\ncarryover OTFAP from FieldInfo --> Field instance on the document.\nIt's yet another example of how having the loaded Document \"seem like\"\nthe indexed document causes problems.\n\nIn the ideal future (I think?), the fields on a \"loaded\" Document\nwould make no effort to convey these index-time options like\nomitNorms, OTFAP, etc., because those settings are \"semi-global\"\n(absorbed into the FieldInfos for the current segment).  And something\nlike boost, which the API lets you access on a loaded doc, is always\nwrong since we cannot recreate that (it's not stored, directly, in the\nindex).\n\nAt indexing time, all these if's all over the place to conditionalize\nthe defaults depending on whether the field is indexed, are also\nspooky.  It's as if we should have a separate class (IndexedField)\nthat privately carries these values.  Then a StoredField wouldn't even\nhave them.  But that approach breaks down because we'd also want an\nIndexedAndStoredField.\n\nOr... perhaps we move all the indexing-specific settings out of\nField.java and into Field.Index.  After all, these details really\ndescribe tweaks on how Lucene will do its indexing, so they don't\nreally belong in the main Field.java class.\n",
            "date": "2009-04-08T12:00:50.061+0000",
            "id": 5
        },
        {
            "author": "Uwe Schindler",
            "body": "{quote}\nPatch looks good! All tests pass. That was trickier than I expected;\nthanks Uwe. I plan to commit in a day or two.\n{quote}\n\nThe only tricky part was the FieldsReader. The original bug was fixed in a few lines (FieldInfo ctor and update()).\n\n{quote}\nIt's a good catch, all the places in FieldsReader where we fail to\ncarryover OTFAP from FieldInfo --> Field instance on the document.\nIt's yet another example of how having the loaded Document \"seem like\"\nthe indexed document causes problems.\n{quote}\n\nI am still not happy with the new FieldReader because it cannot replicate all indexing infos (but now does almost everything). I know, it does not affect functionality (as only the stored contents can be retrieved). In principle the Field instances should have *no* indexing options. Luke would the display nothing anymore, but for this case it would really be better to make the Field infos \"public\", so somebody could enumerate all fields and test then, which options were used during indexing. Mixing this with retrieval of stored fields is not good.\n\nOne case is now not implemented correctly in FieldsReader: A binary stored field have a special if-clause in FieldsReader. The binary field is loaded as stored only, currently only omitTf and omitNorms are set (I added this). But e.g. INDEX is always false and so on. In principle for completeness, all options from FieldInfo should be replicated here.\nFieldsReader would be better to have a central method like copyFieldOptions(FieldInfo, Fieldable), that copies all options from FieldInfo to the Fieldable (without looking at the stored contents). The other if-cases should only initialize the stored parts and type. I think, I give it a try.\nThe whole info is now more important: If somebody in the past had stored the string contents compressed, he must now use a binary field and compress himself. In this case, Luke would not display any indexing options anymore. This is not bad, but inconsistent.\n\nSo the better case is to make the Field properties public not on the document level, but on the IndexReader level.",
            "date": "2009-04-08T13:59:25.237+0000",
            "id": 6
        },
        {
            "author": "Michael McCandless",
            "body": "\nbq. In principle the Field instances should have no indexing options.\n\nYou mean retrieved fields right?  I agree.\n\nbq. but for this case it would really be better to make the Field infos \"public\", so somebody could enumerate all fields and test then, which options were used during indexing. Mixing this with retrieval of stored fields is not good.\n\nI agree, we should make it possible to access the \"schema\"\n(FieldInfos) from the index. This would presumably replace the\ngetFieldNames(FieldOption) IndexReader exposes today.\n\nSince FieldInfos is per-segment, one challenge is how Multi*Reader\nshould work.  Should it simply merge on-the-fly?  (ie present a single\nFieldInfo that merged the fields by the same name across all segmens)\n\nbq. FieldsReader would be better to have a central method like copyFieldOptions(FieldInfo, Fieldable), that copies all options from FieldInfo to the Fieldable (without looking at the stored contents).\n\nThis sounds like a good stop-gap measure, but I'd rather put our\nenergy towards exposing the schema, decoupling \"retrieved\" Fields from\nindexed fields, etc.\n",
            "date": "2009-04-08T14:21:01.055+0000",
            "id": 7
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. Since FieldInfos is per-segment, one challenge is how Multi*Reader should work. Should it simply merge on-the-fly? (ie present a single FieldInfo that merged the fields by the same name across all segmens)\n\nMaybe merge with the already existing FieldInfos/FieldInfo methods.\n\nA new case for this would be good, after thinking a little bit about it, I may open one. But in general it should be combined with the Document/Fields redesign.\n\nbq. This sounds like a good stop-gap measure, but I'd rather put our energy towards exposing the schema, decoupling \"retrieved\" Fields from indexed fields, etc.\n\nYes, and it will not work. I think, we leave the patch as it is, maybe remove the omitTf and omitNorms update for binary fields. Binary fields are \"special\".",
            "date": "2009-04-08T21:56:03.194+0000",
            "id": 8
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Maybe merge with the already existing FieldInfos/FieldInfo methods.\n\nAnd we should think about flexible indexing, ie, make FieldInfo extensible.  I think there are two separate questions, here:\n\n  * What API doe we expose for the \"schema\" (FieldInfo/s)?\n\n  * How to handle the fact that each segment has its own \"schema\" (hide it, by virtually merging the way SegmentMerger would, or, expose it)?\n\nbq. A new case for this would be good, after thinking a little bit about it, I may open one. But in general it should be combined with the Document/Fields redesign.\n\nI agree, a new issue.\n\nbq. Yes, and it will not work. I think, we leave the patch as it is, maybe remove the omitTf and omitNorms update for binary fields. Binary fields are \"special\".\n\nDo you want to make a new patch (removing omit* update for binary fields)?",
            "date": "2009-04-09T09:06:34.404+0000",
            "id": 9
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. Do you want to make a new patch (removing omit* update for binary fields)?\n\nHere it is, FieldsReader is now equal to the pre-previous patch, tests still pass. Binary field handling is now unchanged.",
            "date": "2009-04-09T09:30:50.214+0000",
            "id": 10
        },
        {
            "author": "Uwe Schindler",
            "body": "I forgot to add a change-note in changes.txt. As the behaviour is now a little bit different (stored-only fields now have omitNorms switched \"on\" per default), there should be a note in changes.txt. Can you add it when committing. I am not sure, what to add there.",
            "date": "2009-04-09T09:32:32.541+0000",
            "id": 11
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Uwe.  I'll add a CHANGES entry.",
            "date": "2009-04-09T09:56:14.793+0000",
            "id": 12
        },
        {
            "author": "Michael McCandless",
            "body": "Thanks Uwe!",
            "date": "2009-04-09T10:38:01.767+0000",
            "id": 13
        }
    ],
    "component": "core/index",
    "description": "During updating my internal components to the new TrieAPI, I have seen the following:\n\nI index a lot of numeric fields with trie encoding omitting norms and term frequency. This works great. Luke shows that both is omitted.\n\nAs I sometimes also want to have the components of the field stored and want to use the same field name for it. So I add additionally the field again to the document, but stored only (as the Field c'tor using a TokenStream cannot additionally store the field). As it is stored only, I thought, that I can left out explicit setting of omitNorms and omitTermFreqAndPositions. After adding the stored-only-without-omits field, Luke shows all fields with norms enabled. I am not sure, if the norms/tf were really added to the index, but Luke shows a value for the norms and FieldInfo has it enabled.\n\nIn my opinion, this is not intuitive, o.a.l.document.Field  should switch both omit* options on when storing fields only (and also disable other indexing-only options). Alternatively the internal FieldInfo.update(boolean isIndexed, boolean storeTermVector, boolean storePositionWithTermVector, boolean storeOffsetWithTermVector, boolean omitNorms, boolean storePayloads, boolean omitTermFreqAndPositions) should only change the omit* and other options, if the isIndexed parameter (not this.isIndexed) is also true, elsewhere leave it as it is.\n\nIn principle, when adding a stored-only field, any indexing-specific options should not be changed in FieldInfo. If the field was indexed with norms before, norms should stay enabled (but this would be the default as it is).",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1590",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Stored-only fields automatically enable norms and tf when added to document",
    "systemSpecification": true,
    "version": "2.4, 2.4.1, 2.9"
}