{
    "comments": [
        {
            "author": "Chris Male",
            "body": "Attaching patch for Robert.",
            "date": "2009-12-28T19:52:49.975+0000",
            "id": 0
        },
        {
            "author": "Steve Rowe",
            "body": "The justification for using @Deprecated, AFAICT, is that conforming compilers are required to issue warnings for each so-annotated class/method, where compilers are *not* required to issue warnings for javadoc @deprecated tags, and although Sun compilers do this, other vendors' compilers might not.\n\nAnother (similarly theoretical) argument in favor of using @Deprecated annotations is that, unlike @deprecated javadoc tags, this annotation is available via runtime reflection.\n\nA random information point: MYFACES-2135 removed all @Deprecated annotations from MyFaces code because an apparent bug in the Sun TCK flags methods bearing this annotation as changing method signatures.\n",
            "date": "2009-12-30T16:17:17.340+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "Steven, yeah i know theoretically why this is here, but it is completely stupid.\n\n@Deprecated is a gigantic mistake, requiring me to write it twice, once lowercase in the javadocs, once uppercase as an annotation. This is the only way to properly deprecate something with a message as to why.\n\nand so this additional work buys me nothing, except some theoretical workaround to sun's piss-poor broken language design.\n\nthis being said, i still think we should be consistent: either remove all these annotations or add them all, and not just use them 'sometime'.",
            "date": "2009-12-30T16:23:58.305+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 895342 to trunk.\n\nI added flex branch here, after the next time trunk is merged to it we should do the same there.",
            "date": "2010-01-03T10:34:32.531+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "patch for flex, also RegexTermsEnum is undeprecated as it was accidentally deprecated in favor of itself.",
            "date": "2010-01-15T14:07:36.659+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 899831 to flex",
            "date": "2010-01-15T22:15:39.872+0000",
            "id": 5
        }
    ],
    "component": "",
    "description": "as discussed on LUCENE-2084, I think we should be consistent about use of @Deprecated annotations if we are to use it.\n\nThis patch adds the missing annotations... unfortunately i cannot commit this for some time, because my internet connection does not support heavy committing (it is difficult to even upload a large patch).\n\nSo if someone wants to take it, have fun, otherwise in a week or so I will commit it if nobody objects.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2185",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Trivial",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "add @Deprecated annotations",
    "systemSpecification": true,
    "version": ""
}