{
    "comments": [
        {
            "author": "Simon Willnauer",
            "body": "fix once on trunk",
            "date": "2011-06-09T10:50:09.586+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "I'm gonna take a stab at this, because we really want to have multiple implementations to ensure the abstract api is good,\nand doesnt have any assumptions about the current implementation.\n\nAny issues would be harder to debug if our first alternative implementation was something like crazy 3.x norms versus an easy\nplain text impl.\n\nill commit LUCENE-3622 to a branch and start playing around.",
            "date": "2011-12-07T00:16:45.140+0000",
            "id": 1
        },
        {
            "author": "Simon Willnauer",
            "body": "FYI I am working on this. Robert you are not on it right now, right?",
            "date": "2012-01-19T17:06:35.961+0000",
            "id": 2
        },
        {
            "author": "Robert Muir",
            "body": "No... i got caught up in 3622 trying to factor out the lucene40 implementation better.\n\nBut a lot of those issues are now fixed (e.g. we have a default merge implementation).\n\nI just marked 3622 closed since I think the goals of that issue are now resolved.",
            "date": "2012-01-19T17:18:31.694+0000",
            "id": 3
        },
        {
            "author": "Simon Willnauer",
            "body": "here is a first patch adding SimpleTextDV and replacing SimpleTextNorms with it directly. \nI had to change some upstream classes and especially the merging done in the DocValuesConsumer which used the \"wrong\" type  for merging. In general we should use the target type instead of the source type and sources need to implement getBytes and do auto conversion otherwise type promotion doesn't work.\n\nthis patch writes individual files per field like sep codec which made things a lot easier and is maybe better suited for SimpleText\n\ncomments welcome",
            "date": "2012-02-22T14:33:31.076+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "first thoughts: looks nice! Thanks for working on this!\n\nI will try to take a look later, I noticed a few imports from lucene40 codec into simpletext (which i think we should avoid),\nbut I think these were just javadocs relics!",
            "date": "2012-02-22T14:54:09.342+0000",
            "id": 5
        },
        {
            "author": "Simon Willnauer",
            "body": "any comments on this? I don't want this to go out of date too much",
            "date": "2012-03-02T15:57:25.775+0000",
            "id": 6
        },
        {
            "author": "Simon Willnauer",
            "body": "merged with trunk... \nSimpleTextPerDocProducer still uses 2 lucene40 classes DocValuesArray & DocValuesReaderBase. \nI think DocValues array is generally useful and should go to o.a.l.codec and we can rename DocValuesReaderBase to PerDocProducerBase and move to o.a.l.codec too. Thoughts?",
            "date": "2012-03-02T16:03:40.314+0000",
            "id": 7
        },
        {
            "author": "Simon Willnauer",
            "body": "committed to trunk in revision 1297920",
            "date": "2012-03-07T10:27:13.847+0000",
            "id": 8
        },
        {
            "author": "Robert Muir",
            "body": "Thanks Simon!",
            "date": "2012-03-07T11:57:43.702+0000",
            "id": 9
        }
    ],
    "component": "core/index, core/search",
    "description": "currently SimpleTextCodec uses binary docValues we should move that to a simple text impl.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3074",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "OTHER",
    "priority": "Blocker",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "SimpleTextCodec needs SimpleText DocValues impl",
    "systemSpecification": true,
    "version": "4.0-ALPHA"
}