{
    "comments": [
        {
            "author": "Mark Miller",
            "body": "Here is a rough draft - if you have any comments or suggestions, I'd be happy to take them. If you originally wrote a contrib or know it well, feel free to provide a better overview. I'll probably make one more pass myself at some point. I'll also include a link to the package.html (for the contribs that have it)\n\n\nanalyzers\nContributed Analyzers, Tokenizers, and Filters for various uses and languages.\n\nant\nAnt task to create Lucene indexes.\n\nbenchmark\nThe benchmark contribution contains tools for benchmarking Lucene using standard, freely available corpora.\n\ncollation\nCollationKeyFilter/Analyzer and ICUCollationKeyFilter/Analyzer.\n\ndb\nProvdies integration with berkely db.\n\nhighlighter\nA set of classes for highlighting matching terms in search results.\n\nfast-vector-highlighter\nAn alternative set of classes for highlighting matching terms in search results that relies on stored term vectors.\n\ninstantiated\nRAM-based index that enables much faster searching than RAMDirectory in certain situations.\n\nlucli\nAn application that allows Lucene index manipulation from the command-line.\n\nmemory\nHigh-performance single-document main memory index.\n\nmisc\nA variety of miscellaenous files, including QueryParsers, and other alternate Lucene class implementations and tools.\n\nqueryparser\nA new Lucene query parser implementation, which matches the syntax of the core QueryParser but offers a more modular architecture to enable customization.\n\nregex\nQueries with additional regex mactching capabilities.\n\nremote\nClasses to help use Lucene with RMI.\n\nsnowball\nPre-compiled versions of the Snowball stemmers for Lucene.\n\nspatial\nClasses to help with efficient distance based sorting.\n\nspellchecker\nProvides tools for spellchecking and suggestions with Lucene.\n\nsurround\nA QueryParser that also supports the Span family of queries.\n\nswing\nSwing componenets designed to integrate with Lucene.\n\nwikipedia\nTools for working with wikipedia content.\n\nwordnet\nTools to help utilize wordnet synonyms with Lucene\n\nxml-query-parser\nA QueryParser that can read queries written in an XML format.",
            "date": "2009-08-30T19:16:46.846+0000",
            "id": 0
        },
        {
            "author": "Mark Miller",
            "body": "first rough draft patch",
            "date": "2009-08-30T23:25:04.762+0000",
            "id": 1
        },
        {
            "author": "Steve Rowe",
            "body": "I'm +1 on switching away from \"Sandbox\" (no longer used at all) to Contrib.\n\nBefore you posted your patch, I had written up a new intro for the contrib index.html - feel free to take any of this or ignore it :) :\n\n{code:html}\n      <p>\n        The Lucene Java project also contains a workspace, Lucene Contrib\n        (formerly known as the Lucene Sandbox), that is open both to all Lucene \n        Java core committers and to developers whose commit rights are \n        restricted to the Contrib workspace; these developers are referred to \n        as \"Contrib committers\".  The Lucene Contrib workspace hosts the \n        following types of packages:\n      </p>\n      <ul>\n        <li>Various third party contributions.</li>\n        <li>\n          Contributions with third party dependencies - the Lucene Java core\n          distribution has no external runtime dependencies.\n        </li>\n        <li>\n          New ideas that are intended for eventual inclusion into the Lucene \n          Java core.\n        </li>\n      </ul>\n      <p>\n        Users are free to experiment with the components developed in the\n        Contrib workspace, but Contrib packages will not necessarily be\n        maintained, particularly in their current state. The Lucene Java core \n        backwards compatibility commitments (see\n        <a href=\"http://wiki.apache.org/lucene-java/BackwardsCompatibility\"\n          >http://wiki.apache.org/lucene-java/BackwardsCompatibility</a>)\n        do not necessarily extend to the packages in the Contrib workspace.\n        See the README.txt file for each Contrib package for details.  If the\n        README.txt file does not address its backwards compatibility\n        commitments, users should assume it does not make any compatibility\n        commitments.\n      </p>\n{code}",
            "date": "2009-08-31T15:26:35.061+0000",
            "id": 2
        },
        {
            "author": "Steve Rowe",
            "body": "I think we should add generation of {{Contrib-Changes.html}} from {{contrib/CHANGES.txt}} to the {{changes-to-html}} target in {{build.xml}}:\n\n{code:xml}\n<exec executable=\"perl\" input=\"contrib/CHANGES.txt\" output=\"${changes.target.dir}/Contrib-Changes.html\" failonerror=\"true\">\n  <arg value=\"${changes.src.dir}/changes2html.pl\"/>\n</exec>\n{code}\n\nand then link to it from near the top of {{lucene-sandbox/index.xml}}, something like:\n\n{code:html}\n<p>\n  See <a href=\"http://lucene.apache.org/java/2_9_0/changes/Contrib-Changes.html\">Contrib CHANGES</a> for changes included in the current release.\n</p>\n{code}",
            "date": "2009-09-01T22:27:49.617+0000",
            "id": 3
        },
        {
            "author": "Mark Miller",
            "body": "I added Steve's intro and fixed a mistake or two as well as a couple updates - also changed the page names from sandbox to contrib.",
            "date": "2009-09-06T01:03:32.527+0000",
            "id": 4
        },
        {
            "author": "Mark Miller",
            "body": "Adds Steve's last contrib changes suggestion",
            "date": "2009-09-06T01:59:51.435+0000",
            "id": 5
        },
        {
            "author": "Mark Miller",
            "body": "Thanks Steve!",
            "date": "2009-09-07T01:06:47.488+0000",
            "id": 6
        }
    ],
    "component": "",
    "description": "The page has misleading/bad info. One thing I would like to do - but I won't attempt now (prob good for the modules issue) - is commit to one word - contrib or sandbox. I think sandbox should be purged myself.\n\nThe current page says that the sandbox is kind of a rats nest with various early stage software that one day may make it into core - that info is outdated I think. We should replace it, and also specify how the back compat policy works in contrib eg each contrib can have its own policy, with the default being no policy.\n\nWe should also drop the piece about being open to Lucene's committers and others - a bit outdated.\n\nWe should also either include the other contribs, or change the wording to indicate that the list is only a sampling of the many contribs.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1873",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Update site lucene-sandbox page",
    "systemSpecification": true,
    "version": ""
}