{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "Patch for build.xmls. This also marks benchmark as 1.5, as it depends on fast-vector-highlighter that is 1.5.\n\nI will commit this soon and build the final artifacts of 2.9.3 and 3.0.2!",
            "date": "2010-06-04T23:35:05.017+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "bq. This patch fixes this to repect the current compiler version and disables all contribs that need Java 1.5 by checking their javac.source property.\nThis patch can be ported to 3.x or trunk, when 1.6 contribs will appear.\n\n\nI don't think we should do this. Please don't commit this it should be discussed more.\n\nI know you hate java 1.6, etc. but i don't want to write code that silently fails depending upon environment. a hard error is best.\n\n",
            "date": "2010-06-04T23:44:57.500+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Hi Robert,\n\nin Lucene 2.9, it was intended to work like this, as this code is already there, but the recent added contribs did not use the property at all! Lucene 2.9 is Java 1.4, so it *must* compile, if you run it with this JDK version.\n\nWithout this, it's impossible to check the dependency correctly, and because of this I *fixed* this. I dont want to commit this in 3.x or trunk! So please just tell, if you are fine with *fixing* it in Lucebe 2.9, so it works as expected!\n\nbq. This patch can be ported to 3.x or trunk, when 1.6 contribs will appear.\n\nThis patch is for Lucene 2.9 branch only!",
            "date": "2010-06-05T05:16:35.385+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "More ant magic.\n\nThis patch does not automatically exclude 1.5 only contribs, it fails per default with an error message:\n\n{noformat}\nBuildfile: build.xml\n     [echo] Building fast-vector-highlighter...\n\njavacc-uptodate-check:\n\njavacc-notice:\n\njflex-uptodate-check:\n\njflex-notice:\n\ncommon.init:\n\nfail-jdk14-version:\n\nBUILD FAILED\ncontrib-build.xml:98: Contrib 'fast-vector-highlighter' needs at least JDK 1.5 to build. If you only want to compile Java 1.4 compatible contribs, add '-Dforce.jdk14.build=true' to command line.\n\nTotal time: 0 seconds\n{noformat}\n\nFor testing a whole \"ant test\" with JDK 1.4 you can pass the mentioned property, so it excludes als Java 1.5 contribs. With this its possible for me as release manager of 2.9, to test compatibility with Java 1.4.\n\nRobert, are you fine with that for 2.9.3? If we need something similar in trunk, we *may* think about adding a similar ant magic to the trunk/3x build scripts. But this is not part of this issue, this is fix for 2.9.3 only.",
            "date": "2010-06-05T07:52:25.318+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "This looks like a great step forward -- we can now [optionally; off by default] assert those modules (core, contribs) that \"claim\" to be <= JDK X in fact compile & pass tests with JDK X.\n\nSo we now default to a hard error.... but if you want (eg you are the RM), you can pass -Dforce.jdk14.build=true, and skip those contribs requiring > X.  I agree the default should be brittle (hard error).\n\nCan we use this for Solr/Lucene on trunk/3x?  Ie Solr requires JDK >= 1.6, but Lucene is >= 1.5; we don't want 1.6 features to accidentally sneak into Lucene...",
            "date": "2010-06-05T10:09:52.849+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "The new option is great, thanks Uwe.\n\ni understood all along the patch is for 2.9.x only. I didnt want us to set a precedent where the build allows things to be skipped depending on environment.\nThen the tests are passing for one developer and not for another, releasers could accidentally not build all artifacts, ...\n\n",
            "date": "2010-06-05T12:00:54.644+0000",
            "id": 5
        },
        {
            "author": "Uwe Schindler",
            "body": "bq.  I didnt want us to set a precedent where the build allows things to be skipped depending on environment. Then the tests are passing for one developer and not for another, releasers could accidentally not build all artifacts, ...\n\nThanks, I think the new option is fine now and works in all combinations. I already verified that the whole build and test suite (with the ignore 1.5 contribs option) succeed with JDK 1.4.2_19. This is good to know as the release manager.\n\nbq. Can we use this for Solr/Lucene on trunk/3x? Ie Solr requires JDK >= 1.6, but Lucene is >= 1.5; we don't want 1.6 features to accidentally sneak into Lucene...\n\nOf course, but we should do this in another issue. I will commit this evening and create the release artifacts!",
            "date": "2010-06-05T12:06:53.893+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 951767",
            "date": "2010-06-05T21:02:40.574+0000",
            "id": 7
        }
    ],
    "component": "general/build",
    "description": "When you build and test Lucene 2.9 with Java 1.4, building and testing of contrib fails. This patch fixes this to repect the current compiler version and disables all contribs that need Java 1.5 by checking their javac.source property.\n\nThis patch can be ported to 3.x or trunk, when 1.6 contribs will appear.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2488",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Fix 2.9 contrib builds to succeed when JDK 1.4 is used (leaving out contribs that require 1.5)",
    "systemSpecification": true,
    "version": "2.9, 2.9.1, 2.9.2"
}