{
    "comments": [
        {
            "author": "John Wang",
            "body": "Created an attachment (id=13757)\nPatched IndexWriter.java, contains a new method: expungeDeleted()\n\nI see now where to attach the patch :)\n\nSee attached patch.",
            "date": "2004-12-15T08:57:09.000+0000",
            "id": 0
        },
        {
            "author": "Otis Gospodnetic",
            "body": "Either this Bugzilla diff is not working properly, or you've made a number of\nother more stylistic changes to IndexWriter.java, which make it very hard to see\nthe real change you made.  Could you provide a diff with just the real changes?  \n\nAlso, if you have a unit test that excercises your addition, so we can be sure\nit doesn't break anything, that would be great.  You'd want your unit test to\nmix and match Document additions and deletions and make sure it all still works\nproperly.\nThanks.",
            "date": "2004-12-15T12:13:42.000+0000",
            "id": 1
        },
        {
            "author": "John Wang",
            "body": "Created an attachment (id=13759)\nimplementation of expungeDeleted method\n\nAttached is the implementation of IndexWriter.expungeDeleted method. It is self\ncontained.\n\nThanks\n\n-John",
            "date": "2004-12-15T13:49:02.000+0000",
            "id": 2
        },
        {
            "author": "John Wang",
            "body": "Created an attachment (id=13760)\nUnit test for the patch submited\n\nAttached please find the unit test for IndexWriter.expungeDelete() request by\nOtis.\n\nThanks\n\n-John",
            "date": "2004-12-15T14:13:04.000+0000",
            "id": 3
        },
        {
            "author": "John Wang",
            "body": "Created an attachment (id=13776)\nupdated patch with a fixed diff version\n\n1) As request I reran cvs diff without having done a file format (which screwed\nup cvs)\n\n2) implementation of expungeDelete was made better to handle/delete the\ncompound file after segment info update.",
            "date": "2004-12-18T10:56:04.000+0000",
            "id": 4
        },
        {
            "author": "Grant Ingersoll",
            "body": "This seems generally useful.  I imagine, though, that the patch is way out of date.  I wonder if the new ability to merge some segments might have an option to do this kind of thing.\n\nAny thoughts on resurrecting this? ",
            "date": "2008-01-13T15:29:41.448+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "I think we should resurrect this: I agree it's useful.  I'll take it & tentatively mark it 2.4 (hopefully I can make time by then!).\n\nThe original patch would simply merge one segment \"in place\".  I think we can improve this a bit by merging any adjacent series of segments that have deletions?  This would still preserve docID ordering, but would also accomplish some merging as a side effect (I think a good thing).",
            "date": "2008-01-14T15:36:42.988+0000",
            "id": 6
        },
        {
            "author": "Michael McCandless",
            "body": "Attached patch.  All tests pass.  I plan to commit in a day or two.\n\nThis adds two methods to IndexWriter:\n\n  expungeDeletes() -- defaults to doWait=true\n  expungeDeletes(boolean doWait)\n\nIf doWait is false, and you have a MergeScheduler that runs merges in\nBG threads, then the call returns immediately.\n\nI extended MergePolicy so it decides what \"expunge deletes\" really\nmeans (findMergesToExpungeDeletes).  Then, in LogMergePolicy, I\nimplemented this policy: we merge all adjacent segments (up to\nmergeFactor at once) that have deletes.  If only 1 segment has\ndeletes, it's a singular merge.\n",
            "date": "2008-02-09T15:20:35.314+0000",
            "id": 7
        },
        {
            "author": "Michael McCandless",
            "body": "I just committed this.  Thanks John!  And sorry for the looooong\ndelay.\n\nI also added an \"these APIs are experimental\" warning on top of\nMergePolicy and MergeScheduler (which I should have done before\n2.3 :(, though I don't expect alot of usage of these).\n",
            "date": "2008-02-11T20:35:21.220+0000",
            "id": 8
        }
    ],
    "component": "core/index",
    "description": "We make use the docIDs in lucene. I need a way to compact the docIDs in segments\nto remove the \"holes\" created from doing deletes. The only way to do this is by\ncalling IndexWriter.optimize(). This is a very heavy call, for the cases where\nthe index is large but with very small number of deleted docs, calling optimize\nis not practical.\n\nI need a new method: expungeDeleted(), which finds all the segments that have\ndelete documents and merge only those segments.\n\nI have implemented this method and have discussed with Otis about submitting a\npatch. I don't see where I can attached the patch. I will do according to the\npatch guidleine and email the lucene mailing list.\n\nThanks\n\n-John\n\nI don't see a place where I can",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-325",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "[PATCH] new method expungeDeleted() added to IndexWriter",
    "systemSpecification": true,
    "version": ""
}