{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "Here's a patch: it detects statically if the BreakIterator from thai locale will actually work at all,\nand sets a boolean DBBI_AVAILABLE\n\nin the ctor if this is false, it throws UOE(\"This JRE does not have support for Thai segmentation\")\n\nI also added docs referring to ICUTokenizer in case you need this across all jres, and put\nAssume.assumeTrue(ThaiWordFilter.DBBI_AVAILABLE) in the tests.\n\n",
            "date": "2010-09-18T16:41:17.644+0000",
            "id": 0
        },
        {
            "author": "Simon Willnauer",
            "body": "Looks good to me robert! Make sure you add a CHANGES.TXT entry. Could that have been a bw break since it did not do what it claimed to do?\n\nsimon",
            "date": "2010-09-19T12:10:25.108+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "bq. Could that have been a bw break since it did not do what it claimed to do?\n\nI dont understand the question. ThaiWordFilter has always been broken this way, it is broken by design.",
            "date": "2010-09-19T14:07:30.620+0000",
            "id": 2
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. I dont understand the question. ThaiWordFilter has always been broken this way, it is broken by design.\ncould somebody have used the broken behavior and relies on it? Just making sure its not a bw break somehow which we should document.\n\n",
            "date": "2010-09-19T14:30:49.873+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "no, in this case the filter does not work at all, it does nothing.",
            "date": "2010-09-19T14:40:54.100+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 998684 (trunk), 998688 (3x)",
            "date": "2010-09-19T15:49:37.084+0000",
            "id": 5
        },
        {
            "author": "Robert Muir",
            "body": "reopening for possible 2.9.4/3.0.3 backport.\n",
            "date": "2010-10-29T13:16:21.249+0000",
            "id": 6
        },
        {
            "author": "Robert Muir",
            "body": "I'm gonna shoot for documentation-only fix here for 2.9.x and 3.0.x as well... \nits a no-risk \"fix\" at least to alert people that this won't work on e.g. IBM jdk... ",
            "date": "2010-10-29T14:53:07.927+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "Committed documentation about this in:\nRevision 1028789 for 3.0.x\nRevision 1028791 for 2.9.x",
            "date": "2010-10-29T15:03:12.285+0000",
            "id": 8
        }
    ],
    "component": "modules/analysis",
    "description": "The ThaiAnalyzer/ThaiWordFilter depends on the fact that BreakIterator.getWordInstance(new Locale(\"th\")) returns a dictionary-based break iterator that can segment thai phrases into words (it does not use whitespace).\n\nBut this is non-standard that the JRE will specialize this locale in this way, its nice, but you can't depend on it.\nFor example, if you are running on IBM JRE, this analyzer/wordfilter is completely \"broken\" in the sense it won't do what it claims to do.\n\nAt the minimum, we need to document this and suggest users look at ICUTokenizer for thai, which always has this breakiterator and is not jre-dependent.\n\nBetter, would be to check statically that the thing actually works.\nwhen creating a new ThaiWordFilter we could clone() the BreakIterator, which is often cheaper than making a new one anyway.\nwe could throw an exception, if its not supported, and add a boolean so the user knows it works.\nand we could refer to this boolean with Assert.assume in its tests.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2653",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "ThaiAnalyzer assumes things about your jre",
    "systemSpecification": true,
    "version": "3.1, 4.0-ALPHA"
}