{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Attached patch.  I plan to commit in a day or two.",
            "date": "2009-05-27T14:25:50.664+0000",
            "id": 0
        },
        {
            "author": "Shai Erera",
            "body": "Maybe state in CHANGES that IndexSearcher.setDefaultFieldSortScoring is deprecated and it is just an intermediary solution? In 3.0, the only way to achieve that will be creating TFC yourself.\n\nAlso, the tests call this method and set it to true. Since this new method is deprecated, we'll need to change those tests again in 3.0. Can they create TFC instead and call the appropriate search method?",
            "date": "2009-05-27T15:01:43.728+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Maybe state in CHANGES that IndexSearcher.setDefaultFieldSortScoring is deprecated and it is just an intermediary solution?\n\nGood, I'll do that.\n\nbq. Also, the tests call this method and set it to true. Since this new method is deprecated, we'll need to change those tests again in 3.0. Can they create TFC instead and call the appropriate search method?\n\nUnfortunately, there were two problems with this (I had started with\nthat):\n\n  * You can't pass Collector through RemoteSearchable, which some\n    tests were using.  We are planning to deprecate & remove\n    RMI/RemoteSearchable from Lucene's core in for 3.0, so we'll fix\n    such tests for 3.0.\n\n  * You can't pass SortField.AUTO directly to TFDC.\n\nSo, since TFDC wasn't a direct drop-in, I decided to add the\ndeprecated method.\n\nI'm actually wondering if we should deprecate SortField.AUTO...?  It's\na little too magical, can easily guess wrong, unexpectedly binds\nSortField to a needing an IndexReader to resolve the AUTO, has caused\nus problems in the past, etc.  I prefer that the API be explicit and\nrequire you to specify what type Lucene should cast the field to.\n",
            "date": "2009-05-27T15:38:31.973+0000",
            "id": 2
        },
        {
            "author": "Earwin Burrfoot",
            "body": "bq. I'm actually wondering if we should deprecate SortField.AUTO...?\n+1",
            "date": "2009-05-27T15:52:25.033+0000",
            "id": 3
        },
        {
            "author": "Shai Erera",
            "body": "+1 here as well (explicitness rules)",
            "date": "2009-05-27T16:08:03.812+0000",
            "id": 4
        }
    ],
    "component": "core/search",
    "description": "In 2.9 we've added the ability to turn off scoring (maxScore &\ntrackScores, separately) when sorting by field.\n\nI expect most apps don't use the scores when sorting by field, and\nthere's a sizable performance gain when scoring is off, so I think for\n2.9 we should not score by default, and add show in CHANGES how to\nenable scoring if you rely on it.\n\nIf there are no objections, I'll commit that change in a day or two\n(it's trivial).\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1656",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "When sorting by field, IndexSearcher should not compute scores by default",
    "systemSpecification": true,
    "version": ""
}