{
    "comments": [
        {
            "author": "Daniel Naber",
            "body": "Created an attachment (id=10948)\nsmall demo that show the bug/irritating behavior\n",
            "date": "2004-03-24T21:01:03.000+0000",
            "id": 0
        },
        {
            "author": "cutting@apache.org",
            "body": "I guess this must be a documentation bug, since it has been raised a few times,\nbut I don't know how to make it any more clear.  The only fields that are stored\nare stored fields.  Before a document has been indexed, it has not been stored,\nso that all fields are present.  When it is retrieved from an index, it has been\nstored, and only stored fields are present.  That's the whole point of the\nstored attribute, to enable control over which fields are stored and which are\ndropped after indexing.",
            "date": "2004-03-25T01:03:51.000+0000",
            "id": 1
        },
        {
            "author": "Daniel Naber",
            "body": "I'll attach a documentation patch and reopen the bug report. ",
            "date": "2004-03-26T01:29:47.000+0000",
            "id": 2
        },
        {
            "author": "Daniel Naber",
            "body": "Created an attachment (id=10994)\ndoc: mention the \"issues\" with store (+some markup for null)\n",
            "date": "2004-03-26T01:31:06.000+0000",
            "id": 3
        },
        {
            "author": "cutting@apache.org",
            "body": "I've amended the javadoc.\n\nSome of your proposed changes were incorrect: un-stored fields are always\navailable before a document is indexed, and never available from a document\nretrieved from an index.\n\nRather than adding a comment to each Document method that accesses Field data (\nsaying that only stored fields are available in documents retrieved from hits) I\nadded a single emphatic comment to this effect at the top.  I also added notes\nto all of the methods which return a document from an index saying that only\nstored fields are returned.  I hope this is satisfactory.\n",
            "date": "2004-03-26T02:51:27.000+0000",
            "id": 4
        }
    ],
    "component": "core/other",
    "description": "Document.fields() only returns stored fields, not those which are indexed but not \nstored. This is confusing, as there's a isStored() Method which doesn't make much \nsense then. \n \nActually fields() returns all fields only just after Document.add(new Field(...)), even the \nones which are not stored. Sounds confusing? :-) I'll attach a small program that \ndemonstrates this. \n \nThis should either be fixed so that all fields are always returned or it should be \ndocumented.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-202",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Document.fields() only returns stored fields",
    "systemSpecification": true,
    "version": ""
}