{
    "comments": [
        {
            "author": "Dawid Weiss",
            "body": "Robert, should I wait for Stempel patch first and then model this one after you? I'm thinking we can reuse most of the code; these stemmers have nearly identical APIs anyway.",
            "date": "2010-03-23T10:44:50.301+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "Dawid, sounds good. I had a few questions, admittedly not having time to look at the code much:\n* Does it support generation as well?\n* Does it expose any morph attributes (e.g. POS) ?",
            "date": "2010-03-23T12:26:22.628+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "oh yeah, and also, what about cases with multiple solutions? does it emit multiple stems?\n",
            "date": "2010-03-23T12:29:37.501+0000",
            "id": 2
        },
        {
            "author": "Dawid Weiss",
            "body": "Oh, I forgot about this -- yes, you're right, it can emit multiple lemmas (including their morphology). An example from the test case:\n\n{noformat}\n\t\tfinal IStemmer s = new PolishStemmer();\n\n\t\tfinal String word = \"liga\";\n\t\tfinal List<WordData> response = s.lookup(word);\n\n\t\tfinal HashSet<String> stems = new HashSet<String>();\n\t\tfinal HashSet<String> tags = new HashSet<String>();\n\n\t\tfor (WordData wd : response) {\n\t\t\tstems.add(wd.getStem().toString());\n\t\t\ttags.add(wd.getTag().toString());\n\t\t\tassertSame(word, wd.getWord());\n\t\t}\n\n\t\tassertTrue(stems.contains(\"ligać\"));\n\t\tassertTrue(stems.contains(\"liga\"));\n\t\tassertTrue(tags.contains(\"subst:sg:nom:f\"));\n\t\tassertTrue(tags.contains(\"verb:fin:sg:ter:imperf\"));\n{noformat}\n\nThis raises the question how we want to handle multiple stems... should they be indexed on overlapping positions?",
            "date": "2010-03-24T09:15:46.111+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "I think overlapping positions makes sense. \nBut this can cause funky scoring for homographs,\nEven if the analysis is legitimately different, tf is wrong.\n\nMaybe solr's removeduplicatesfilter should be recommended\ndown the chain...",
            "date": "2010-03-24T14:23:11.930+0000",
            "id": 4
        },
        {
            "author": "Andrzej Bialecki ",
            "body": "When indexing multiple stems/lemmas (or synonyms in general) at the same positions, in most cases users should also set the Similarity.discoutOverlaps to avoid skewing the lengthNorm-s. I think that it should be mentioned somewhere in the javadocs.",
            "date": "2010-03-24T14:33:32.863+0000",
            "id": 5
        },
        {
            "author": "Robert Muir",
            "body": "Andrzej,\nBy the way, this is now on by default on trunk.\n",
            "date": "2010-03-24T14:47:26.662+0000",
            "id": 6
        },
        {
            "author": "Michał Dybizbański",
            "body": "Hi\n\nThis patch introduces stemming filter and analyzer, that use [Morfologik library|http://morfologik.blogspot.com], developed by Dawid Weiss and Marcin Miłkowski.\nTokens are stemmed by Morfologik with a dictionary, and current distribution provides a dictionary for polish language.\n\nThe MorfologikFilter yields one or more terms for each token. Each of those terms is given the same position in the index.\n\nI'm attaching a binary distribution of the library (morfologik-stemming-1.5.0.jar), that needs to be placed in modules/analysis/morfologik/lib/ subdirectory.\nIt is also available as a [Maven artifact|http://mvnrepository.com/artifact/org.carrot2/morfologik-stemming/1.5.0].\n\nThe library is BSD-licensed and a dictionary uses data from [Polish dictionary for aspell/ispell/myspell (SJP.PL)|http://www.sjp.pl/slownik/en/], which is licensed under GPL, LGPL, MPL and CC SA licenses.\n\nThis is my first contribution to the Lucene project, so please be forgiving :)\nThanks to Dawid for help.\n\nRegards,\n  Michał\n",
            "date": "2011-06-20T21:48:38.395+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "Hi Michał,\n\nThis patch looks great!\n\nI took a quick glance, here are a couple suggestions:\n* In the MorfologikFilter, I think we should implement reset(), first calling the superclass reset(), then clearing the stemsAcc list. This ensures that all of the filter's state is cleared before it is reused. Under normal operations, this should not be necessary, but some consumers in Lucene (e.g. LimitTokenCountFilter, and some similar code in the Highlighter), will only partially consume up to some point, then suddenly stop. By clearing this list in reset() we ensure that there is no chance any leftover stems will appear in the next stream.\n* because the data is licensed under MPL, I think we should explicitly list a hyperlink if possible to the source code used in the NOTICE.txt. I saw you included some wordage in LICENSE.txt but I think this should only say 'XYZ data is under this license, with the actual MPL license text. In the NOTICE.txt we should link to the source code I think... there is some more information on this under the section Category B: Reciprocal Licenses at http://www.apache.org/legal/3party.html\n",
            "date": "2011-06-20T22:15:11.782+0000",
            "id": 8
        },
        {
            "author": "Robert Muir",
            "body": "Sorry, about my second comment i was confusing this with the stuff you have for the morfologik jar itself, which is correct :)\n\nWhat i should have said was, I think we should include this information in the top-level modules/analysis/LICENSE.txt and modules/analysis/NOTICE.txt\n\n\n\n",
            "date": "2011-06-20T22:31:07.689+0000",
            "id": 9
        },
        {
            "author": "Dawid Weiss",
            "body": "Thanks for the contribution, Michał. \n\nRobert: the dictionary is licensed under MPL or CC-SA (to be selected by the user depending on one's needs). Do you know which one is preferable over another?\n\nMichał: there is also another (much larger) dictionary that has been released recently and comes from the Morfeusz project. http://sgjp.pl/morfeusz/dopobrania.html This dictionary is actually licensed under BSD license, so no legal worries at all. Both dictionaries are nearly identical (they differ slightly in their convention of morphosyntactic annotations) and Morfeusz's dictionary could be compiled into an automaton for use with Morfologik.\n\nWhich way should we go? What do you think?",
            "date": "2011-06-21T06:49:38.816+0000",
            "id": 10
        },
        {
            "author": "Dawid Weiss",
            "body": "I'll take a look at the differences between Morfologik and Morfeusz right now, actually. I'll post the results once I have something.",
            "date": "2011-06-21T06:55:21.745+0000",
            "id": 11
        },
        {
            "author": "Dawid Weiss",
            "body": "I did some analyses on both dictionaries.\n{noformat}\nNumber of lines (distict surface forms):\n\n  3.662.366 morfologik.utf8\n  5.086.141 sgjp.utf8\n\nDistinct words (not in both):\n\n  2.729.334 unique.utf8\n\n  - upper/lower case (morfologik has upper case forms, morfeusz only lower case surface forms)\n    \n    acerze\n    Acerze\n\n  - very rare or jargon;\n\n    abszminka\n    abszytowałem\n    acetobakteria\n    acetarsolowi\n    niebombiasto\n    hakatystce\n    hakatystycznościach\n    warzże\n\n  - differences in spelling;\n\n    abelard\n    abélard\n\n  - acronyms and super-short stuff\n\n    aap\n    aar\n\nDictinct normalized (lowercase):\n\n  2.564.366 lowered.utf8\n\n  Most of these are very infrequent words or inflection forms. There are minor differences or\n  missing surface forms in both dictionaries, as in here (mz - morfeusz, mk - morfologik):\n\nmz> hakersko\nmz> hakerskość\nmz> hakerskości\nmz> hakerskością\nmz> hakerskościach\nmz> hakerskościami\nmz> hakerskościom\nmk> hakerstw\nmk> hakerstwa\n...\nmk> hakowałyśmy\nmk> hakowań\nmk> hakowaniach\nmk> hakowaniami\nmk> hakowaniom\nmz> hakowatość\nmz> hakowatości\nmz> hakowatością\nmz> hakowatościach\nmz> hakowatościami\nmz> hakowatościom\n{noformat}\n\nSo... the conclusion is pretty consistent with Zipf's law: both dictionaries have a fairly different coverage, even if they're quite large. We don't have a frequency dictionary for Polish, but I assume most of these surface forms are purely theoretical and occur super-rarely in practice. This said, I think we should use BOTH dictionaries -- after all there's no harm done if we overdo the lemmatization process a little bit, is there?\n\nSo... my proposal would be this: I'll integrate Morfeusz's dictionary in Morfologik (as an alternative dictionary one can load and use). \n\nEventually it would be probably sensible to limit the automaton for use in Lucene to store surface forms and lemmas only (no POS tags) and merge both dictionaries into a single automaton... but this can  be a future improvement.\n\n",
            "date": "2011-06-21T08:21:12.722+0000",
            "id": 12
        },
        {
            "author": "Dawid Weiss",
            "body": "One note wrt patch: I would use an explicit pointer over a list of returned WordData entries instead of adding them to a local list:\n\nprivate List<WordData> stemsAcc = new ArrayList<WordData>();\n\nRight now you're shifting the internal array on each call unnecessarily (just increase an int ptr instead):\n\n+      termAtt.setEmpty().append(stemsAcc.remove(0).getStem().toString());\n\ngetStem() should also be enough since it's a CharSequence, right? No need for an intermediate String.",
            "date": "2011-06-21T08:30:26.136+0000",
            "id": 13
        },
        {
            "author": "Robert Muir",
            "body": "{quote}\nEventually it would be probably sensible to limit the automaton for use in Lucene to store surface forms and lemmas only (no POS tags) and merge both dictionaries into a single automaton... but this can be a future improvement.\n{quote}\n\nor alternatively, you can expose the POS tags for each stem to lucene right, easiest way would be to put it into TypeAttribute (a string), but you could make your own strongly-typed one if thats a better fit.\n \nthis could be useful for downstream processing.\n",
            "date": "2011-06-21T10:00:09.037+0000",
            "id": 14
        },
        {
            "author": "Dawid Weiss",
            "body": "I've just published morfologik 1.5.2, Michał. This comes with two dictionaries (morfologik and morfeusz) that can be used as one (fallback for missing words) or separately, but I would stick to using morfologik as the default dictionary (possibly with an option of using morfeusz?). POS tags have a different notation in these two resources, so mixing both is probably not a good idea.\n\nWill you update the patch? Thanks.",
            "date": "2011-06-21T11:16:43.369+0000",
            "id": 15
        },
        {
            "author": "Michał Dybizbański",
            "body": "Thank you guys for suggestions :)\n\nI've changed the diff to include them:\n\n1. Implemented MorfologikFilter.reset that resets the stemsAcc, and added a test case that would fail in the absence of that implementation, which exhibits the behaviour mentioned by Robert.\n\n2. Updated modules/analysis/NOTICE.txt and modules/analysis/LICENSE.txt - Robert, is that what you meant, or do they need to include more information ?\n\n3. MorfologikFilter now uses an explicit pointer to not modify the stemsAcc on each pass - Dawid, do you think it's reasonable to optimize further and use directly a list returned by IStemmer.lookup (instead of copying with addAll) ? My concern is that (at least in current DictionaryLookup implementation) that list seems to be shared by distinct invocations of the lookup method, which would make the use of a specific IStemmer not applicable in thread-safe code.\n\n4. Removed explicit call to getStem().toString().\n\n\nAs for the new Morfologik version, I've been thinking it would be better to alter the constructors of MorfologikAnalyzer and MorfologikFilter to accept concrete IStemmer implementations, instead of a languageCode String as they do now. This way, org.apache.lucene.analysis.morfologik package wouldn't depend on current implementations of IStemmer (only on the interface), and also allowed future ones to be used without changing the package. What do you think ?\n\nThat could also solve the case of a custom attribute for POS tags (MorfologikPOSAttribute ?) : since a client would instantiate their IStemmer explicitly, they would know the meaning of the attribute's value. That doesn't take into account the DICTIONARY.COMBINED stemmer, but the same seems to apply to the Morfologik library itself (I mean, for a specific WordData from IStemmer.lookup there is no information on which of the internal concrete DictionaryLookup it comes from). Dawid - what do you think of that issue ?\n",
            "date": "2011-06-21T21:16:09.154+0000",
            "id": 16
        },
        {
            "author": "Dawid Weiss",
            "body": "bq. Dawid, do you think it's reasonable to optimize further and use directly a list returned by IStemmer.lookup (instead of copying with addAll) ? My concern is that (at least in current DictionaryLookup implementation) that list seems to be shared by distinct invocations of the lookup method, which would make the use of a specific IStemmer not applicable in thread-safe code.\n\nIStemmer implementations are not thread safe anyway, so there is no problem in reusing that list. In fact, the returned WordData objects are reused internally as well, so you can't store them either (this is done to avoid GC overhead). \n\nSo yes: I missed that, but you'll need to ensure IStemmer instances are not shared. This can be done in various ways (thread local, etc), but I think the simplest way to do it would be to instantiate PolishStemmer at the MorfologikFilter level. This is cheap (the dictionary is loaded once anyway). \n\nYou can then create two constructors in the analyzer -- one with PolishStemmer.DICTIONARY and one with the default (I'd suggest MORFOLOGIK). Exposing IStemmer constructor will do more harm than good -- thinking ahead is good, but in this case I don't think there'll be this many people interested in subclassing IStemmer (if anything, they'll plug into Lucene's infrastructure directly).\n\nA simple test case spawning 5 or 10 threads in a parallel executor and crunching stems on the same analyzer would also be nice to ensure we have everything correct wrt multithreading, but it's not that crucial if you don't have the time to write it.\n\nThanks!",
            "date": "2011-06-22T06:56:38.028+0000",
            "id": 17
        },
        {
            "author": "Michał Dybizbański",
            "body": "Dawid, as you suggested, I've changed the interface to MorfologikAnalyzer and MorfologikFilter to account for the changes in Morfologik 1.5.2, namely the multiple dictionaries.\nBoth those classes' constructors now accept a PolishStemmer.DICTIONARY (instead of languageCode String as in previous patch). A PolishStemmer object is instantiated by MorfologikFilter, so each invocation of MorfologikAnalyzer.createComponents (which instantiates MorfologikFilter) is coupled with an individual instance of PolishStemmer.\nThis way, sharing a MorfologikAnalyzer by separate threads is safe (even though MorfologikFilter itself isn't thread-safe) provided each thread obtains its own TokenStreamComponents through ReusableAnalyzerBase.createComponents (is this always the case ? looking at other filters, thay don't look thread-safe neither ..)\n",
            "date": "2011-06-27T20:18:51.330+0000",
            "id": 18
        },
        {
            "author": "Robert Muir",
            "body": "{quote}\nprovided each thread obtains its own TokenStreamComponents through ReusableAnalyzerBase.createComponents (is this always the case ? looking at other filters, thay don't look thread-safe neither ..)\n{quote}\n\nyes, its the case that Analyzer/ReusableAnalyzerBase take care of this with a threadlocal, as long as each thread only needs to use one tokenstream at a time (which is true for all lucene consumers), see:\nhttp://svn.apache.org/repos/asf/lucene/dev/trunk/lucene/src/java/org/apache/lucene/analysis/Analyzer.java\n",
            "date": "2011-06-28T02:49:37.340+0000",
            "id": 19
        },
        {
            "author": "Dawid Weiss",
            "body": "Working on the integration, will provide a final patch before committing. Thanks Michał.",
            "date": "2011-06-28T10:16:05.216+0000",
            "id": 20
        },
        {
            "author": "Dawid Weiss",
            "body": "Updated patch. A few minor corrections and performance considerations (no intermediate strings). Updated eclipse classpath template.",
            "date": "2011-06-28T10:45:23.336+0000",
            "id": 21
        },
        {
            "author": "Dawid Weiss",
            "body": "I've cleaned up the patch, but I'd still address the two TODOs that I left in the code:\n\n- lowercasing should be done not at the external filter level, but inside the filter as a fallback IF AND ONLY IF the original sequence is not found in the dictionary. Morfeusz and Morfologik do have uppercase surface forms and do treat them differently (returning uppercase lemmas, for example). A test for this would be nice as well. An example of an uppercase/mixed surface form: AGD, Aaron, Poznania.\n\n- I'd expose another attribute with morphosyntactic annotations -- this is something that is there anyway, so why not expose it.\n\nI attached a git diff, but it should apply with patch -p1 < ... too. Michał, will you have the time to polish this off?",
            "date": "2011-06-28T10:50:09.004+0000",
            "id": 22
        },
        {
            "author": "Michał Dybizbański",
            "body": "Dawid, I'm attaching a patch with the suggested changes:\n\n1. MorfologikAnalyzer now doesn't use a LowerCaseFilter. When IStemmer.lookup returns an empty list for an originally cased token, another lookup is made for lowercased one. I hope the test case reflects your intentions.\n\n2. I've added MorfologikPOSAttributeImpl class that provides information about morphosyntactic annotations for each lemma, obtained with WordData.getTag(). A test provides a short insight for potential users. Two notes here:\n  a) Since MorfologikPOSAttribute might be unused, I've implemented it in terms of CharSequence (and not String), to not convert prematurely each POS tag to String.\n  b) Currently a default POS (for a nonlemmatized token) is an empty String, however null value might be more distinctive if empty POS tags for lemma were allowed.\n\nBTW, the patch deletes one line from dev-tools/eclipse/dot.classpath (<classpathentry kind=\"src\" path=\"modules/queries/src/test\"/>) - was that intentional ?\n",
            "date": "2011-06-28T21:30:29.887+0000",
            "id": 23
        },
        {
            "author": "Dawid Weiss",
            "body": "Thanks Michał. I'll review it later today and commit in if there are no objections. As for the deleted line -- yes, it was intentional; we'll piggyback in this patch unless somebody fixes it earlier, no problem.\n\nDawid",
            "date": "2011-06-29T06:47:04.283+0000",
            "id": 24
        },
        {
            "author": "Dawid Weiss",
            "body": "You do like those pesky .toString() calls, don't you? :) I replaced the code slightly to keep char. sequences only; no need to create new objects. I also changed the impl. a bit to go from the start of the returned list -> theoretically, lemmas should be ordered by probability (in practice it's not the case, but may be in the future).\n\nAll looks good, committed in. Thanks!",
            "date": "2011-06-29T09:25:13.432+0000",
            "id": 25
        },
        {
            "author": "Dawid Weiss",
            "body": "Needs to wait for official support for 1.6 on the trunk.",
            "date": "2011-06-29T09:58:58.095+0000",
            "id": 26
        },
        {
            "author": "Dawid Weiss",
            "body": "Final patch for this issue. Needs to wait for 1.6 support.",
            "date": "2011-06-29T10:02:44.724+0000",
            "id": 27
        },
        {
            "author": "Dawid Weiss",
            "body": "In trunk. Long live 1.6 support.",
            "date": "2011-06-30T19:16:46.532+0000",
            "id": 28
        },
        {
            "author": "Michał Dybizbański",
            "body": "Thanks :)",
            "date": "2011-07-02T22:37:16.275+0000",
            "id": 29
        }
    ],
    "component": "modules/analysis",
    "description": "Dawid Weiss mentioned on LUCENE-2298 that there is another Polish stemmer available:\nhttp://sourceforge.net/projects/morfologik/\n\nThis works differently than LUCENE-2298, and ideally would be another option for users.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2341",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "explore morfologik integration",
    "systemSpecification": true,
    "version": ""
}