{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "btw, if no one objects, I would like to commit this and LUCENE-2058 tomorrow.\n\nWith both of these we should be able to run relevance tests without writing java code.",
            "date": "2009-11-12T22:26:08.025+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "H... committing! I want to start the release process :-)\n\nI think both patches look good.",
            "date": "2009-11-12T22:55:19.020+0000",
            "id": 1
        },
        {
            "author": "Robert Muir",
            "body": "Thanks Uwe, I don't know much outside of the quality (searching) portion of the benchmark package, so I appreciate the review.\n\nBut I am trying to (ab)use the benchmark pkg so I don't have to write code to index a relevance collection :)",
            "date": "2009-11-12T22:57:42.866+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "I see no problem with disabling the doc name suffix. I think, you want to use it simply to build an index using benchmark which is perfectly fine.",
            "date": "2009-11-12T23:27:12.385+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "Uwe, ok thanks. is it ok if i commit these in a few hours?\n\nIf you want to start release process right now, then I can do it immediately instead.",
            "date": "2009-11-12T23:35:39.385+0000",
            "id": 4
        },
        {
            "author": "Uwe Schindler",
            "body": "You have time. I will do some RM practise tomorrow and will hopefully start on saturday/sunday. There are some more issues open.",
            "date": "2009-11-12T23:38:35.537+0000",
            "id": 5
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 835677.",
            "date": "2009-11-13T00:47:33.745+0000",
            "id": 6
        }
    ],
    "component": "",
    "description": "TrecContentSource currently appends 'iteration number' to the docname field.\nExample: if the original docname is DOC0001 then it will be indexed as DOC0001_0\n\nthis presents a problem for relevance testing, because when judging results, the expected docname will never be present.\nThis patch adds an option to disable this behavior, defaulting to the existing behavior (which is to append the iteration number).\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2059",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "benchmark pkg: allow TrecContentSource not to change the docname",
    "systemSpecification": true,
    "version": ""
}