{
    "comments": [
        {
            "author": "Simon Willnauer",
            "body": "I added a [jenkins build|https://builds.apache.org/hudson/job/Lucene-Solr-tests-only-realtime_search-branch/] that runs every 4 hours to give the RT branch some exercise. I added my email address and buschmi to the recipients if the build fails.... if you wanna be added let me know. \nFrom now on we should only commit bugfixes, documentation and merges with trunk to this branch. From my point of view there is only one blocker left here (LUCENE-3028) so the remaining work is mainly reviewing the current state and polishing the javadocs. I will go over IW, IR and DW java docs as a start.",
            "date": "2011-04-14T12:18:36.075+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "Why not just email dev@ when it fails?  Since it will soon land I think all should feel pain when it fails ;)",
            "date": "2011-04-14T13:01:37.298+0000",
            "id": 1
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. Why not just email dev@ when it fails? Since it will soon land I think all should feel pain when it fails \ntrue, done!",
            "date": "2011-04-14T14:42:53.360+0000",
            "id": 2
        },
        {
            "author": "Simon Willnauer",
            "body": "selckin thanks for reporting those failures... I fixed the TestIndexWriterException ones in LUCENE-3031 and LUCENE-3032. The TestOmitTf failure caused by a recently fixed bug on trunk (LUCENE-3027) which I haven't merged into RT branch yet. I just did the merge and that fixes that issue too. I will commit the merge in a minute\n\nThe issues you are reporting with addIndexes I can not reproduce though... I will spin off issues for them.",
            "date": "2011-04-15T08:55:40.511+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "Attached patch.\n\nI made a pass through the diffs of RT vs trunk, and made a bunch of small fixes (eg whitespace, typos) but there were places I had real questions so I put // nocommits in...\n\nCan we rename Healthiness -> DocumentsWriterStallControl (or something like that)?\n\nI think we lost this infoStream output from trunk?\n\n{noformat}\n\n        message(\"  ramUsed=\" + nf.format(startMBUsed) + \" MB\" +\n                \" newFlushedSize=\" + nf.format(newSegmentSize) + \" MB\" +\n                \" (\" + nf.format(newSegmentSizeNoStore) + \" MB w/o doc stores)\" +\n                \" docs/MB=\" + nf.format(numDocs / newSegmentSize) +\n                \" new/old=\" + nf.format(100.0 * newSegmentSizeNoStore / startMBUsed) + \"%\");\n{noformat}\n\nIt's looking good!",
            "date": "2011-04-15T10:37:47.410+0000",
            "id": 4
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. Attached patch.\nawesome mike, I think you should commit that patch and we iterate once we are back from vacation?\nThe RT hudson build tolerates //nocommit \n\nbq. I think we lost this infoStream output from trunk?\ndo you recall where it was?\n\nbq. Can we rename Healthiness -> DocumentsWriterStallControl (or something like that)?\nsure go ahead can you rename the test to testStalled instead of testHealthiness\n\nbq. It's looking good!\n\nI think we are reasonably close!",
            "date": "2011-04-15T17:11:02.390+0000",
            "id": 5
        },
        {
            "author": "selckin",
            "body": "fyi, since last night's trunk merge (r1092636) not a single test has failed in my 'while true; ant clean test'  (addIndexes LUCENE-3033 has not failed since either)",
            "date": "2011-04-16T09:18:21.974+0000",
            "id": 6
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. fyi, since last night's trunk merge (r1092636) not a single test has failed in my 'while true; ant clean test' (addIndexes LUCENE-3033 has not failed since either)\nawesome... thanks for reporting back!\n\nbq. Attached patch.\nmike I committed your patch to the branch so we can iterate!",
            "date": "2011-04-19T07:52:53.646+0000",
            "id": 7
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. mike I committed your patch to the branch so we can iterate!\nI just committed some fixes and added javadoc to several classes. We are down to 0 nocommits!! Yay!",
            "date": "2011-04-26T11:42:11.548+0000",
            "id": 8
        },
        {
            "author": "Robert Muir",
            "body": "I was helping Simon look at reintegrating this branch (produce a patch for easy review, etc), but I found some problems.\n\n1. it looks like some commits were marked as merged from trunk, but not actually merged. so if we reintegrate into trunk we will lose some changes.\n2. some files have lost their svn:eol-style, which makes the comparison.... difficult.\n\nI'm looking at these issues now.",
            "date": "2011-04-27T19:18:33.324+0000",
            "id": 9
        },
        {
            "author": "Robert Muir",
            "body": "ok, i think these issues are resolved. I'm attaching the script Mike wrote that I used for checking that we don't lose any changes (I think its the same script we used for the flex branch).\n\nthe way I did it is to checkout a/ and b/, reintegrate the branch into b/, and run the script to produce a huge patch. if some things look suspicious like they are \"lost\" changes, then i reverse apply the huge patch to the branch with eclipse and only selectively apply those lost changes and then commit.\n",
            "date": "2011-04-27T23:12:53.670+0000",
            "id": 10
        },
        {
            "author": "Robert Muir",
            "body": "Attached is the DWPT branch in patch format against trunk (for easier reviewing).\n",
            "date": "2011-04-28T01:44:55.508+0000",
            "id": 11
        },
        {
            "author": "Robert Muir",
            "body": "What about TestIndexWriter.testIndexingThenDeleting?\n\nI noticed in the branch the test method is changed to _testIndexingThenDeleting (disabled).\n\nHowever, if i re-enable it (rename it back) it never seems to finish...",
            "date": "2011-04-28T01:58:32.582+0000",
            "id": 12
        },
        {
            "author": "Simon Willnauer",
            "body": "{quote}\nI noticed in the branch the test method is changed to _testIndexingThenDeleting (disabled).\n\nHowever, if i re-enable it (rename it back) it never seems to finish...\n{quote}\n\nI just reenabled, fixed and committed that testcase on branch.",
            "date": "2011-04-28T06:23:46.872+0000",
            "id": 13
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. Attached is the DWPT branch in patch format against trunk (for easier reviewing).\nAwesome, Thanks Robert!!!",
            "date": "2011-04-28T06:27:29.899+0000",
            "id": 14
        },
        {
            "author": "Simon Willnauer",
            "body": "I went through IW and IWC jdocs to bring them uptodate. here is a patch against the branch... Review from a native speaker would be very much welcome ",
            "date": "2011-04-28T08:26:13.505+0000",
            "id": 15
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. Can we rename Healthiness -> DocumentsWriterStallControl (or something like that)?\nI added a TODO for this - lets do that on trunk\n\nbq. I think we lost this infoStream output from trunk?\njust committed a fix for this to reenable it on branch.. kind of tricky since we now flush concurrently NumberFormat must be accessed single threaded. So I added it to DWPT#flush()",
            "date": "2011-04-28T09:26:30.845+0000",
            "id": 16
        },
        {
            "author": "Simon Willnauer",
            "body": "FYI - I committed the javadoc changes to branch after mikes +1 on IRC. I also marked IWC#setIndexerThreadPool as expert API",
            "date": "2011-04-28T09:38:45.330+0000",
            "id": 17
        },
        {
            "author": "Robert Muir",
            "body": "attached (LUCENE-3023_svndiff.patch) is just the output from 'svn diff' after merging, for reviewing property changes and similar police work :)\n",
            "date": "2011-04-28T11:19:45.832+0000",
            "id": 18
        },
        {
            "author": "Simon Willnauer",
            "body": "here is my first review round. I manually ported some missed merges from trunk and fixed some really minor things.\n\nI will commit shortly to branch if nobody objects",
            "date": "2011-04-28T12:19:20.045+0000",
            "id": 19
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. I will commit shortly to branch if nobody objects\ncommitted... robert is running a new reintegration round now",
            "date": "2011-04-28T12:57:36.565+0000",
            "id": 20
        },
        {
            "author": "Robert Muir",
            "body": "I resynced up to r1097442 and here are the latest patches (the full patch and the svn diff)",
            "date": "2011-04-28T17:34:58.969+0000",
            "id": 21
        },
        {
            "author": "Michael McCandless",
            "body": "Modified the Python script a bit to do a recursive diff b/w two dirs to make an applyable patch -- added a usage, and a -skipWhitespace option.\n\nI put it under a new 'dev-tools/scripts' dir...",
            "date": "2011-04-28T18:05:14.265+0000",
            "id": 22
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. I put it under a new 'dev-tools/scripts' dir...\n+1\nmike can you add a little doc string to the script explaining what it does and how to use it? I think we should also have a wiki page that explains how to reintegrate a branch just like we have one for merging changes into a branch.\n",
            "date": "2011-04-29T07:33:09.524+0000",
            "id": 23
        },
        {
            "author": "Simon Willnauer",
            "body": "here is my first cut at CHANGES.TXT for landing on trunk. Review would be much appreciated.",
            "date": "2011-04-29T09:21:27.823+0000",
            "id": 24
        },
        {
            "author": "Michael McCandless",
            "body": "Iteration on diffSources.py -- adds usage line, copyright header.  I think it's ready to be committed!",
            "date": "2011-04-29T09:38:55.782+0000",
            "id": 25
        },
        {
            "author": "Michael McCandless",
            "body": "Small edits to Simon's CHANGES entry.",
            "date": "2011-04-29T09:56:00.037+0000",
            "id": 26
        },
        {
            "author": "Simon Willnauer",
            "body": "I committed the CHANGES.TXT patch to branch. I think we should freeze the branch now so robert can create a last final patch. We should let that patch linger around for a while, yet I plan to commit this to trunk on monday. Good work everybody! ",
            "date": "2011-04-29T10:21:35.122+0000",
            "id": 27
        },
        {
            "author": "Uwe Schindler",
            "body": "I merged the freezed branch again.\n\nAttached is a first patch for reviewing code changes (not SVN diff), created by the following command between 2 fresh checkouts, one of them \"svn merge --reintegrate\":\n\n{noformat}\ndiff -urNb --strip-trailing-cr trunk-lusolr1 trunk-lusolr2 | filterdiff -x \"*.svn*\" --strip 1 --clean > LUCENE-3023.patch\n{noformat}\n\nThis patch is not intended to be applied, its more to verify the changes (therefore all whitespace changes created by merging were excluded). ",
            "date": "2011-04-29T13:17:11.026+0000",
            "id": 28
        },
        {
            "author": "Uwe Schindler",
            "body": "Here is the final SVN diff. To work around some itches with SVN, the following was done:\n- reverted everything outside lucene sub folder\n- used the previously created manual diff to get a list of all changed files (using patchutils command lsdiff)\n- used \"svn -q status | sed 's/^........//' > ../svn-files.txt\" to get all files affected after merge\n- intersect both files (lsdiff and svn status one) to find all files that are in reality unchanged, but still affected by SVN (these are all files that were added after branching - this is a known limitation of SVN. Files added after branching are \"replaced\" by merge reintegrate, loosing all history). Store those files in unchanged.txt\n- use the intersected filelist and revert everything: cat ../unchanged.txt | xargs svn revert\n- finally do a record-only merge again to fix mergeprops reverted by the previous revert\n\nMy checkout is now ready to commit.\n\nIf we have some minor problems with the patch, please wait with fixing after commit. If there are serious problems, we can fix them in realtime branch and merge manuall (I can do that later).",
            "date": "2011-04-29T14:15:34.425+0000",
            "id": 29
        },
        {
            "author": "Uwe Schindler",
            "body": "Here finally all whitespace changes in one patch. They will be committed, but are not included in the main patch.",
            "date": "2011-04-29T14:31:36.274+0000",
            "id": 30
        },
        {
            "author": "Michael Busch",
            "body": "Just wanted to say: you guys totally rock! Great teamwork here with all the work involved of getting the branch merged back. I'm sorry I couldn't help much in the last few weeks.",
            "date": "2011-04-29T16:14:25.764+0000",
            "id": 31
        },
        {
            "author": "Yonik Seeley",
            "body": "This looks awesome guys!\n\nI've started some ad-hoc testing via Solr.\nA single threaded CSV upload (bulk indexing... no real-time reopens)\nlooks pretty much the same, and doing 2 CSV uploads at once was\n36% faster (a bit apples-to-oranges since the number of resulting\nsegments was also higher... but even still, looks like a good improvement!)\n",
            "date": "2011-04-29T18:49:20.166+0000",
            "id": 32
        },
        {
            "author": "Michael McCandless",
            "body": "+1 to commit!  Great work everyone :)",
            "date": "2011-04-29T21:55:40.387+0000",
            "id": 33
        },
        {
            "author": "Simon Willnauer",
            "body": "+1 to commit... I reviewed one more time - looks good :)",
            "date": "2011-04-30T17:57:51.173+0000",
            "id": 34
        },
        {
            "author": "Yonik Seeley",
            "body": "+1! (after a not-so-thorough review ;-)",
            "date": "2011-04-30T21:52:28.167+0000",
            "id": 35
        },
        {
            "author": "Michael Busch",
            "body": "Just a few minor comments, otherwise +1 to commit! (I'm super excited this is finally happening after the branch was created a year ago or so!)\n\n* In DocumentsWriterPerThreadPool: \nremove: {code}\n+  //public abstract void clearThreadBindings(ThreadState perThread);\n+\n+  //public abstract void clearAllThreadBindings();\n+\n{code}\n\n* In ThreadAffinityDocumentsWriterThreadPool#getAndLock() we had talked about switching from a per-threadstate queue (safeway model) to a single queue (whole foods). I'm wondering if we should do that before we commit or change that later as a separate patch?\n\n* remove some commented out code in TestFlushByRamOrCountsPolicy#testHealthyness",
            "date": "2011-05-01T05:28:24.588+0000",
            "id": 36
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. In ThreadAffinityDocumentsWriterThreadPool#getAndLock() we had talked about switching from a per-threadstate queue (safeway model) to a single queue (whole foods). I'm wondering if we should do that before we commit or change that later as a separate patch?\n\nI will create a new issue for this I don't think this should block the commit merge!\n\nall other minor stuff can be done after committing. I will take care of these issues.\n",
            "date": "2011-05-01T08:21:13.154+0000",
            "id": 37
        },
        {
            "author": "Uwe Schindler",
            "body": "Thanks Simon!\n\nAs noted before, this is minor and should be done after the merge was committed, else it would produce lot of useless work :(\n\nI will commit this tomorrow morning MEST.\n\nAfter committing, I will move the branch as a new SVN tag (realtime_DWPT_latest or like that) and if somebody wants to start again with more realtime work, we should branch again (according to the SVN book: a reintegrated branch cannot be used for development anymore and should be removed).",
            "date": "2011-05-01T10:08:42.611+0000",
            "id": 38
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed merged branch to trunk revision: 1098427\nMoved branch away as tag in revision: 1098428",
            "date": "2011-05-01T22:41:29.427+0000",
            "id": 39
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. In ThreadAffinityDocumentsWriterThreadPool#getAndLock() we had talked about switching from a per-threadstate queue (safeway model) to a single queue (whole foods). I'm wondering if we should do that before we commit or change that later as a separate patch?\n\nI opened LUCENE-3060 for this. @buschmi maybe you can add some more info to that issue if you recall the discussion?\n\n{quote}\nCommitted merged branch to trunk revision: 1098427\nMoved branch away as tag in revision: 1098428\n{quote}\n\nAWESOME! :)",
            "date": "2011-05-02T08:20:52.414+0000",
            "id": 40
        },
        {
            "author": "Uwe Schindler",
            "body": "The first full Jenkins Build also succeeded. When reviewing the first Clover Build report, I noticed 2 new final classes, that have no code coverage at all (see [https://builds.apache.org/hudson/job/Lucene-trunk/1549/clover-report/org/apache/lucene/index/pkg-summary.html]):\n\n- DocFieldConsumers\t\n- DocFieldConsumersPerField\n\nI am not sure if those are old relicts (dead code) or newly added ones, but not yet used.",
            "date": "2011-05-02T08:37:35.301+0000",
            "id": 41
        },
        {
            "author": "Uwe Schindler",
            "body": "I reopen this one, as the merge added a reincarnation of quicksort in DocFieldProcessor (which was previously removed in the corresponding *PerThread class, but lost during the merge).\n\nI will fix soon.",
            "date": "2011-05-02T14:19:16.158+0000",
            "id": 42
        },
        {
            "author": "Uwe Schindler",
            "body": "Here the patch. Will commit soon.",
            "date": "2011-05-02T14:19:48.661+0000",
            "id": 43
        },
        {
            "author": "Uwe Schindler",
            "body": "Removed quicksort in revision 1098592",
            "date": "2011-05-02T14:23:03.812+0000",
            "id": 44
        },
        {
            "author": "Michael McCandless",
            "body": "This cutover to concurrent flushing (DWPT) produces astounding\nincreases in indexing throughput:\n\n  http://people.apache.org/~mikemccand/lucenebench/indexing.html\n\n186 GB plain text per hour (from 101 GB/hour the day before)!!!\n\nIt's not every day you see an 84% jump in indexing throughput!  Wow.\n\nThis is on a machine that has substantial CPU+IO concurrency, ie, it\nwas bottlenecked by our non-concurrent flush.\n\nAlso, I can now tune up the IW settings I use in those nightly\nbenchmarks; it's now 6 threads and \"only\" 512 MB RAM buffer.  I'll\nwait a few days and then do that.\n\nLooks like a few queries got a bit slower... I suspect this is because\nthe index segment count has changed.  Before concurrent flushing it\nwas this:\n{noformat}\n36(4.0):C4977400 _69(4.0):C4977400 _9c(4.0):C4977400 _cf(4.0):C4977400 _fi(4.0):C4977400 _fq(4.0):C497740 _g1(4.0):C497740 _gc(4.0):C497740 _gn(4.0):C497740 _gy(4.0):C497740 _gx(4.0):C49774 _gz(4.0):C49774 _h0(4.0):C49774 _h1(4.0):C49774 _h2(4.0):C49774 _h3(4.0):C468\n{noformat}\n\nAfter concurrent flushing:\n{noformat}\n_3d(4.0):C4977400 _6h(4.0):C4977400 _9j(4.0):C4977400 _cn(4.0):C4977400 _fq(4.0):C4977400 _fu(4.0):C497740 _g6(4.0):C497740 _gh(4.0):C497740 _gs(4.0):C497740 _h2(4.0):C497740 _gy(4.0):C49774 _gz(4.0):C49774 _h0(4.0):C49774 _h5(4.0):C4105 _1(4.0):C2627 _h4(4.0):C16331 _h3(4.0):C28728 _h1(4.0):C48225\n{noformat}\n\nSo we have 2 extra segments... it's interesting how this affects some\nqueries but not others.\n",
            "date": "2011-05-03T17:24:29.767+0000",
            "id": 45
        }
    ],
    "component": "",
    "description": "With LUCENE-2956 we have resolved the last remaining issue for LUCENE-2324 so we can proceed landing the DWPT development on trunk soon. I think one of the bigger issues here is to make sure that all JavaDocs for IW etc. are still correct though. I will start going through that first.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3023",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "OTHER",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Land DWPT on trunk",
    "systemSpecification": true,
    "version": "4.0-ALPHA, CSF branch"
}