{
    "comments": [
        {
            "author": "Mark Harwood",
            "body": "Junit test",
            "date": "2008-11-11T14:53:13.164+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "Sneaky!\n\nThere is indeed a bug here, but once we fix it, you won't be able to\ndo rollback by opening the latest commit point.\n\nBut, LUCENE-1411 (recently committed to 2.9) will work: it lets you\nopen IndexWriter on an arbitrary commit point.\n\nYour deletion policy then gets to decide what to do with the now\nfuture commit points (ie, you can keep them around), and when you next\ncommit, it's written to the segments_N after all future commit points.\nIe, it's like using svn to revert a bunch of changes: the changes\nstill live in prior commit points; it's just that your next commit has\nremoved those changes.\n\nConceptually, when IndexWriter opens and loads a commit point, either\none you explicitly specified, or, the most recent one by default, it\nholds open a private in-memory-only commit point which you can't\ndelete.  You can delete the commit points on disk, but the one in\nmemory is private to IndexWriter and moves forward as segments are\nflushed, merged, etc.  When IndexWriter commits, it makes a new\non-disk commit point that's a copy of the in-memory one.\n\nThis bug is happening because when IndexWriter commits (during close),\nit thinks there are no pending changes and so does nothing.  But,\nthere was a change (you removed the last commit point), and so I think\nwe should mark doing so as a real change.  What this will mean is\nIndexWriter will simply write the next segments_N file which is a copy\nof the one you had just deleted.\n",
            "date": "2008-11-11T16:13:21.102+0000",
            "id": 1
        },
        {
            "author": "Mark Harwood",
            "body": "Thanks for the pointers, Mike.\n\nThis new test now passes having made a few changes.",
            "date": "2008-11-11T18:11:29.958+0000",
            "id": 2
        },
        {
            "author": "Michael McCandless",
            "body": "Excellent!\n\nI modified your test -- cleaned up whitespace, removed the @author tag, and put back a modified failing test case from your original (to show the bug that we still need to fix).\n\nNext I'll work on fixing the bug so that test case passes.",
            "date": "2008-11-11T21:45:20.693+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "OK I attached a new patch, this time including the simple fix, which is for IndexWriter to mark itself as having pending changes whenever the head commit point gets deleted by the deletion policy on init.\n\nI will commit shortly.",
            "date": "2008-11-11T22:10:59.075+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "Committed revision 713206.\n\nThanks Mark!",
            "date": "2008-11-11T22:42:34.760+0000",
            "id": 5
        }
    ],
    "component": "core/index",
    "description": "I have been looking to provide the ability to rollback committed transactions and encountered some issues.\nI appreciate IndexDeletionPolicy's main motivation is to handle cleaning away OLD commit points but it does not explicitly state that it can or cannot be used to clean NEW commit points.\n\nIf this is not supported then the documentation should ideally state this. If the intention is to support this behaviour then read on .......\n\nThere seem to be 2 issues so far:\n1) The first attempt to call IndexCommit.delete on the latest commit point fails to remove any contents. The subsequent call succeeds however\n2) Deleting the latest commit point fails to update the segments.gen file to point to segments_N-1. New IndexReaders that are opened are then misdirected to open segments_N which has been deleted\n\nJunit test to follow...\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1449",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "IndexDeletionPolicy.delete behaves incorrectly when deleting latest generation ",
    "systemSpecification": true,
    "version": "2.9"
}