{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "I think this is an easy win for some common use cases from the API perspective.\n\nIf no one objects i'll commit in a few days.",
            "date": "2011-02-09T22:35:06.835+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 1069977.",
            "date": "2011-02-11T22:52:19.232+0000",
            "id": 1
        }
    ],
    "component": "core/queryparser",
    "description": "Note: this patch changes no behavior, just makes QP more subclassable.\n\nCurrently we have Query getFieldQuery(String field, String queryText, boolean quoted)\nThis contains very hairy methods for producing a query from QP's analyzer.\n\nI propose we factor this into newFieldQuery(Analyzer analyzer, String field, String queryText, boolean quoted)\nThen getFieldQuery just calls newFieldQuery(this.analyzer, field, queryText, quoted);\n\nThe reasoning is: it can be quite useful to consider the double quote as more than phrases, but a \"more exact\" search.\nIn the case the user quoted the terms, you might want to analyze the text with an alternate analyzer that:\ndoesn't produce synonyms, doesnt decompose compounds, doesn't use WordDelimiterFilter \n(you would need to be using preserveOriginal=true at index time for the WDF one), etc etc.\n\nThis is similar to the way google's double quote operator works, its not defined as phrase but \"this exact wording or phrase\".\nFor example compare results to a query of tests versus \"tests\".\n\nCurrently you can do this without heavy code duplication, but really only if you make a separate field (which is wasteful),\nand make your custom QP lie about its field... in the examples I listed above you can do this with a single field, yet still\nhave a more exact phrase search.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2892",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Add QueryParser.newFieldQuery",
    "systemSpecification": true,
    "version": ""
}