{
    "comments": [
        {
            "author": "Uwe Schindler",
            "body": "Pastch with the first three points. The three deprecated methods should stay alive in my opinion. Copying the string to the termbuffer in the ctor is the same linke copying the initial termbuffer. If we remove these ctors, we should also remove the setTermBuffer(String) method. This is no consistency.\n\nIf the others agree to keep these three ctors alive I will apply an undeprecation in 2.9 branch.",
            "date": "2009-10-16T21:36:52.780+0000",
            "id": 0
        },
        {
            "author": "Uwe Schindler",
            "body": "Updated patch to last generics additions",
            "date": "2009-10-17T10:01:04.879+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "New patch. Will commit soon (+bw branch). I will also commit the un-depreactions to 2.9 branch.\n\nStill open are the StopFilter/StopAnalyzer patches (not sure, how to proceed here).",
            "date": "2009-10-18T10:26:16.618+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed revision: 826404 and also in 2.9 branch.",
            "date": "2009-10-18T10:38:30.164+0000",
            "id": 3
        },
        {
            "author": "Uwe Schindler",
            "body": "Mike:\nYou invented the VERSION constants for StandardAnalyzer and so on. How should we handle the deprecated settings inside? Just remove the get/setters and only use the version constant to enable the backwards settings? If I remove these settings internally in StopAnalyzer and StopFilter and Standard*, too, I also have to remove some version support.\n\nHow would you proceed?\n\nFurthermore: The \"deprecated\" check for overridden tokenStream methods to fix this bug, if somebody subclasses a core-Analyzer, what to do with them. As the tokenStream methods is not deprecated in favour of reusableTokenStream, how to prevent this in future. Keep this reflection checks? Or make the Analyzers final?",
            "date": "2009-10-18T12:02:27.629+0000",
            "id": 4
        },
        {
            "author": "Michael McCandless",
            "body": "bq. How should we handle the deprecated settings inside? \n\nFor \"replace invalid acronym\" in StandardAnalyzer, there is no version setting that enables that currently, so I'm afraid we must keep those until 4.0 (since they impact your index by altering analysis)?  Or, maybe we could add a Versions.LUCENE_23, which'd re-enable that bug (the default for that setting changed to \"true\" (= fix the bug) in 2.4).  Hmm.\n\nFor \"stop position increments\" in StandardAnalyzer, I think we should remove the direct getter/setters and expose only Versions.LUCENE_24 to get back to that behavior?\n\nStopFilter should keep its \"stop position increments\" setting (it's not deprecated).",
            "date": "2009-10-18T13:28:17.348+0000",
            "id": 5
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Or make the Analyzers final?\n\n+1",
            "date": "2009-10-18T13:29:47.923+0000",
            "id": 6
        },
        {
            "author": "Uwe Schindler",
            "body": "Hallo Mike,\n\nattached is a patch with all deprecated methods removed (only the setOverridesTokenStream is still there, making Analyzers final is another thing to do).\n\nAlso StopFilter and its stopWord ets were generified (to <?>, which is ok for every type of set, as CharArraySet uses toString() to convert everything to string when testing, so any set is fine)\n\nI only had the following problems and solution is here (StandardAnalyzer):\n{code}\nenableStopPositionIncrements = matchVersion.onOrAfter(Version.LUCENE_29);\nreplaceInvalidAcronym = matchVersion.onOrAfter(Version.LUCENE_23);\n{code}\n\nThe setting defaultPosIncr was removed (static method, so there is no default anymore). Because of that, the pre 2.9 default was false (which is now not changeable). So I set the posIncr to false for all older versions (this was the default before, but is now fixed as no static setter/sysprop anymore)\n\nFor the invalid acronyms I added LUCENE_23 version constant, so for all versions >=2.3 it is enabled. If you want old behaviour, use LUCENE_22 or below.\n\nMike: Can you review this?\n\nIf you're ok with it I have to change 175 \"new StandardAnalyzer()\" occurences in tests :(",
            "date": "2009-10-19T09:40:32.137+0000",
            "id": 7
        },
        {
            "author": "Uwe Schindler",
            "body": "If we are fine with that, I would backport the version constants and the default setting to 2.9.x",
            "date": "2009-10-19T09:41:20.476+0000",
            "id": 8
        },
        {
            "author": "Uwe Schindler",
            "body": "Correct patch.",
            "date": "2009-10-19T09:44:37.664+0000",
            "id": 9
        },
        {
            "author": "Michael McCandless",
            "body": "I'll have a look, but one thing is invalid acronym replacement should be enabled if version >= 2.4, not >= 2.3.  Ie, if version is 2.3, the bug is still present.",
            "date": "2009-10-19T09:46:09.409+0000",
            "id": 10
        },
        {
            "author": "Uwe Schindler",
            "body": "LUCENE-1068 says: Fix version 2.3",
            "date": "2009-10-19T09:53:49.397+0000",
            "id": 11
        },
        {
            "author": "Uwe Schindler",
            "body": "Javadocs fixes.",
            "date": "2009-10-19T09:54:33.230+0000",
            "id": 12
        },
        {
            "author": "Michael McCandless",
            "body": "Why add 2.0, 2.1. 2.2 versions?  We don't anywhere emulate bugs based on those, right?  Otherwise, patch looks great!  Thanks Uwe.  Nice to see StandardAnalyzer clean again.",
            "date": "2009-10-19T09:54:40.622+0000",
            "id": 13
        },
        {
            "author": "Uwe Schindler",
            "body": "I just added also 20 and 21. I can remove them again (20 and 21).\n22 is needed because the invalidAcronym thing is there in 2.2 and fixed in 2.3 (according to LUCENE-1068).",
            "date": "2009-10-19T09:57:27.736+0000",
            "id": 14
        },
        {
            "author": "Michael McCandless",
            "body": "bq. LUCENE-1068 says: Fix version 2.3\n\nRight, that bug was fixed in 2.3, however with that fix the buggy behavior was kept by default.  In 2.4 we then fixed the default to be true, ie, the bug would be fixed by default.  So if I were to specify VERSION_23, I should get the buggy behavior, but if I specify VERSION_24, I should get the correct behavior.\n\nGoing forward, when we fix a bug but need to conditionally preserve the bug for back compat, we should use the version switching so that by default for new users (VERSION_CURRENT or VERSION_XX if XX is the next release) the bug is fixed.",
            "date": "2009-10-19T09:59:26.147+0000",
            "id": 15
        },
        {
            "author": "Uwe Schindler",
            "body": "Updated patch with LUCENE_24. I did not remove the other version constants, because then we have them and can use them anywhere else. And a user coming from e.g. 2.2 to 3.0 can just use LUCENE_22 to match his old behaviour. The user should be free to give his version he used before for this backwards compatibility.\n\nMike: Should I backport the setting for 2.4 to 2.9 to enable plugin-replacements from 2.9.1 to 3.0?",
            "date": "2009-10-19T10:09:40.604+0000",
            "id": 16
        },
        {
            "author": "Uwe Schindler",
            "body": "bq. Going forward, when we fix a bug but need to conditionally preserve the bug for back compat, we should use the version switching so that by default for new users (VERSION_CURRENT or VERSION_XX if XX is the next release) the bug is fixed.\n\nDo you mean I should add the default ctor of StandardAnalyzer() and rewire it to LUCENE_CURRENT? We have to put this in the docs, that from 3.0 on, the standard analyzer's default ctor now no longer behaves like 2.4, but always uses the newest features.\n\nThat would help me lot with the tests....",
            "date": "2009-10-19T10:13:41.005+0000",
            "id": 17
        },
        {
            "author": "Michael McCandless",
            "body": "bq. I did not remove the other version constants, because then we have them and can use them anywhere else. And a user coming from e.g. 2.2 to 3.0 can just use LUCENE_22 to match his old behaviour. The user should be free to give his version he used before for this backwards compatibility.\n\nOK I think that's reasonable.\n\nbq. Mike: Should I backport the setting for 2.4 to 2.9 to enable plugin-replacements from 2.9.1 to 3.0?\n\n+1\n\n{quote}\nbq. Going forward, when we fix a bug but need to conditionally preserve the bug for back compat, we should use the version switching so that by default for new users (VERSION_CURRENT or VERSION_XX if XX is the next release) the bug is fixed.\n\nDo you mean I should add the default ctor of StandardAnalyzer() and rewire it to LUCENE_CURRENT?\n{quote}\n\nSorry, I wasn't clear...\n\nNo -- I don't think we should ever have a ctor that defaults to LUCENE_CURRENT.  That's a back compat trap (and it just gets us back to where we started when we had no explicit version).  Users must be explicit about which version they want.\n\nWhat I meant was: when fixing some sneaky bug in the future, we should never set the default so that the bug is still present (as we did on the first go of \"invalid acronyms\"), expecting new users to realize they have to go out of their way to tell Lucene not to emulate the bug.  Instead, the default going forward (if version >= next-release-version) should be \"the bug is fixed\".",
            "date": "2009-10-19T11:44:35.196+0000",
            "id": 18
        },
        {
            "author": "Uwe Schindler",
            "body": "OK, I fix the tests using find/grep/sed :-)",
            "date": "2009-10-19T11:58:32.801+0000",
            "id": 19
        },
        {
            "author": "Uwe Schindler",
            "body": "Here 2 mega patches and one backport to 2.9 (want to get this in before 2.9.1):\n\nAll core tests pass, all bw tests pass. Most contrib tests also pass, but we have the following problems and inconsistencies:\n\n- benchmark does not work any longer, because StandardAnalyzer has no default ctor anymore and cannot be instantiated by reflection, same with StopAnalyzer\n- Highlighter only works, if StandardAnalyzer is in 2.4 mde, in 2.9 mode (current) it fails because the position increments of stop words are not correctly respected. This fails in addition/combination with the following:\n- Very bad inconsistency: The default of QueryParser is to ignore position increments, but the current version of StandardAnalyzer uses posIncr for stop words -> bäng. We should change the default for QueryParser(+ contrib QP), too. There is march rework needed and much documentation. The tests in core now pass, as most parts use StandardAnalyzer in 2.9 mode but have no stop words. And the special tests explicitely set the posIncr flag. This is totally disturbed, it needs fixing! (it also affects 2.9.0, if somebody uses the new StandardAnalyzer with LUCENE_CURRENT). \n- XMLQueryParser also fails with latest StandardAnalyzer version, because it cannot set the flag in QueryParser. In my opinion, the query parser should take the flag from the analyzer, but this is not easy to fix.\n- All contrib analyzers have stopWordPosIncr turned off (backwards compatibility). Maybe we need a Version Parameter in all analyzers there too!\n\nWhat to do? After this StopFilter/StandardAnalyzer-hell-day Aspirin and Paracetamol and beer is not enough to think clear again...\n\nAnd please: next time when we deprecate APIs: remove all deprecated calls from tests and contrib and mark all deprecated-test as such!",
            "date": "2009-10-19T17:52:17.685+0000",
            "id": 20
        },
        {
            "author": "Robert Muir",
            "body": "bq. All contrib analyzers have stopWordPosIncr turned off (backwards compatibility). Maybe we need a Version Parameter in all analyzers there too! \n\nPersonally I would not be against this, not sure yet... downside would be more complexity and maintenance\nUpside would be that we could improve these analyzers in various ways, without annoying users\n\nbq. benchmark does not work any longer, because StandardAnalyzer has no default ctor anymore and cannot be instantiated by reflection, same with StopAnalyzer \nI also personally like having default ctor... its convienient and nice to be able to look at what these analyzers do in Luke, etc\nBut I think this goes against the version flag concept? (because if users just set it to LUCENE_CURRENT then its doing nothing?)\nBut I wonder if users do this anyway... maybe the default should really be LUCENE_CURRENT, and if you want the back compat-buggy behavior, the onus is on you as the user to set the flag right if you don't want to reindex?\n\n",
            "date": "2009-10-19T18:17:22.911+0000",
            "id": 21
        },
        {
            "author": "Michael McCandless",
            "body": "bq. All contrib analyzers have stopWordPosIncr turned off (backwards compatibility). Maybe we need a Version Parameter in all analyzers there too!\n\nUgh, this is because they embed StopFilter, right?  One option might be to simply keep StopFilter's deprecated static methods for setting the default?  Though I think adding Version to them over time is the right thing to do (though more work, today).\n\nbq. benchmark does not work any longer, because StandardAnalyzer has no default ctor anymore and cannot be instantiated by reflection, same with StopAnalyzer\n\nWhen the no-arg ctor is unavailable, can we fallback to looking for a ctor that takes Version?  For now we should just pass LUCENE_CURRENT; a future enhancement to benchmark can allow specifying version compat.\n\nbq. The default of QueryParser is to ignore position increments, but the current version of StandardAnalyzer uses posIncr for stop words\n\nHmm.  How about adding Version to QP ctor?\n\nbq. And please: next time when we deprecate APIs: remove all deprecated calls from tests and contrib and mark all deprecated-test as such!\n\nOK, I agree.  I'll try to do this in the future!\n",
            "date": "2009-10-19T18:53:44.799+0000",
            "id": 22
        },
        {
            "author": "Michael McCandless",
            "body": "bq. maybe the default should really be LUCENE_CURRENT, and if you want the back compat-buggy behavior, the onus is on you as the user to set the flag right if you don't want to reindex?\n\nThe problem is that this is not very different from saying \"the onus is on the user to call the setXYZ method to get back  to the old buggy behavior\", which at least last time we discussed back-compat was controversial (ie, it's a change to our drop-in back-compat policy).",
            "date": "2009-10-19T18:56:43.463+0000",
            "id": 23
        },
        {
            "author": "Robert Muir",
            "body": "bq. Ugh, this is because they embed StopFilter, right? One option might be to simply keep StopFilter's deprecated static methods for setting the default? Though I think adding Version to them over time is the right thing to do (though more work, today).\n\nnot just this. Many use StandardTokenizer, so they have same invalid acronym, etc issues StandardAnalyzer has. But, this versioning/etc is all managed at StandardAnalyzer level (system properties, version numbers, etc)... when it also affects these other analyzers too.",
            "date": "2009-10-19T18:58:53.979+0000",
            "id": 24
        },
        {
            "author": "Robert Muir",
            "body": "bq. The problem is that this is not very different from saying \"the onus is on the user to call the setXYZ method to get back to the old buggy behavior\", which at least last time we discussed back-compat was controversial (ie, it's a change to our drop-in back-compat policy).\n\nMichael, yes I agree with you. What I am wondering is: is it really working in practice/in spirit? Forcing the user to supply the version, well it does make them look at the warning in the Version class, which is good.  But nothing stops them from just using CURRENT.\n\n{noformat}\nUse this to get the latest & greatest settings, bug fixes, etc, for Lucene.\n{noformat}\n\nfollowed by the big bold warning about backwards compatibility. just curious what most users are doing, sacrificing drop-in for \"latest and greatest?\"\n\nI do think we should do things to improve contrib analyzers that are still stuck with this buggy behavior at some point: i.e LUCENE-1373.\nBut maybe we don't need the Version with contrib analyzers, since you should be able to use an older lucene-analyzers jar file with new lucene if you want the back compat????\n\n(sorry to stray somewhat off-topic)\n",
            "date": "2009-10-19T19:23:46.342+0000",
            "id": 25
        },
        {
            "author": "Uwe Schindler",
            "body": "To move back to my other problem:\nHow to handle the problem with LUCENE_29 setting and the posIncr of stopwords together with QueryParser that has a default setting of ignoring posIncr?:\n\nThis leads to the problem, that a phrase query does not hit anything if you index with StandardAnalyzer=LUCENE_29 and QueryParser using the same analyzer but with setEnablePositionIncrements(false) [the current default for QueryParser].",
            "date": "2009-10-19T21:12:13.829+0000",
            "id": 26
        },
        {
            "author": "Michael McCandless",
            "body": "bq. How to handle the problem with LUCENE_29 setting and the posIncr of stopwords together with QueryParser that has a default setting of ignoring posIncr?\n\nHow about adding required Version to QP ctor?",
            "date": "2009-10-20T11:51:02.775+0000",
            "id": 27
        },
        {
            "author": "Uwe Schindler",
            "body": "A new patch which resolves the Benchmark problem by adding a static method in NewAnalyzerTask that loads an analyzer by class name:\n{code}\npublic static final Analyzer createAnalyzer(String className) throws Exception{\n    final Class<? extends Analyzer> clazz = Class.forName(className).asSubclass(Analyzer.class);\n    try {\n      // first try to use a ctor with version parameter (needed for many new Analyzers that have no default one anymore\n      Constructor<? extends Analyzer> cnstr = clazz.getConstructor(Version.class);\n      return cnstr.newInstance(Version.LUCENE_CURRENT);\n    } catch (NoSuchMethodException nsme) {\n      // otherwise use default ctor\n      return clazz.newInstance();\n    }\n}\n{code}\n\nThis method is reused at other places where an Analyzer is created by a config property.\n\nThis patch now passes all test. There are still the problems with Analyzer and QueryParsr with wrong default properties, but I would like to commit this first and then solve the problems, also in 2.9.1.\n\nMike, are you OK with that?",
            "date": "2009-10-21T10:26:25.851+0000",
            "id": 28
        },
        {
            "author": "Michael McCandless",
            "body": "bq. Mike, are you OK with that?\n\nLooks great!  Not only am I OK with it, it's exactly what I proposed (above -- https://issues.apache.org/jira/browse/LUCENE-1987?focusedCommentId=12767449&page=com.atlassian.jira.plugin.system.issuetabpanels%3Acomment-tabpanel#action_12767449).  Maybe you missed my response there?  (I also suggested adding Version to QP ctor).",
            "date": "2009-10-21T10:35:58.405+0000",
            "id": 29
        },
        {
            "author": "Uwe Schindler",
            "body": "I have seen your comment yesterday and implemented the benchmark thing that way.\n\nThe QP ctor with Version param also looks good, but we have to add this to 2.9, too, to be able to remove the no-arg ctor, too.\n\nMy patch still has a failed test int the ant task (missing no-arg ctor), will look into it, but fix is same like for benchmark.",
            "date": "2009-10-21T11:21:37.212+0000",
            "id": 30
        },
        {
            "author": "Uwe Schindler",
            "body": "Fix ant task.",
            "date": "2009-10-21T11:33:01.697+0000",
            "id": 31
        },
        {
            "author": "Uwe Schindler",
            "body": "Committed in 2.9, 3.0, backwards branch.\n\nFor the QueryParser problems and other additions of version constants I will open another issue.",
            "date": "2009-10-21T12:13:11.178+0000",
            "id": 32
        },
        {
            "author": "Michael McCandless",
            "body": "Bulk close all 2.9.1 issues.",
            "date": "2009-11-07T14:57:30.576+0000",
            "id": 33
        }
    ],
    "component": "modules/analysis",
    "description": "These removes the rest of the deprecations in the analysis package:\n- -Token's termText field-- (DONE)\n- -eventually un-deprecate ctors of Token taking Strings (they are still useful) -> if yes remove deprec in 2.9.1- (DONE)\n- -remove CharacterCache and use Character.valueOf() from Java5- (DONE)\n- Stopwords lists\n- Remove the backwards settings from analyzers (acronym, posIncr,...). They are deprecated, but we still have the VERSION constants. Do not know, how to proceed. Keep the settings alive for index compatibility? Or remove it together with the version constants (which were undeprecated).",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-1987",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Remove rest of analysis deprecations (Token, CharacterCache)",
    "systemSpecification": true,
    "version": ""
}