{
    "comments": [
        {
            "author": "Martijn van Groningen",
            "body": "Attached initial IDV AbstractAllGroupsCollector implementation.",
            "date": "2011-10-07T12:42:59.788+0000",
            "id": 0
        },
        {
            "author": "Simon Willnauer",
            "body": "hey martjin, do yo have some benchmark results for IDV showing the impact? I would guess that depending on the type ie. var vs. fixed size you could see some perf hits. We might need to round up the packedint sizes inside IDV for lookup perf and pay the prize for a slightly larger size on disk / memory.",
            "date": "2011-10-07T12:59:03.467+0000",
            "id": 1
        },
        {
            "author": "Martijn van Groningen",
            "body": "Up until now I only checked the difference between BYTES_VAR_SORTED and BYTES_FIXED_SORTED. The search time and memory usage seem to be more or less the same. I executed all queries on 30M index and the performance with grouping by IDV is somewhere between 500 ms and 550 ms. The same test with grouping by indexed values have search times somewhere between 300 ms and 330 ms.\n\nbq. We might need to round up the packedint sizes inside IDV for lookup perf and pay the prize for a slightly larger size on disk / memory.\nI think we need this. Just like we have with FC#getTermsIndex(). A boolean option that either uses PackedInt or DirectInt. I think the ~200 ms difference is b/c IDV is using PackedInt and FC uses DirectInt.\n",
            "date": "2011-10-07T16:39:04.279+0000",
            "id": 2
        },
        {
            "author": "Simon Willnauer",
            "body": "martjin, here is a patch that forces the sorted variants to use fixed size packed ints. can you check if the perf changes?",
            "date": "2011-10-07T18:29:25.921+0000",
            "id": 3
        },
        {
            "author": "Martijn van Groningen",
            "body": "Simon, this looks great!\nThe performance is much better now. An average the search time for grouping by BYTES_VAR_SORTED is 329 ms and BYTES_FIXED_SORTED is 338 ms. The average search time for grouping by indexed values is 310 ms. So grouping by IDV is pretty close to grouping by indexed values!",
            "date": "2011-10-07T19:08:53.503+0000",
            "id": 4
        },
        {
            "author": "Yonik Seeley",
            "body": "Wow, only a 9% performance penalty for not keeping the values in the JVM heap?  That's quite an achievement (and almost hard to believe, unless the base query were really expensive or something).  Nice job!",
            "date": "2011-10-07T20:23:56.897+0000",
            "id": 5
        },
        {
            "author": "Simon Willnauer",
            "body": "bq.Wow, only a 9% performance penalty for not keeping the values in the JVM heap? That's quite an achievement (and almost hard to believe, unless the base query were really expensive or something). Nice job!\n\nwait! this is in memory - martjin can you test with getDirectSource() instead of getSource()?",
            "date": "2011-10-07T21:06:10.125+0000",
            "id": 6
        },
        {
            "author": "Martijn van Groningen",
            "body": "getDirectSource() search times:\n* BYTES_VAR_SORTED: 455 ms\n* BYTES_FIXED_SORTED: 713 ms\n\nI noticed that with BYTES_VAR_SORTED the memory usage varied a lot during the test execution from around 10MB to 320MB. The memory usage for BYTES_FIXED_SORTED is stable around 10MB. \n\nI'll try to use luceneutil and modify it to benchmark grouping by IDV, so others can run performance tests as well. ",
            "date": "2011-10-09T19:46:28.690+0000",
            "id": 7
        },
        {
            "author": "Martijn van Groningen",
            "body": "Minor update to IndexDocValuesAllGroupsCollector to use disk resident IDV.",
            "date": "2011-10-09T19:56:02.653+0000",
            "id": 8
        },
        {
            "author": "Michael McCandless",
            "body": "It's great that rounding up to 8/16/32/64 bit width resolved the performance problem!\n\nI think we need to make this (RAM vs CPU tradeoff) settable by the app, at indexing time?",
            "date": "2011-10-11T12:42:52.110+0000",
            "id": 9
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. I think we need to make this (RAM vs CPU tradeoff) settable by the app, at indexing time?\n\nI think we should do that. Maybe via IWC?\n\n\nbq. I noticed that with BYTES_VAR_SORTED the memory usage varied a lot during the test execution from around 10MB to 320MB. The memory usage for BYTES_FIXED_SORTED is stable around 10MB.\n\nyeah, the VAR_SORTED variant loads the ords in memory which is wrong though. However, LUCENE-3507 is adressing this issue.\n\none thing I noticed about the patch is that you consider 0 ords as null values which is not the case in IDV. All documents do have values, there is nothing like missing values. VAR_BYTES will return a 0-length byte and FIXED_BYTES will return a fixed-length 0-byte array. Numeric variants default to 0 and 0.0 receptively.\n",
            "date": "2011-10-11T17:33:30.032+0000",
            "id": 10
        },
        {
            "author": "Michael McCandless",
            "body": "{quote}\nbq. I think we need to make this (RAM vs CPU tradeoff) settable by the app, at indexing time?\n\nI think we should do that. Maybe via IWC?\n{quote}\n\nThat seems good?  I think it should default to rounding up?  Apps that want to tune RAM usage down can then change the default.",
            "date": "2011-10-11T18:20:32.042+0000",
            "id": 11
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. That seems good? I think it should default to rounding up? Apps that want to tune RAM usage down can then change the default.\n\n+1 I will create an issue",
            "date": "2011-10-11T18:30:28.068+0000",
            "id": 12
        },
        {
            "author": "Simon Willnauer",
            "body": "bq. +1 I will create an issue\n\nFYI - LUCENE-3509",
            "date": "2011-10-11T18:37:45.239+0000",
            "id": 13
        },
        {
            "author": "Martijn van Groningen",
            "body": "bq. one thing I noticed about the patch is that you consider 0 ords as null values which is not the case in IDV.\nI changed that in the new patch.\nI also included IDV implementation for AbstractFirstPassGroupingCollector.\n\nI think it is time to include these collectors into the already existing tests. Besides that we need IDV implementations for AbstractSecondPassGroupingCollector and AbstractAllGroupHeadsCollector.",
            "date": "2011-10-11T21:14:16.171+0000",
            "id": 14
        },
        {
            "author": "Martijn van Groningen",
            "body": "After a svn update (that includes changes for LUCENE-3507) the heap usage for grouping by BYTES_VAR_SORTED IDV and using disk resident values is much more stable! It stays between 5MB and 16MB and the average search time is around 580ms.",
            "date": "2011-10-12T21:53:44.749+0000",
            "id": 15
        },
        {
            "author": "Martijn van Groningen",
            "body": "Updated patch to work with the trunk.",
            "date": "2011-10-12T21:55:54.237+0000",
            "id": 16
        },
        {
            "author": "Martijn van Groningen",
            "body": "Updated patch. Added idv implementation for second pass grouping collector. Also the tests have been changed to randomly select an idv based implementation when possible (tests now choose randomly between term, idv and function based implementations).",
            "date": "2011-10-21T14:24:53.603+0000",
            "id": 17
        },
        {
            "author": "Martijn van Groningen",
            "body": "Updated patch. Moved Simon's changes to force the use of the sorted variants to use fixed size packed ints to LUCENE-3509.",
            "date": "2011-10-23T20:32:56.651+0000",
            "id": 18
        },
        {
            "author": "Martijn van Groningen",
            "body": "I think this can be committed soon. The fixed size packed ints options for DV will be further improved in LUCENE-3509.",
            "date": "2011-11-02T20:27:06.148+0000",
            "id": 19
        },
        {
            "author": "Simon Willnauer",
            "body": "Martjin, the last patch looks ok to me. you should go ahead and commit this...",
            "date": "2011-11-14T10:32:10.770+0000",
            "id": 20
        },
        {
            "author": "Martijn van Groningen",
            "body": "I was planning on doing this. I'm almost ready to commit it. I'm only a bit stuck on documents that don't have a value for a group field.\n\nThe random grouping tests also add documents with a null value for the group field and an empty string for the group field. This works fine with the term based implementations, but not the DV based implementations (random test fail). Should we not use null as group value if the dv based implementations are used during the test?",
            "date": "2011-11-14T15:35:12.415+0000",
            "id": 21
        },
        {
            "author": "Martijn van Groningen",
            "body": "Updated patch.\n* All tests pass now.\n* Added dv based impl for AllGroupHeadCollector.\n\nI will commit this soon.",
            "date": "2011-11-23T23:07:54.468+0000",
            "id": 22
        },
        {
            "author": "Martijn van Groningen",
            "body": "Committed to trunk.",
            "date": "2011-11-24T19:08:24.479+0000",
            "id": 23
        }
    ],
    "component": "modules/grouping",
    "description": "Although IDV is not yet finalized (More particular the SortedSource). I think we already can discuss / investigate implementing grouping by IDV.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-3496",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Support grouping by IndexDocValues",
    "systemSpecification": true,
    "version": ""
}