{
    "comments": [
        {
            "author": "Grant Ingersoll",
            "body": "I am working on the nightly build stuff, etc.  My plan is to start hosting versions under the \"Site Versions\" section.  I originally planned for Official and Nightly, but Chris and Doron have suggested other versions as well.  I see no reason why we can't have other versions similar to the way other projects do it in Apache-land.\n\nI see two issues that have been discussed and would like some feedback on.\n\n1.  Make the official website be the nightly build website.  The only issue I have w/ this is that it is possible for the nightly build to fail, which could leave the site stale.  Not a big deal as it isn't likely to be radically different, just something to be aware of.\n\n2.  I would suggest the following links under Site Versions:\nOfficial \n2.0\n1.9.1\n1.9\n1.4.3\n",
            "date": "2006-11-29T13:51:14.000+0000",
            "id": 0
        },
        {
            "author": "Doron Cohen",
            "body": "Could \"official\" be the most recent release (currently 2.0)? \n\nSo there would be:\n Official (2.0)\n Nightly\n 1.9.1\n 1.9\n 1.4.3\n\nThis way everyday users would not have to get into trunk_/_svn details for understanding what docs they are seeing. \n",
            "date": "2006-11-29T17:09:50.000+0000",
            "id": 1
        },
        {
            "author": "Doug Cutting",
            "body": "According to Apache policy, nightly builds must not be easily confused with releases.\n\nhttp://www.apache.org/dev/release.html#what\n\nThus links to nightly builds should be confined to 'developer' portions of the site, and not included on 'download' pages.",
            "date": "2006-11-29T20:13:00.000+0000",
            "id": 2
        },
        {
            "author": "Grant Ingersoll",
            "body": "Doug,\n\nHow about I take the nightly build and source download off of http://lucene.apache.org/java/docs/releases.html and create a Developers section with a page full of links of developer's resources: the nightly build, the source download instructions, how to contribute, etc.\n\n-Grant",
            "date": "2006-11-29T21:39:56.000+0000",
            "id": 3
        },
        {
            "author": "Hoss Man",
            "body": "maybe there is some confusion as to the purpose of this issue ... i was under the impression that Grant's primary goal was to make it possible for the site to host nightly builds of the *documentation* ... ie: the \"static\" docs (like features.html, fileformats.html and gettingstarted.html) and the \"dynamic\" javadocs ... so that it was possible to easily access this information for the \"trunk\" seperate and distinctly from the previous versions of hte same information included with the most recent release(s).\n\nThis biggest question seems to be what is the \"default\" ... as we've already seen with the current site, it's very hard to have the \"main\" versions of the site pages allways reflect the last stable release, because some of htep ages (news, whoweare, etc...) need to rev more frequently then that.\n\nAs i suggested in email, i think the \"default\" URLs for various docs, ie...\n\n   http://lucene.apache.org/java/docs/api/\n   http://lucene.apache.org/java/docs/gettingstarted.html\n   http://lucene.apache.org/java/docs/fileformats.html\n\n...should reflect the most current version of hte information available, presumably generated as part of the nightly build process (that way the javadocs which might link to the static files or vice-versa are allways in sync)\n\nDocumentation for recent releases (regardless of whether they are the most recent or not) should be available using URLs with the release number in them...\n\n   http://lucene.apache.org/java/2.0-docs/api/\n   http://lucene.apache.org/java/2.0-docs/gettingstarted.html\n   http://lucene.apache.org/java/2.0-docs/fileformats.html\n\nUsing the \"Site Versions\" left nav element to link to the various versions...\n\n Nightly -> \"./\"\n Stable (2.0) -> \"../2.0-docs/\"\n 1.9.1 -> \"../1.9.1-docs\"\n 1.9 -> \"../1.9-docs\"\n 1.4.3 -> \"../14.3-docs\"\n\n...people have expressed skepticism at the idea that the \"default\" site documentation would be for the trunk instead of the last stable release, but that seems like the simplest most straight forward way for things to work.  People lookingfor information about a specific release have it readily available 9and unlike in the past: it will be available at a URL that will never change on them)\n",
            "date": "2006-11-29T22:11:40.000+0000",
            "id": 4
        },
        {
            "author": "Grant Ingersoll",
            "body": "I have updated/committed the nightly.sh script to not only build the nightly distribution, but it also updates the web site, located at people.a.o and to run/generate the clover test coverage reports.  (See http://wiki.apache.org/jakarta-lucene/HowNightlyBuildsAreMade) \n\nNightly builds are now handled by my crontab on lucene.zones.a.o.\n\nThe main Lucene website, starting tonight (actually in 45 mins or so, as I ran one last test to make sure it works), should now reflect the nightly build of the website.  Links to specific releases are available from the menu on the left (Site Versions).  Clover code coverage reports should be generated nightly and are linked to from the Developers page of the Resources section.    This means we will no longer have to sync the website.  It should all be automatic.\n\nI have updated http://wiki.apache.org/jakarta-lucene/ReleaseTodo  but since I have never done a release, I would appreciate it if someone who has will review the new instructions (steps 12 and 13)\n\nIf all goes well tonight I will put up a new news item on the site, make an announcement on user mailing list and then close out this issue.\n",
            "date": "2006-12-21T19:31:24.000+0000",
            "id": 5
        },
        {
            "author": "Grant Ingersoll",
            "body": "Nightly build distribution of binary jars should not contain instrumented classes from Clover.",
            "date": "2006-12-22T21:20:35.000+0000",
            "id": 6
        },
        {
            "author": "Grant Ingersoll",
            "body": "OK, I think this is up and running sufficiently to resolve this issue.  Have updated nightly.sh to update the website and the clover test reports.",
            "date": "2006-12-29T14:27:46.000+0000",
            "id": 7
        },
        {
            "author": "Tim Patton",
            "body": "The latest version of the nigthly build #45 (4/6/2007) contains references to Clover.",
            "date": "2007-04-06T15:30:12.818+0000",
            "id": 8
        },
        {
            "author": "Grant Ingersoll",
            "body": "Thanks, Tim.  We are looking into it.  We are converting to use  \nHudson, so there may be a few bumps along the way.\n\n\n\n\n--------------------------\nGrant Ingersoll\nCenter for Natural Language Processing\nhttp://www.cnlp.org\n\nRead the Lucene Java FAQ at http://wiki.apache.org/jakarta-lucene/ \nLuceneFAQ\n\n\n",
            "date": "2007-04-06T17:25:32.574+0000",
            "id": 9
        }
    ],
    "component": "general/website",
    "description": "Per discussion on mailing list, we are going to setup a Nightly Build link on the website linking to the docs (and javadocs) generated by the nightly build process.  The build process may need to be modified to complete this task.\n\nGoing forward, the main website will, for the most part, only be updated per releases (I imagine exceptions will be made for News items and per committer's discretion).  The Javadocs linked to from the main website will always be for the latest release.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-708",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Setup nightly build website links and docs",
    "systemSpecification": true,
    "version": ""
}