{
    "comments": [
        {
            "author": "Daniel Naber",
            "body": "I'm not sure if most people use DateTools already, as it has just been added in Lucene 1.9. Maybe you could consider an option (yes, yet another option isn't nice, I know)? Otherwise we need to properly document how to continue using DateField, i.e. by extending QueryParser and overwriting this method I guess.\n",
            "date": "2006-11-29T21:32:49.000+0000",
            "id": 0
        },
        {
            "author": "Hoss Man",
            "body": "cleanest way to be backwards compatible would be to not have an initial default Resolution, and use DateField if no Resolution can be found for the field specified.  Existing clients would still get DateField for all dates, clients that add a call to setDateResolution(\"foo\", BAR); would get a DateTools formated query with resolution BAR for field foo, but other pre-existing fields would still use DateField, and clients that call setDateResolution(BAR); would allways get a DateTools formatted query, either at resolution BAR or at some other resolution if they also use the two arg setDateResolution",
            "date": "2006-11-29T21:51:08.000+0000",
            "id": 1
        },
        {
            "author": "Michael Busch",
            "body": "Actually it is documented in the QueryParser how to use a different format for dates:\n\n   ...\n    * feature also assumes that your index uses the {@link DateTools} class to store dates.\n    * If you use a different format and you still want QueryParser\n    * to turn local dates in range queries into valid queries you need to create your own\n    * query parser that inherits QueryParser and overwrites\n    * {@link #getRangeQuery(String, String, String, boolean)}.\n   ...\n\nAnd the javadoc of DateField says:\n\n   Deprecated. If you build a new index, use DateTools instead. This class is included for use with existing indices and will be removed in a future release.\n\nSo the question is in how many future releases we want to support DateField. If we still want to support it in 2.1 I agree to Hoss that his suggestion would be a nice and clean way to do that and I can easily change the patch accordingly. It avoids having another option in QueryParser.",
            "date": "2006-11-29T22:25:06.000+0000",
            "id": 2
        },
        {
            "author": "Michael Busch",
            "body": "This new patch contains the changes suggested by Hoss:\n- by default the QueryParser uses DateField to format dates for all fields\n- if a date resolution has been set using void setDateResolution(DateTools.Resolution) then DateTools is used for all fields with the given resolution\n- if a field specific date resolution has been set using setDateResolution(String, DateTools.Resolution) then DateTools is used for the given field with the given date resolution; other fields are not affected\n\nSo with this patch the behaviour of QueryParser does not change unless either setDateResolution(DateTools.Resolution) or setDateResolution(String, DateTools.Resolution) have been called.",
            "date": "2006-12-05T00:00:02.000+0000",
            "id": 3
        },
        {
            "author": "Michael Busch",
            "body": "Changed the summary to better reflect the second version of the patch.",
            "date": "2006-12-05T00:01:37.000+0000",
            "id": 4
        },
        {
            "author": "Hoss Man",
            "body": "+1 for queryparser_datetools2.patch\n\nthe only nitpick i have is with the class level javadocs...\n\n  * <p>In {@link RangeQuery}s, QueryParser tries to detect date values, e.g. <tt>date:[6/1/2005 TO 6/4/2005]</tt>\n  * produces a range query that searches for \"date\" fields between 2005-06-01 and 2005-06-04. Note\n  * that the format of the accepted input depends on {@link #setLocale(Locale) the locale}.\n  * By default a date is formatted using the deprecated {@link DateField} for compatibility reasons.\n  * To use the new {@link DateTools} to format dates, a {@link DateTools.Resolution} has to be set.</p>\n  * <p>The date resolution that shall be used for RangeQueries can be set using {@link #setDateResolution(DateTools.Resolution)\n\n\n...the word \"format\" is used to mean two very differnet things in this paragraph, we should clean that up so it's clera that Locale determines the DateFormat QP uses when trying to parse input  in [a TO b] syntax, while either DateField or DateTools are used to create the \"indexed\" value queried against.",
            "date": "2006-12-06T22:38:56.000+0000",
            "id": 5
        },
        {
            "author": "Michael Busch",
            "body": "You're right Hoss, the word \"format\" is used ambiguously in the javadoc. We could change it to\n\n * <p>In {@link RangeQuery}s, QueryParser tries to detect date values, e.g. <tt>date:[6/1/2005 TO 6/4/2005]</tt>\n * produces a range query that searches for \"date\" fields between 2005-06-01 and 2005-06-04. Note\n * that the format of the accepted input depends on {@link #setLocale(Locale) the locale}. \n * By default a date is converted into a search term using the deprecated {@link DateField} for compatibility reasons.\n * To use the new {@link DateTools} to convert dates, a {@link DateTools.Resolution} has to be set.</p> \n * <p>The date resolution that shall be used for RangeQueries can be set using {@link #setDateResolution(DateTools.Resolution)}\n * or {@link #setDateResolution(String, DateTools.Resolution)}. The former sets the default date resolution for all fields, whereas the latter can\n * be used to set field specific date resolutions. Field specific date resolutions take, if set, precedence over the default date resolution.\n * </p>\n * <p>If you use neither {@link DateField} nor {@link DateTools} in your index, you can create your own\n * query parser that inherits QueryParser and overwrites {@link #getRangeQuery(String, String, String, boolean)} to\n * use a different method for date conversion.\n * </p> \n\nSounds better? Do you want me to create another patch that includes this javadoc?",
            "date": "2006-12-08T01:48:13.000+0000",
            "id": 6
        },
        {
            "author": "Hoss Man",
            "body": "I've commited queryparser_datetools2.patch with two changes...\n\n1) revised the class level javadocs based on Michael's last comment.\n2) reinstated the old TestQueryParser.testDateRange() as testLegacyDateRange() to attempt to future proof against breaking backwards compatibility.",
            "date": "2007-01-08T20:05:42.542+0000",
            "id": 7
        }
    ],
    "component": "core/queryparser",
    "description": "The QueryParser currently uses the deprecated class DateField to create RangeQueries with date values. However, most users probably use DateTools to store date values in their indexes, because this is the recommended way since DateField has been deprecated. In that case RangeQueries with date values produced by the QueryParser won't work with those indexes.\n\nThis patch replaces the use of DateField in QueryParser by DateTools. Because DateTools can produce date values with different resolutions, this patch adds the following methods to QueryParser:\n\n  /**\n   * Sets the default date resolution used by RangeQueries for fields for which no\n   * specific date resolutions has been set. Field specific resolutions can be set\n   * with {@link #setDateResolution(String, DateTools.Resolution)}.\n   *  \n   * @param dateResolution the default date resolution to set\n   */\n  public void setDateResolution(DateTools.Resolution dateResolution);\n  \n  /**\n   * Sets the date resolution used by RangeQueries for a specific field.\n   *  \n   * @param field field for which the date resolution is to be set \n   * @param dateResolution date resolution to set\n   */\n  public void setDateResolution(String fieldName, DateTools.Resolution dateResolution);\n\n(I also added the corresponding getter methods).\n\nNow the user can set a default date resolution used for all fields or, with the second method, field specific date resolutions.\nThe initial default resolution, which is used if the user does not set a different resolution, is DateTools.Resolution.DAY. \n\nPlease let me know if you think we should use a different resolution as default.\n\nI extended TestQueryParser to test this new feature.\n\nAll unit tests pass.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-732",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Support DateTools in QueryParser",
    "systemSpecification": true,
    "version": ""
}