{
    "comments": [
        {
            "author": "Michael McCandless",
            "body": "Small changes to IndexWriter.java to add default (static) getter/setters for COMMIT_LOCK_TIMEOUT and WRITE_LOCK_TIMEOUT.",
            "date": "2006-06-30T19:59:55.000+0000",
            "id": 0
        },
        {
            "author": "Michael McCandless",
            "body": "Patch to add calls to the new static default setter/getters into the existing TestIndexWriter unit test.",
            "date": "2006-06-30T20:09:06.000+0000",
            "id": 1
        },
        {
            "author": "Michael McCandless",
            "body": "Another recent thread that noted the regression in Lucene 2.0:\n\n    http://www.gossamer-threads.com/lists/lucene/java-user/36561",
            "date": "2006-06-30T20:52:33.000+0000",
            "id": 2
        },
        {
            "author": "Hoss Man",
            "body": "patches applied cleanly with no obvious downsides that I could think of.\n\ncommited with some minor javadoc tweaks (added missing \"@see\" declaration to some javadoc lines in the patch, and aded some new @see declarations to the existing static variables pointing at the new setters)",
            "date": "2006-07-01T04:46:38.000+0000",
            "id": 3
        },
        {
            "author": "Michael McCandless",
            "body": "Wow, thanks for the fast resolution here!",
            "date": "2006-07-01T05:07:34.000+0000",
            "id": 4
        }
    ],
    "component": "core/index",
    "description": "\nWe recently stopped using Java system properties to derive defaults for things like the write/commit lock timeout, and switched to getter/setter's across all classes.  See here:\n\n    http://www.gossamer-threads.com/lists/lucene/java-dev/27447\n\nBut, in the case at least of the write lock timeout, because it's marked \"public final static\", a consumer of this API can no longer change this value before instantiating the IndexWriter.  This is because the getter/setter for this is not static, which generally makes sense so you can change the timeout for each instance of IndexWriter.  But because IndexWriter on construction uses the timeout value, some uses cases need to change the value before getting an instance of IndexWriter.\n\nThis was actually a regression, in that Lucene users lost functionality they previously had, on upgrading.\n\nI would propose that that we add getter/setter for the default value of this timeout, which would be static.  I'll attach a patch file.\n\nSee this thread for context that led to this issue:\n\n   http://www.gossamer-threads.com/lists/lucene/java-dev/37421",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "LUCENE-621",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Default lock timeouts should have static setter/getters",
    "systemSpecification": true,
    "version": "2.0.0"
}