{
    "comments": [
        {
            "author": "Robert Muir",
            "body": "This patch is so simple, instead of 3 hairy tokenfilters.\n\nI would like to commit tomorrow (upgrading our icu.jar in contrib/icu to 4.4), unless there are any objections.",
            "date": "2010-04-17T02:33:26.157+0000",
            "id": 0
        },
        {
            "author": "Robert Muir",
            "body": "i made this filter final, to avoid a ticket from the policeman.",
            "date": "2010-04-17T02:58:23.695+0000",
            "id": 1
        },
        {
            "author": "Uwe Schindler",
            "body": "Hurra! You used the StringBuilder as buffer to not create a new String instance each time and only need to copy the buffer. This could also be a good trick for the PatternReplaceFilter from Solr.\n\nbq. i made this filter final, to avoid a ticket from the policeman. \n\nHow did you get the filter through the assert statement without final? Strange...",
            "date": "2010-04-17T07:23:33.728+0000",
            "id": 2
        },
        {
            "author": "Uwe Schindler",
            "body": "I know, you were running the test without assertion from Eclipse! :-)\n\n{noformat}\n[junit] TokenStream implementation classes or at least their incrementToken() implementation must be final\n[junit] junit.framework.AssertionFailedError: TokenStream implementation classes or at least their incrementToken() implementation must be final\n[junit]     at org.apache.lucene.analysis.TokenStream.assertFinal(TokenStream.java:117)\n{noformat}\n\nSo for me the assertion worked. The *second* patch of course works with icu-4_4.jar! So great and I am happy about the cool interfaces at CharTermAttribute.\n\nI just wanted to check that the my deputy sheriff did not miss something because of wrong instructions.",
            "date": "2010-04-17T07:50:02.467+0000",
            "id": 3
        },
        {
            "author": "Robert Muir",
            "body": "bq. I know, you were running the test without assertion from Eclipse!\n\nYes! So the assertion here worked perfectly!\n\nbq. So great and I am happy about the cool interfaces at CharTermAttribute.\n\nYes, I'm really excited about this. \nBesides just normalization, we get the ability to do \"best practice\" case folding (see the German and Greek examples in the test), normalization, and ignorable removal all in one simple filter, and, users can make their own .txt files for special mappings, run them through a tool, and use this filter with high performance:\n\nhttp://site.icu-project.org/design/normalization/custom\nhttp://userguide.icu-project.org/transforms/normalization\n",
            "date": "2010-04-17T13:00:22.394+0000",
            "id": 4
        },
        {
            "author": "Robert Muir",
            "body": "I added some additional javadocs to try to explain the default behavior (nfkc_cf)",
            "date": "2010-04-17T13:24:25.288+0000",
            "id": 5
        },
        {
            "author": "Robert Muir",
            "body": "I made the filter non-final, and only incrementToken final instead.\n\nThis way we can implement things like LUCENE-1343, which want to do things like removing accents in a way that respects normalization (e.g. removes decomposed and composed forms).\n\nSo we can just extend this, and pass along a statically loaded InputStream for the .nrm file to its ctor and be done with it. \n",
            "date": "2010-04-17T14:50:16.967+0000",
            "id": 6
        },
        {
            "author": "Robert Muir",
            "body": "Committed revision 935186. \n\nWill later discuss how we should expose this stuff in solr (maybe an ICU contrib for now?) as I want its faster Collation filter exposed there too :)",
            "date": "2010-04-17T15:08:39.841+0000",
            "id": 7
        },
        {
            "author": "Robert Muir",
            "body": "backported to 3.x, rev 941689",
            "date": "2010-05-06T12:20:59.022+0000",
            "id": 8
        },
        {
            "author": "Grant Ingersoll",
            "body": "Bulk close for 3.1",
            "date": "2011-03-30T15:50:17.725+0000",
            "id": 9
        }
    ],
    "component": "modules/other",
    "description": "While there are separate Case Folding, Normalization, and Ignorable-removal filters in LUCENE-1488,\nthe new ICU Normalizer2 API does this all at once with nfkc_cf (based on the new NFKC_Casefold property in Unicode).\n\nThis is great, because it provides a ton of unicode functionality that is really needed.\nAnd the new Normalizer2 API takes CharSequence and writes to Appendable...\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "LUCENE-2399",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "LUCENE",
    "project": "LUCENE",
    "summary": "Add support for ICU's Normalizer2",
    "systemSpecification": true,
    "version": "3.1"
}