{
    "comments": [
        {
            "author": "Michael Dürig",
            "body": "Specifically I'd like to be able to return items for getItemInfos(sessionInfo, nodeId) which are not in the sub tree rooted at nodeId.\n\nThis is useful in the case where an underlying data store returns such items anyway. For example an underlying data store might always return the parent and all grand-parents of a requested item and probably even some of its siblings (i.e. MS Sharepoint). \nWhile traversing a repository from the root node to the leaves, there wont be any gain. However, there is quite some impact on random access. For example when iterating over the result set from a search. ",
            "date": "2008-10-13T08:41:22.042+0000",
            "id": 0
        },
        {
            "author": "Michael Dürig",
            "body": "Even more specifically I want to broaden the contract of RepositoryService.getItemInfos() to\n\n\"Method used to 'batch-read' from the persistent storage. It must contain the NodeInfo for the given NodeId in the Iterator. In addition the iterator may contain arbitrary child ItemInfos from the entire hierarchy.\"\n\nThis is fully backward compatible but might significantly simplify implementations. \n\n\n",
            "date": "2009-07-10T08:58:09.093+0000",
            "id": 1
        },
        {
            "author": "Michael Dürig",
            "body": "Proposed patch",
            "date": "2009-07-10T09:10:46.918+0000",
            "id": 2
        },
        {
            "author": "Michael Dürig",
            "body": "Updated patch with some performance optimization by assuming locality (hierarchy wise) of the itemInfos in a batch.\n\n",
            "date": "2009-07-10T16:02:07.739+0000",
            "id": 3
        },
        {
            "author": "Michael Dürig",
            "body": "Fixed at revision: 794012\nincluded test cases",
            "date": "2009-07-14T18:48:24.413+0000",
            "id": 4
        },
        {
            "author": "Michael Dürig",
            "body": "Reopening since the patch doesn't work. Due to dependency problems I kept running against the wrong version. Sorry, I'll try to fix or revert the changes. ",
            "date": "2009-07-14T20:23:25.659+0000",
            "id": 5
        },
        {
            "author": "Michael Dürig",
            "body": "Broadening the contract of RepositoryService.getItemInfos as suggested above is not possible. There is no way to find the target itemInfo in the returned iterator. Note that the itemId does not help here since the SPI implementation might return another form (i.e. UUID) based id that the current one.",
            "date": "2009-07-14T22:34:54.716+0000",
            "id": 6
        },
        {
            "author": "Michael Dürig",
            "body": "Fixed at revision: 794102  \nWith this fix RepositoryService.getItemInfos may return arbitrary item infos. Not just such which are child infos of the target item. ",
            "date": "2009-07-14T22:46:41.660+0000",
            "id": 7
        },
        {
            "author": "angela",
            "body": "michael, i don't think it makes too much sense to add an improvement in an old branch without adding it to the trunk as well. => reopening.\n\ncould you fix it in the trunk too?\nthanks\nangela",
            "date": "2009-07-15T06:26:36.644+0000",
            "id": 8
        },
        {
            "author": "Michael Dürig",
            "body": "Fixed in trunk at revision: 794302  \n",
            "date": "2009-07-15T15:38:45.404+0000",
            "id": 9
        },
        {
            "author": "Jukka Zitting",
            "body": "Merged the 1.5 changes to the 1.x branch in revision 801232.",
            "date": "2009-08-05T13:58:49.829+0000",
            "id": 10
        }
    ],
    "component": "jackrabbit-jcr2spi, jackrabbit-spi",
    "description": "michael duerig asked for for that extension of the semantic of RepositoryService.getItemInfos.\ncurrently this doesn't work and leads to an inconsistent hierarchy.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1797",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "SPI: RepositoryService.getItemInfos should be allowed to return entries outside of the requested tree.",
    "systemSpecification": true,
    "version": "1.5.6"
}