{
    "comments": [
        {
            "author": "chad davis",
            "body": "I've already been testing my fixes on the 2.2.5 release.  I'm going to port them to the trunk, and run my tests there before attaching the patch.",
            "date": "2011-07-19T22:28:10.388+0000",
            "id": 0
        },
        {
            "author": "chad davis",
            "body": "Here are patches against the trunk.  Note, I've been running these against 2.2.5 and they work great there too.",
            "date": "2011-07-21T21:05:23.598+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "thanks a lot for the patches. i will take a look and apply them as soon as possible.",
            "date": "2011-07-22T07:15:58.765+0000",
            "id": 2
        },
        {
            "author": "angela",
            "body": "applied patch with quite some modification. specially the comments did not match the code which made it a bit cumbersome.\nin addition it would be nice if the formatting would match the overall coding style used in jackrabbit.\n\nthanks anyway for your effort.\n",
            "date": "2011-07-26T14:23:28.817+0000",
            "id": 3
        },
        {
            "author": "chad davis",
            "body": "@Angela\n\nI will do better next time.  Can you point me to some coding style standards?  I'll very happy to use them.  ",
            "date": "2011-07-26T16:30:12.518+0000",
            "id": 4
        },
        {
            "author": "angela",
            "body": "as far as i remember we mostly follow the java coding convention (see http://www.oracle.com/technetwork/java/codeconv-138413.html).",
            "date": "2011-07-27T08:48:02.463+0000",
            "id": 5
        }
    ],
    "component": "jackrabbit-spi2dav",
    "description": "The spi2dav service implementation use of HttpClient did not support configuration of the maximum amount of http connections to the server.  The default value, in the HttpClient code, is two. This was a performance bottleneck.  This work makes the number of connections configurable via a parameter to the map passed to the repository factory.  \n\nIt also fixes a concurrency issue which was exposed by the increased concurrency effected by this work.  This fix is a replacement of a HashMap cache of client connections with a ConcurrentHashMap, thanks to the java 1.5 available in Jackrabbit 2.x\n\nUSAGE: \nSet the number of connections (Spi2davRepositoryServiceFactory.PARAM_MAX_HTTP_CONNECTIONS) when creating a factory via the dav or davex rep factories.  Default is 20.\n\nNOTE: \nSee also the server side fixes: JCR-3027  The patch on that ticket allows configuration of the concurrency level on the server, which should be tuned in conjunction with the client side connection levels.  \n ",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-3026",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "davex remoting has  a performance bottleneck due limit of 2 http connections",
    "systemSpecification": true,
    "version": "2.2.5"
}