{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Thanks! I committed the fix in revision 1307456 and merged it to the 2.4 branch in revision 1307458 and to the 2.2 branch in revision 1307460.",
            "date": "2012-03-30T15:12:21.176+0000",
            "id": 0
        }
    ],
    "component": "jackrabbit-core",
    "description": "When utilizing the OraclePersistenceManager (package org.apache.jackrabbit.core.persistence.db) (I realize this is marked as deprecated) we noticed during our migration from Jackrabbit 1.6.1 to 2.2.10/11 that when starting the application server an error message is displayed to us that indicates that the Connection object passed to the createTemporaryBlob method of the BLOB class can't be cast to oracle.jdbc.OracleConnection\n\nHere the interesting lines from our log:\n2012-03-15 17:15:47,926 ERROR [org.apache.jackrabbit.core.persistence.db.OraclePersistenceManager] failed to write node state: cafebabe-cafe-babe-cafe-babecafebabe\njava.lang.ClassCastException: org.apache.commons.dbcp.PoolingDataSource$PoolGuardConnectionWrapper cannot be cast to oracle.jdbc.OracleConnection\n\tat oracle.sql.BLOB.createTemporary(BLOB.java:708)\n\tat org.apache.jackrabbit.core.persistence.db.OraclePersistenceManager.createTemporaryBlob(OraclePersistenceManager.java:375)\n\nI want to highlight at this point that the do not see the issue when using the Oracle Bundled persistence manager, however due to the fact that we haven't used the bundled version in the past we have a lot of customers with repo layouts that can not be used by the bundled persistence manager - we ran some tests and noticed that the consistency check fails.\n-> At the moment there is no good upgrade path to move a repo to the bundled structure, the paths provided thus far are shaky at best.\n\nI did find a solution to the problem that has shown no issues thus far and wanted to share this with you:\n\nIt is a one line change that can be made before the wrapped connection is passed to the Oracle driver:\norg.apache.jackrabbit.core.util.db.ConnectionFactory.unwrap(con);\n\nThis then solves the problem, I also wanted to share that we are using an XA datasource.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-3262",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Oracle JDBC Class Cast Exception",
    "systemSpecification": true,
    "version": "2.2.11"
}