{
    "comments": [
        {
            "author": "Christophe Lombart",
            "body": "Is it possible to have this patch in txt format in stead of rtf ?\n\nThanks",
            "date": "2008-05-23T21:09:13.880+0000",
            "id": 0
        },
        {
            "author": "Stephane Landelle",
            "body": "Here it is, sorry.",
            "date": "2008-05-26T08:24:43.601+0000",
            "id": 1
        },
        {
            "author": "Christophe Lombart",
            "body": "The patch has been applied. Thanks \nLet me know if something is wrong. \n\n",
            "date": "2008-05-28T19:05:38.043+0000",
            "id": 2
        }
    ],
    "component": "jackrabbit-ocm",
    "description": "1) Improvement :\nI need to be able to detect when a bean is an OCM proxy and if it has already been loaded. This kind of functionnality is for example on Hibernate with Hibernate.isInitialized(Object proxy).\nI have developped something similar : I have modified ProxyManagerImpl so it uses an InvocationHandler instead of a LazyLoader. This way, I make my proxies implement a special interface whose methods are intercepted.\n\n2) Bug :\nIf a BeanConverter is specified, ObjectConverterImpl should pass it to the proxy CallBack instead letting BeanLazyLoader use the default ObjectConverter. I think this is a bug, as the behavior is different is bean property is proxified or not.\n\n3) Improvement :\nIf a jcrType mapped on a java type is specified, ObjectConverterImpl should make a proxy of this type, and not use the the bean property type. This is particularly useful when the bean property type is an interface.\n\nSorry for reporting this as a bundle instead of seperate items, but I developped my patch as a whole.  \nLet me know if you need help on the enclosing patch.\n\nSincerely,\n\nStéphane Landelle",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1624",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Proxies improvement",
    "systemSpecification": true,
    "version": "1.5"
}