{
    "comments": [
        {
            "author": "angela",
            "body": "what is the status of this issue?\n\nshall we split it into separate issues: 1) reverting the changes, 2) further enhancement to impl. a shared nsp-registry?\n\nwould it be possible to fix the main part (1) for 1.5.0 as it is scheduled?",
            "date": "2008-10-15T09:21:27.528+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Yep, I'm still looking at having some resolution to this before 1.5.\n\nThe more I look at this the more I think that the NamespaceStorage interface just doesn't make much sense for jackrabbit-core. I'll restore it and the cache in jcr2spi, but unless someone has a good idea on how to implement part 2 I think we should just drop it.",
            "date": "2008-10-15T09:37:43.515+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "> but unless someone has a good idea on how to implement part 2 I think we should just drop it.\n\nfine by me. we can still create an new enhancement issue if we have a brilliant idea.",
            "date": "2008-10-15T09:44:12.764+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "Restored NamespaceStorage and simple namespace caching in revisions 705925 and 705932.",
            "date": "2008-10-18T22:03:13.280+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Hmm, revision 705932 caused a test failure so I reverted it in revision 705937.\n\nIn fact it seems impossible to do implement a repository-level namespace cache on top of the RepositoryService interface without making the assumption that namespace mappings are session-independent. This assumption is not supported by the RepositoryService design that has SessionInfo as an argument to all namespace methods, not only those where write authorization could be needed.\n\nI know we agreed to reintroduce the cache, but should we reconsider based on the above observation? At least I suggest that we limit the scope of this issue to NamespaceStorage and, if there really is a need for the cache, open a separate issue to track the cache feature.",
            "date": "2008-10-18T23:48:51.403+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-jcr2spi",
    "description": "hi jukka\n\ni open this issue as a reminder of our recent discussion in basel:\n\nwe decided that you will \n- reintroduce the NamespaceStorage you recently removed from jcr2spi\n- reintroduce a namespace cache in jcr2spi (but using a simple map instead of NamespaceCache object)\n\nin addition we agreed that we want to share the NamespaceRegistryImpl between jcr2spi and jackrabbit-core\nand you volenteered to provide a patch for that.\n\nthanks in advance\nangela",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1612",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Reintroduce NamespaceStorage",
    "systemSpecification": true,
    "version": ""
}