{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "Nodes in the query result are now fetched in chunks. The initial chunk can be configured with the parameter 'resultFetchSize'. If a client attempts to read pass the initial chunk the query is executed again and the target chunk size is doubled.\n\nFixed in revision: 480138",
            "date": "2006-11-28T17:48:27.000+0000",
            "id": 0
        },
        {
            "author": "Marcel Reutegger",
            "body": "I've reverted the changes in QueryResultImpl to provide a backward compatible constructor in that class. The new functionality is now implemented in LazyQueryResultImpl.\n\nCommitted in revision: 480917",
            "date": "2006-11-30T13:34:49.000+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Reopened since the fix introduces a security issue.\n\nUsing the query mechanism it is now possible for a user to infer the existence of some content to which access would otherwise be denied.\n\nTo prevent this the query result implementation must by default return -1 from getSize() unless it can avoid counting rows that may get dropped because of access controls. It's OK to add a configuration option that activates the current behaviour, but it must not be enabled by default.",
            "date": "2006-12-18T08:46:57.000+0000",
            "id": 2
        },
        {
            "author": "Marcel Reutegger",
            "body": "Changed the default value of the 'resultFetchSize' to Integer.MAX_VALUE. With this value getSize() will always return the correct value according to the users access rights.\n\nFixed in trunk and 1.2 branch: 488181",
            "date": "2006-12-18T09:43:35.000+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Excellent, thanks!",
            "date": "2006-12-18T09:47:44.000+0000",
            "id": 4
        }
    ],
    "component": "query",
    "description": "The current implementation of QueryResult requires that access rights are checked on all NodeIds before they are passed ot the QueryResult. This handling should be improved to a more lazy approach where result nodes are checked in configurable batches. Usually a client is only interested in the top scoring results.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-651",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Improve performance for queries with large result sets",
    "systemSpecification": true,
    "version": ""
}