{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Good point.\n\nThe spec requires the \"relevant mappings\" to be included in the \"top-most XML element\", but in this case (concurrent introduction of new namespaces) I think it's better to include extra namespaces as local xmlns settings than to skip the elements or to use unknown prefixes.\n\nI see two ways to fix this. One is the straightforward solution you mentioned of adding missing namespace mappings on the fly, and the other would be to block all changes to the namespace registry while an XML export is in progress.\n\n> Should there be consensus for that change I'm happy to give it a try\n\nPlease do, patches are very much welcome! :-)",
            "date": "2006-07-19T13:38:23.000+0000",
            "id": 0
        },
        {
            "author": "Julian Reschke",
            "body": "Proposed patch (serializer remembers previously written namespace declarations and adds new ones when needed).\n",
            "date": "2006-08-03T17:41:07.000+0000",
            "id": 1
        },
        {
            "author": "Julian Reschke",
            "body": "Related to this, ExportDocViewTest.compareNamespaces() makes the assumption that *all* registered namespaces need to be serialized in the root element (and refers to 6.4.2.1 as justification). However, 6.4.2.1 only talks about the \"relevant\" declarations.\n\nIn any case, both the requirement in the spec and the test case should be relaxed to permit any serialization that produces a valid XML document: it should be left to the implementation when and where to include namespace declarations, as long as they the result document is namespace-wellformed.\n",
            "date": "2006-08-29T14:33:01.000+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "Patch applied revision 439854. Thanks!",
            "date": "2006-09-03T22:33:55.000+0000",
            "id": 3
        }
    ],
    "component": "xml",
    "description": "The XML serialization code relies on the fact that all required prefix-to-uri mappings are known beforehand (actually, when serializing the root node). So there's an assumption that the permanent namespace registry will never change during serialization, which may be incorrect when another client adds namespace registrations while the XML export is in progress.\n\nTo fix this, \"addNamespacePrefixes\" should ensure that namespace declarations have been written for all prefixes used on the current node (node name + properties), potentially going back to the namespace resolver when needed.\n\n(Should there be consensus for that change I'm happy to give it a try)",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-482",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "DocViewSaxEventGenerator may generate non-NS-wellformed XML",
    "systemSpecification": true,
    "version": "0.9, 1.0, 1.0.1"
}