{
    "comments": [
        {
            "author": "Bertrand Delacretaz",
            "body": "Note that command-line copies (as opposed to via the Finder GUI) behave differently:\n\n  cp somefile.xml /Volumes/default/somewhere-in-the-jcr-tree\n\nworks for me.\n\nI haven't precisely checked the differences at the protocol level, but it's useful as a workaround for Finder addicts ;-)",
            "date": "2007-06-18T16:17:00.398+0000",
            "id": 0
        },
        {
            "author": "Tobias Bocanegra",
            "body": "i changed the following:\n- the xmlhandler does only accept content that have a length > 0. this causes it to ignore the 1st empty put and let the default handler create the file.\n- for the subsequent put with the content, the xml import would fail, since the jcr:content is already created as nt:resource. therefor the improved handler will replace the node if it is not compatible with the desired content node type.\n\nnow does the xml import with mac client work. the dot-underscore files log an error, since the xml handler cannot cope with binary data, but are nevertheless created later by the default handler.",
            "date": "2007-06-18T16:22:45.486+0000",
            "id": 1
        },
        {
            "author": "Tobias Bocanegra",
            "body": "Committed revision 548395.",
            "date": "2007-06-18T16:28:01.559+0000",
            "id": 2
        },
        {
            "author": "angela",
            "body": "the fix (adding check for ImportContext.getContentLength()) introduced a minor inconsistency that didn't have\nan effect before:\n\nThe ImportContextImpl retrieves the content length from an InputContext which is passed with one constructor\nbut missing with the second one. Any usage of the latter constructor has the effect, that the XmlHandler will be able to import.\n\nIn order to fix this, the ImportContextImpl  should try to retrieve the content length even if no InputContext is present.",
            "date": "2007-06-22T12:25:08.014+0000",
            "id": 3
        },
        {
            "author": "angela",
            "body": "fmodified:\nhttp://svn.apache.org/repos/asf/jackrabbit/trunk/jackrabbit-jcr-server/src/main/java/org/apache/jackrabbit/server/io/ImportContextImpl.java\nrev. 549796  \n",
            "date": "2007-06-22T12:27:06.539+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "Merged to the 1.3 branch in revision 552540.",
            "date": "2007-07-02T16:49:03.650+0000",
            "id": 5
        }
    ],
    "component": "jackrabbit-webdav",
    "description": "when trying to import a xml file via a webdav mount this does not work.\n\nthis is mainly because the client first tries to create a 0-sized file, which fails with the xml importer. after the file is created, it will lock it and put the xml body. a second problem might be the \"dot-underscore\" files mac tries to create. ",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-973",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "XML import using MacOS X WebDAV client does not work",
    "systemSpecification": true,
    "version": "1.3"
}