{
    "comments": [
        {
            "author": "Przemo Pakulski",
            "body": "I'm working on patch to load versions when it is needed only.",
            "date": "2007-09-04T15:55:43.557+0000",
            "id": 0
        },
        {
            "author": "Przemo Pakulski",
            "body": "Patch attached. Only root version instance is created during intitiaization of  InternalVersionHistoryImpl. Other versions are lazy loaded.\n\nIt has big impact on performance of versioning operations and reduces significantly memory allocations when importing/cloning big trees of versionable nodes.",
            "date": "2007-11-07T23:08:59.050+0000",
            "id": 1
        },
        {
            "author": "Przemo Pakulski",
            "body": "patch applied in rev. 592947",
            "date": "2007-11-07T23:22:59.760+0000",
            "id": 2
        },
        {
            "author": "Stefan Guggisberg",
            "body": "przemo, i appreciate that you provided a patch with the suggested changes to give other committers a chance to review them. however, there's no point in doing so if you apply the patch 14 minutes later anyway... if you'd like to get feedback on the suggested changes you should wait at least a couple of days before committing the patch ;-)\n\nthanks\nstefan",
            "date": "2007-11-08T10:50:52.535+0000",
            "id": 3
        },
        {
            "author": "Przemo Pakulski",
            "body": "Well, you are right, I didn't give any chance to review it by anyone :-(. \nI can say that all test passes and I was working with this fix for some time.",
            "date": "2007-11-08T11:11:02.092+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-core, versioning",
    "description": "InternalVersionHistoryImpl loads all versions at once during initialization. Because of that all versioning operations (incl. checkin, label, restore) are significantly slower when node has many versions.\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1111",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Access to version history results in reading all versions of versionable node",
    "systemSpecification": true,
    "version": ""
}