{
    "comments": [
        {
            "author": "Will Glass-Husain",
            "body": "This forum entry notes that (apparently) upgrading from Tomcat 6.0.16 to 6.0.18 solves the problem.\n\nI'm hitting the same issue with Tomcat 6.0.16.   Can anyone else verify and contradict this?\n\nWill report back once I upgrade.",
            "date": "2009-05-07T15:04:10.195+0000",
            "id": 0
        },
        {
            "author": "Will Glass-Husain",
            "body": "FYI.   I upgraded to Tomcat 6.0.18.  Didn't help.",
            "date": "2009-05-15T05:23:20.180+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "OK, thanks for the info.\n\nI still don't know how to solve this issue. We should probably ask the Derby people, as I think they've encountered this issue already before.",
            "date": "2009-05-15T06:34:15.887+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "In revision 1055116 I added a DerbyShutdown listener that attempts to automatically release all remaining Derby resources when the Jackrabbit webapp gets stopped or undeployed. That clears many of the warnings logged by Tomcat and gives us a clean undeploy at least on Tomcat 7.",
            "date": "2011-01-04T17:42:35.954+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Merged to the 2.2 branch in revision 1055129.",
            "date": "2011-01-04T18:27:51.974+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-webapp",
    "description": "When testing jackrabbit-webapp for the 1.4 release, I again came across this issue that I've occasionally seen also before, but never qualified enough for a bug report.\n\nThe Jackrabbit webapp would deploy without problems, but when I undeploy the webapp Tomcat fails to remove the Derby jar in WEB-INF/lib (I have unpackWARs enabled). This causes problems especially when I have autoDeploy enabled, as Tomcat then deploys the skeleton webapp right after undeployment, and the only way to really get rid of the webapp is to shutdown Tomcat and to manually remove the webapp on the file system.\n\nI suspect that this problem is related to Derby jar being somehow referenced even after the webapp is undeployed, causing Windows to prevent the jar file from being removed.\n\nUnless someone has some bright idea on how to resolve this, I'll consider this a known issue in Jackrabbit 1.4.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1301",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Trouble undeploying jackrabbit-webapp from Tomcat",
    "systemSpecification": true,
    "version": "2.2"
}