{
    "comments": [
        {
            "author": "Alex Lukin",
            "body": "This patch applies only to implememntation code. It's upt to author of OCM to put it into interface",
            "date": "2008-03-12T07:49:28.306+0000",
            "id": 0
        },
        {
            "author": "Christophe Lombart",
            "body": "The full story : \n\nhttp://www.mail-archive.com/dev@jackrabbit.apache.org/msg11205.html\n\n",
            "date": "2008-03-12T10:19:29.463+0000",
            "id": 1
        },
        {
            "author": "Christophe Lombart",
            "body": "I made patch. Can you check it ? \n\nIt is no longer necessary to use the ocm namespace and the ocm:discriminator mixin type. \n\nHere is a summary of the current situation  : \n\n1. If the jcr node type is map to only java class, it is always possible to find the class name to instantiate. So, a discriminator (an extra property which will contains the class name) is not necessary.\n\n2. if the same node type is mapped to different java classes, we have different situations : \n \na. If the class is mapped to the unstructured node type or a node type\nthat gives you  the possibility to add extra properties, OCM will create a new\nproperty \"ocm_classname\".\nb. If it  is not possible to add this property due to strong constrains in the corresponding node type, OCM will try to add the mixin type \"ocm:discriminator\".",
            "date": "2008-03-13T21:09:36.737+0000",
            "id": 2
        },
        {
            "author": "Alex Lukin",
            "body": "Thnks, it works fine at least in my case. I removed init code an my project passed tests. I do not use restrictive node types so I did not checked case b.",
            "date": "2008-03-14T18:05:22.394+0000",
            "id": 3
        }
    ],
    "component": "jackrabbit-ocm",
    "description": "Hide repository namespace registration and ocm:discriminator node type registration in implementation of OCM",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1467",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Hide ugly repository init code for OCM",
    "systemSpecification": false,
    "version": ""
}