{
    "comments": [
        {
            "author": "Chris Schmidt",
            "body": "I have an implementation that I can include for this issue, but it also includes tablespace (for Oracle) and filegroup (for SqlServer) support. If those enhancements are OK to include, I will attach the patch.",
            "date": "2008-02-06T01:07:19.175+0000",
            "id": 0
        },
        {
            "author": "Chris Schmidt",
            "body": "More of a refactoring request, but could the code that handles DB interaction be extracted to a common utility class (or set of classes)?  The current implementation violates the DRY principle and could cause additional maintenance issues in the future.",
            "date": "2008-02-06T01:10:37.245+0000",
            "id": 1
        },
        {
            "author": "Martijn Hendriks",
            "body": "The Oracle tablespace and SqlServer filegroup support have already been added (see JCR-968 and JCR-1295). The attached patch solves this issue.\n\nI agree with Chris that we should very probably think about refactoring all or most of the DB interaction into a set of utility classes. The fact that this Oracle issue has popped up three times for different parts of the code (this issue, JCR-814 and JCR-582) underlines the lurking maintenance problems.\n\n",
            "date": "2008-08-11T08:27:23.312+0000",
            "id": 2
        },
        {
            "author": "Martijn Hendriks",
            "body": "Committed patch in revision: 686688  \n",
            "date": "2008-08-18T07:41:55.132+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Merged to the 1.4 branch in revision 695887.",
            "date": "2008-09-16T14:10:06.438+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-core, sql",
    "description": "The DatabaseJournal currently calls database metadata to determine if the journal table has already been created.  It uses the following code to do so:\n\nResultSet rs = metaData.getTables(null, null, tableName, null);\n\nThe Oracle driver sometimes will return the table if it is in another schema on the same database.  Other DBMS code within JackRabbit has a specific Oracle version that handles this case.  In order for the journal table to be properly created, Oracle databases will need the schema name included in the getTables() call.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1362",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "DatabaseJournal improperly finds tables in external schemas when used on Oracle",
    "systemSpecification": true,
    "version": "1.3.3, 1.4"
}