{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Attached a patch that properly encodes the test path for use in the XPath queries.\n\nThe only problem with this patch is that it needs the ISO9075.encodePath() method from jackrabbit-jcr-commons. I'm not sure what are the implications of the jcr-commons dependency, though as long as the TCK webapp uses JNDI to access the repository from another classloader this should be no problem.",
            "date": "2009-01-08T22:46:53.125+0000",
            "id": 0
        },
        {
            "author": "Marcel Reutegger",
            "body": "We had a similar issue with the ISO8601 class. Instead of introducing a dependency, we copied the class. I don't particularly like that, so I'm OK with  the new dependency. Once jackrabbit-jcr-tests depends on jackrabbit-jcr-commons we should remove the class ISO8601 and use the one from the commons module.",
            "date": "2009-01-09T10:26:49.545+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Patch applied in revision 792118.\n\nInstead of introducing the jcr-commons dependency, I copied the required support classes to o.a.j.test.api.util.\n",
            "date": "2009-07-08T12:47:36.133+0000",
            "id": 2
        }
    ],
    "component": "jackrabbit-jcr-tests",
    "description": "A repository implementation might use a test root path that contains names that need _xXXXX_ escaping when used in XPath queries. Currently the TCK just uses the test path as-is when constructing queries. Even though this only affects few repositories (I've heard of one legacy connector to run into this problem), it would be good to add the proper escaping.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-714",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "TCK: Test root path not escaped when used in XPath queries",
    "systemSpecification": true,
    "version": ""
}