{
    "comments": [
        {
            "author": "David Johnson",
            "body": "I have upgraded my local version to Lucene 2.1\n\nI needed to change 2 files - the pom.xml of jackrabbit-core and org.apache.jackrabbit.core.query.lucene.PersistentIndex.java\n\nWhile all tests pass, I am not sure if my change to PersistentIndex is right - specifically I commented out the code pertaining to COMMIT_LOCK as this seems to have been removed or moved to another class in Lucene 2.1\n\nIs this worth a patch?  As Marcel stated, this appears to be a good upgrade, so I would like to get this in sooner rather than later.",
            "date": "2007-03-26T21:07:24.850+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Please do share a patch with your changes. It's always easier to judge a change if the actual code is available. BTW, would the modified class still work with Lucene 2.0? I also assume that Lucene 2.1 is compatible with indexes created with 2.0.\n\nI agree that we should try to keep up with Lucene upgrades, but on the other hand I would not want to force too frequent dependency changes on users. If the change works with Lucene 2.0, then existing users wouldn't need to upgrade their dependencies. If not, then the upgrade procedure needs to be documented in the release notes.\n\nIf there is no immediate demand for the upgrade, I would rather wait until Jackrabbit 1.3 is branched before doing this.",
            "date": "2007-03-26T21:59:40.684+0000",
            "id": 1
        },
        {
            "author": "David Johnson",
            "body": "Patch file for upgrade to Lucene 2.1.0",
            "date": "2007-03-26T22:36:36.332+0000",
            "id": 2
        },
        {
            "author": "Marcel Reutegger",
            "body": "Lucene 2.1 can read index files created with previous releases, but will write new files in the 2.1 version. Once you upgrade to  2.1 you cannot go back anymore, unless you re-index the repository.\n\nBecause lucene 2.1 is not yet available in a maven 2 repository and the change is only minor I would rather keep the 2.0 compile dependency in the pom. I suggest the following change:\n\nIndex: PersistentIndex.java\n===================================================================\n--- PersistentIndex.java\t(revision 520911)\n+++ PersistentIndex.java\t(working copy)\n@@ -42,7 +42,7 @@\n     private static final String WRITE_LOCK = IndexWriter.WRITE_LOCK_NAME;\n \n     /** Name of the commit lock file */\n-    private static final String COMMIT_LOCK = IndexWriter.COMMIT_LOCK_NAME;\n+    private static final String COMMIT_LOCK = \"commit.lock\";\n \n     /** The name of this persistent index */\n     private final String name;\n\nThis allows the sources to compile with either 2.0 or 2.1.\n\nI think it is actually possible to upgrade lucene without this change because the compiler puts the commit.lock literal into the PersistentIndex class file and therefore removes the dependency to the IndexWriter.COMMIT_LOCK_NAME field.",
            "date": "2007-03-27T09:25:56.735+0000",
            "id": 3
        },
        {
            "author": "Marcel Reutegger",
            "body": "Committed above mentioned patch in revision: 523265",
            "date": "2007-03-28T10:35:47.708+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "Tagging the actual POM dependency upgrade for Jackrabbit 1.4.",
            "date": "2007-04-05T13:30:50.892+0000",
            "id": 5
        },
        {
            "author": "Jukka Zitting",
            "body": "Lucene 2.2 was just released with even more good stuff. The artifacts and proper POMs are also now up on the central Maven repository.\n\nUpdated issue summary to upgrade to Lucene 2.2 instead of 2.1.",
            "date": "2007-06-20T09:40:12.096+0000",
            "id": 6
        },
        {
            "author": "fabrizio giustina",
            "body": "The attached patch upgrades the lucene dependency to 2.2.0 (pom update + just a few additional methods added in FilteredTermPositions).\nTests run fine after the patch, you should be able to apply this without problems.",
            "date": "2007-07-17T22:54:48.924+0000",
            "id": 7
        },
        {
            "author": "Jukka Zitting",
            "body": "Excellent! Patch applied in revision 558194.",
            "date": "2007-07-20T23:09:23.476+0000",
            "id": 8
        }
    ],
    "component": "jackrabbit-core, query",
    "description": "Lucene 2.1 contains a number of useful enhancements, which could be benefical to jackrabbit:\n\n- less locking on index updates -> less IO calls\n- introduces FieldSelector -> allows jackrabbit to only load required fields",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-788",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Upgrade to Lucene 2.2",
    "systemSpecification": true,
    "version": ""
}