{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "Implemented as described. See sample repository.xml in src/main/config for details how to configure background indexing.\n\nFor now this feature is disabled per default because it changes the indexing behaviour slightly compared to the previous implementation that always extracted text using the current thread.\n\nSVN revision: 497067",
            "date": "2007-01-17T16:49:21.018+0000",
            "id": 0
        }
    ],
    "component": "indexing",
    "description": "Even though text extraction is not done right on save() most of the extraction work is later done by a client thread. There is a mechanism in place that commits the deferred work in a background thread. But the background thread is only triggered by a timer and does not constantly write back pending index changes. For regular index changes this is done on purpose and should not be changed. However text extraction work should be moved completely into a background thread because it often takes a fair amount of time to index a large document.\n\nOutline of a possible solution:\n- all text filtering is tasks are put into a work queue\n- the work queue is processed by a background thread\n- basic indexing of nt:resource without text filtering takes place\n- the background thread updates the index when text filtering completed for a nt:resource\n\nThere should be a configuration parameter that allows to execute text filtering without the background thread. This way it is possible to get the existing behaviour of Jackrabbit: the fulltext index is always up-to-date and can be used.\nWith the background process this is no longer the case.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-390",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Move text extraction into a background thread",
    "systemSpecification": true,
    "version": "1.0, 1.0.1"
}