{
    "comments": [
        {
            "author": "Christoph Kiehl",
            "body": "A first shot how this might look like. I stumbled over QueryResultImpl which is apparently no longer used. Instead LazyQueryResultImpl is used. Can we discard QueryResultImpl and rename LazyQueryResultImpl to QueryResultImpl? We could then just implemented getTotalSize() on QueryResultImpl without the need for a further interface or abstract base class for both QueryResult implementations.",
            "date": "2007-08-21T23:51:58.557+0000",
            "id": 0
        },
        {
            "author": "Marcel Reutegger",
            "body": "+1 for the patch.\n\nI'm still using the class QueryResultImpl in a different project. But I'm ok with renaming LazyQueryResultImpl to QueryResultImpl. We just have to rename QueryResultImpl as well ;) e.g. to SimpleQueryResultImpl.",
            "date": "2007-08-22T12:51:28.837+0000",
            "id": 1
        },
        {
            "author": "Christoph Kiehl",
            "body": "WDYT about removing QueryResultImpl from jackrabbit and you just add it to your particular project? Is that an option? Seems to be a quite customized installation anyway.",
            "date": "2007-08-24T08:33:46.585+0000",
            "id": 2
        },
        {
            "author": "Marcel Reutegger",
            "body": "That's actually the better option, but we then have to open up the package private jackrabbit classes the QueryResultImpl currently uses:\n\n- RowIteratorImpl\n- DocOrderNodeIteratorImpl\n- NodeIteratorImpl\n\nIs that OK with you?",
            "date": "2007-08-24T09:41:55.702+0000",
            "id": 3
        },
        {
            "author": "Christoph Kiehl",
            "body": "I'm afraid if we open up jackrabbit here we might run into more issues like this one where people start using classes that are not intended to be extended or used outside of Jackrabbit. Another hacky solution would be to place to place the class in the org.apache.jackrabbit.core.query.lucene in your project as well. I think java doesn't mind if the file is in another jar file. If you dislike this solution I think we should spend some more time thinking about which parts should be usable from outside to implement a custom QueryHandler for instance (I guess you are using a customized QueryHandler in your project, aren't you?) Unfortunately I'm a bit low on time currently to concentrate on such a work :/",
            "date": "2007-08-24T10:33:42.104+0000",
            "id": 4
        },
        {
            "author": "Marcel Reutegger",
            "body": "> I guess you are using a customized QueryHandler in your project, aren't you?\n\nyes, we are.\n\nI've now decoupled our code from the respective Jackrabbit classes.\n\nFeel free to remove QueryResultImpl and rename LazyQueryResultImpl.",
            "date": "2007-08-24T13:15:32.352+0000",
            "id": 5
        },
        {
            "author": "Christoph Kiehl",
            "body": "Committed patch in revision 572889. I'll open a new ticket for renaming LazyQueryResultImpl to QueryResultImpl as this might affect other users as well.",
            "date": "2007-09-05T06:57:26.682+0000",
            "id": 6
        }
    ],
    "component": "jackrabbit-core, query",
    "description": "As discussed in http://www.nabble.com/Total-size-of-a-query-result-and-setLimit%28%29-tf4280909.html#a12185543 a getTotalSize() method should be added to QueryResults.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1073",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Add getTotalSize() to QueryResults",
    "systemSpecification": true,
    "version": ""
}