{
    "comments": [
        {
            "author": "Julian Reschke",
            "body": "Fixed with revision 502263.\n",
            "date": "2007-02-01T16:31:17.092+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "> A related question is what our expectation is for JCR implementations. Are they\n> allowed to reject something that doesn't parse as a URI according to RFC3986?\n\nI don't recall the JCR spec saying anything about this, but since XML namespace (http://www.w3.org/TR/REC-xml-names/) names are RFC 3986 URIs, I think it would be perfectly OK for a repository implementatino to only allow valid URIs. One concrete benefit of such a policy would be the avoidance of invalid namespace names in XML exports. In fact we may even want to consider enforcing this in Jackrabbit.\n\nPS. The \"www.apache.org/...\" name can actually be interpreted as a relative URI, and is only deprecated but not strictly prohibited by the current XML namespace spec.\n",
            "date": "2007-02-01T17:38:34.242+0000",
            "id": 1
        },
        {
            "author": "Julian Reschke",
            "body": "Just a nit: \"www.apache.org/...\" is a relative reference (<http://greenbytes.de/tech/webdav/rfc3986.html#rfc.section.4.2>), but not a URI (<http://greenbytes.de/tech/webdav/rfc3986.html#rfc.section.3>).\n",
            "date": "2007-02-01T17:47:25.618+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "Thanks for the terminology update! The devil's in the details...\n\nThe XML namespace spec says: \"An XML namespace is identified by a URI reference [RFC3986]\", meaning both full URIs and relative URI references. The current version adds a note that deprecates the use of relative URI references.\n\nThe JCR spec somewhat vaguely says: \"Namespacing in a content repository is patterned after namespacing in XML. As in XML, the prefix is actually shorthand for the full namespace, which is a URI.\"\n\nIt seems fair to interpret this as meaning that only full URIs are allowed as JCR namespaces.\n",
            "date": "2007-02-15T22:44:44.799+0000",
            "id": 3
        }
    ],
    "component": "test",
    "description": "The test cases use \"www.apache.org/...\" as a namespace URI, but this is not a URI.\n\nSuggest to fix by using a proper URI, such as by prefixing with \"http://\".\n\nA related question is what our expectation is for JCR implementations. Are they allowed to reject something that doesn't parse as a URI according to RFC3986?\n",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-727",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Trivial",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "NamespaceRegistryTest uses an invalid URI as namespace URI",
    "systemSpecification": true,
    "version": ""
}