{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "There is now an org.apache.jackrabbit.core.JackrabbitRepositoryStub class in src/main/java in jackrabbit-core.\n\nUsing it in a downstream project is very simple, just add the following repositoryStubImpl.properties file to your test classpath and extend your tests from AbstractJCRTest.\n\nrepositoryStubImpl.properties:\njavax.jcr.tck.repository_stub_impl=org.apache.jackrabbit.core.JackrabbitRepositoryStub",
            "date": "2009-04-07T13:22:02.750+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "I also changed the conformance tests in spi2jcr to use the new JackrabbitRepositoryStub class.",
            "date": "2009-04-07T13:23:00.650+0000",
            "id": 1
        },
        {
            "author": "Marcel Reutegger",
            "body": "I'm not happy with this new situation.\n\nThe changes introduced a compile time dependency from jackrabbit-core to jackrabbit-jcr-tests.\n",
            "date": "2009-04-16T10:24:18.825+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "> The changes introduced a compile time dependency from jackrabbit-core to jackrabbit-jcr-tests. \n\nIt's an optional dependency, so it doesn't affect downstream projects.\n\nThis change achieves a notable level of code and configuration reuse in that it avoids having to duplicate all the test settings wherever we want to run the TCK on Jackrabbit.\n\nIf the extra optional dependency is not acceptable, we have two alternatives for keeping this level of reuse:\n\n1) Make a new component like \"jackrabbit-test-stub\" that contains the JackrabbitRepositoryStub class and depends on both jackrabbit-core and jackrabbit-jcr-tests. IMHO we already have too many components, so adding a new one for just a single class feels overkill.\n\n2) Move the JackrabbitRepositoryStub class to jackrabbit-jcr-tests, with an optional dependency to jackrabbit-core.\n\n",
            "date": "2009-04-16T10:53:08.715+0000",
            "id": 3
        },
        {
            "author": "Marcel Reutegger",
            "body": "> It's an optional dependency, so it doesn't affect downstream projects.\n\nah, right. I'm sorry, I didn't notice that before (the optional flag is not shown in mvn dependency:tree :-/ )\n\nIn that case, never mind... I'll set this issue to fixed again.",
            "date": "2009-04-16T11:43:48.834+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-core, jackrabbit-spi2jcr",
    "description": "Currently setting up a Jackrabbit repository for use with the TCK is a relatively complex operation with a large repositoryStubImpl.properties file and lots of specially crafted test content and settings to worry about. This makes it hard to set up new TCK test instances with the various JCR and SPI layers we now have.\n\nTo simplify things I'd like to introduce a RepositoryStubImpl class and related configuration files inside src/main/java in jackrabbit-core.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-2055",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "RepositoryStub implementation in jackrabbit-core",
    "systemSpecification": true,
    "version": ""
}