{
    "comments": [
        {
            "author": "Carlos Sanchez",
            "body": "Patch needed for jackrabbit-ocm",
            "date": "2007-07-02T20:37:06.355+0000",
            "id": 0
        },
        {
            "author": "Carlos Sanchez",
            "body": "Patch needed for jackrabbit-ocm-nodemanagement.",
            "date": "2007-07-02T20:37:26.370+0000",
            "id": 1
        },
        {
            "author": "Carlos Sanchez",
            "body": "there's still the problem that jcr-nodemanagement has not been deployed and the reference to jackrabbit-ocm in its pom is still 1.0-SNAPSHOT instead of 1.4-SNAPSHOT",
            "date": "2007-07-02T21:30:07.151+0000",
            "id": 2
        },
        {
            "author": "Carlos Sanchez",
            "body": "updated patch with correct versions in pom",
            "date": "2007-07-02T23:18:07.396+0000",
            "id": 3
        },
        {
            "author": "Carlos Sanchez",
            "body": "And here it is the important part\nIf you run the unit test you'll see it fails, we haven't figured out how to deal with collections yet, maybe somebody can figure out what's going on there",
            "date": "2007-07-02T23:35:18.526+0000",
            "id": 4
        },
        {
            "author": "Christophe Lombart",
            "body": "The class AnnotatedObjectMapper doesn't register the class descriptor which certainly causes this kind of issue. \nclassDescriptorsRequiringRegistration is empty in the constructor. \n\nI'm going to continue my investigation tomorrow",
            "date": "2007-07-04T21:08:35.206+0000",
            "id": 5
        },
        {
            "author": "Christophe Lombart",
            "body": "OOps maybe it is a normal behavior after a second run. Need more time to investigate.",
            "date": "2007-07-04T21:13:22.657+0000",
            "id": 6
        },
        {
            "author": "Christophe Lombart",
            "body": "Patch applied - thanks !\n\nThe collection issue is still there. I created a more simple unit test because I also detected some issues with namespaces. I continue to work on it.  ",
            "date": "2007-07-10T21:39:13.784+0000",
            "id": 7
        },
        {
            "author": "Christophe Lombart",
            "body": "* I added support for the bean descriptor. \n* I dropped the AnnotationObjectContentManagerImpl because we can use the ObjectContentManagerImpl. Only the mapper is different for the annotation support. \n* I also modified the annotation attribute names. In order to avoid confusion, it is important to use the same name as  the xml file descriptors. Please make suggestions if you think that the names are not correct. the collection annotation has to be modify (should be done this week). \n* I added more unit tests (map objects into nt:unstructured). I will add more unit test for mapping on specific node types. \n\nI will continue to work on this issue. I think we can add the following improvements : \n* Create an abstract mapper impl because both Mapper classes have a lot of code in common (AnnotedObjectMapper & DigesterMapperImpl). \n* The Mapper classes should not have the responsibility to create the jcr node types. This can be done outside the mapper and it should be an optional operation. There are certainly some use cases where node type creation is not necessary. \n* I'm just wondering how can we use the same unit tests for both approach (xml file & annotations). \n* Can we drop the annotation SuperType. This is defined in the annotation Node (jcrSuperTypes) ? \n* Add license headers\n\nPlease add your comments and feedback.\n",
            "date": "2007-08-07T20:01:14.839+0000",
            "id": 8
        },
        {
            "author": "Christophe Lombart",
            "body": "the annotation support is done.",
            "date": "2007-10-12T19:58:58.494+0000",
            "id": 9
        }
    ],
    "component": "jackrabbit-ocm",
    "description": "we have created an annotation based implementation of jackrabbit-ocm that can be used instead of the digester one",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-998",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Annotation based implementation of jackrabbit ocm",
    "systemSpecification": true,
    "version": ""
}