{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "This bug was introduced with the new fn:upper-case() and fn:lower-case() functions.\n\nThe boundary was not checked correctly anymore. The optimization was a bit too agressive ;)\n\nFixed in trunk and 1.2 branch: 496435",
            "date": "2007-01-15T18:45:20.591+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Great work, seems to work now!\n\nI'm curious how the seemingly small problem could only have manifested itself in large repositories.\n",
            "date": "2007-01-15T19:34:26.394+0000",
            "id": 1
        },
        {
            "author": "Marcel Reutegger",
            "body": "There exist two implementations of a range query: 1) the lucene range query and 2) a jackrabbit variant. The default lucene range query has a limitation regarding the number of terms in the range. Per default this limit is set to 1000 terms. In a large repository with many distinct date values a date range can contain thousands of terms. This is where the jackrabbit variant of the range query comes into play, which doesn't have this limitation. We actually have a test case that covers this issue but it is disabled because it involves creating 2000 nodes. I think the overhead is not that big and that we should enable the test.",
            "date": "2007-01-16T09:46:44.869+0000",
            "id": 2
        }
    ],
    "component": "query",
    "description": "As discussed on the user mailing list, queries on large repositories with date constraints like \"field > constant\" treat the constraint as always true, returning results that should not be returned.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-707",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Range queries fail on large repositories",
    "systemSpecification": true,
    "version": ""
}