{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Done in revision 813031.",
            "date": "2009-09-09T16:14:23.946+0000",
            "id": 0
        },
        {
            "author": "Gary Gregory",
            "body": "Hello all,\n\nI would like to use jackrabbit-standalone from Maven for testing our upcoming Apache Commons VFS 2.1. \n\nIf you have a better idea on how to do the following, please advise.\n\nI want to run our VFS WebDAV unit tests using Jackrabbit as a server embedded in the test. In previous versions, a developer had to set up a WebDAV server manually and run the one test.\n\nWhat I started to do is use jackrabbit-standalone 1.6.5 but it does not have the JcrUtils class which came in with Jackrabbit 2.0.\n\nMy current code:\n\n# Create a temp dir\n# Create a TransientRepository point to the temp dir\n# Use JcrUtils to import a directory its subdirectories full of test files (I cannot do this ATM.)\n# Shutdown the TransientRepository\n# Start Jackrabbit with org.apache.jackrabbit.standalone.Main:\n{noformat}\norg.apache.jackrabbit.standalone.Main.main(new String[] { \"--port\", Integer.toString(SocketPort), \"--repo\", repoDirectory.toString() });\n{noformat}\n# The tests run\nI would like to use the latest jackrabbit but I am stuck without the standalone jar.\n\nThoughts?",
            "date": "2012-02-10T18:51:18.759+0000",
            "id": 1
        }
    ],
    "component": "jackrabbit-standalone",
    "description": "The jackrabbit-standalone jar currently can't be deployed to the repository.apache.org server probably because of its size. I'm not sure if there are any good use cases where you'd want to use the standalone jar as a Maven dependency, so having it on Maven central doesn't seem that important. I'd like to make this explicit by configuring the deploy plugin to skip deploying the standalone jar.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-2266",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Trivial",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Skip deployment of jackrabbit-standalone",
    "systemSpecification": true,
    "version": ""
}