{
    "comments": [
        {
            "author": "Costin Leau",
            "body": "should be tested.",
            "date": "2006-01-19T19:49:48.000+0000",
            "id": 0
        },
        {
            "author": "Stefan Guggisberg",
            "body": "note that allowing an application to dynamically modify the configuration \n*after* the repository has been initialized may lead to unexpected results.\n\njackrabbit's code expects the configuration to be immutable. public access \nmodifyers and setters have been intentionally omitted for this reason.\n\nif those are to be made public the documentation has to clearly and explicitly \nmention the danger of dynamically changing the configuration.\n\npersonally i'd prefer a tool where a config xml file/dom tree could be easily built \nprogrammatically rather than messing around with the live config.\n",
            "date": "2006-01-19T20:11:10.000+0000",
            "id": 1
        },
        {
            "author": "Tobias Bocanegra",
            "body": "i strongly oppose to apply the suggested patch. stefan is right - the internals of jackrabbit rely on the fact that the config classes are immutable. we should not break this.\n\ni suggest to create some sort of ConfigBuilder which has all the relevant getter and setter methods, and a 'create()' method that creates the immutable config objects.",
            "date": "2006-01-19T23:19:01.000+0000",
            "id": 2
        },
        {
            "author": "Tobias Bocanegra",
            "body": "i strongly oppose to apply the suggested patch. stefan is right - the internals of jackrabbit rely on the fact that the config classes are immutable. we should not break this.\n\ni suggest to create some sort of ConfigBuilder which has all the relevant getter and setter methods, and a 'create()' method that creates the immutable config objects.",
            "date": "2006-01-19T23:20:06.000+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "I agree that keeping the config objects immutable would be good. A better solution than the proposed patch is just to make the config constructors public. That way we'd get some of the dynamic configurability that Costin needs while keeping the config objects immutable. (Of course the classes are not final, so they are not absolutely immutable. Any objections to making them final?)\n\nI think that a ComponentBuilder (essentially an IoC tool) would be a better approach than a ConfigBuilder, because it would give much more flexibility. For example a database persistence manager could then have a DataSource as a configuration option instead of the database connection settings. But that's a different discussion.",
            "date": "2006-01-19T23:36:03.000+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "Fixed by making the config constructors public. I also made the config classes final, and added a bit of documentation about configuration handling.",
            "date": "2006-01-20T10:36:22.000+0000",
            "id": 5
        },
        {
            "author": "Costin Leau",
            "body": "The constructor for BeanConfig needs to be made public because all the Config elements rely on it for instantiation (right now the constructor is protected).",
            "date": "2006-01-20T20:15:02.000+0000",
            "id": 6
        },
        {
            "author": "Jukka Zitting",
            "body": "> The constructor for BeanConfig needs to be made public because all the Config\n> elements rely on it for instantiation (right now the constructor is protected).\n\nYou are right, I'm sorry that I missed that.\n\nThe BeanConfig is not really meant to be a part of the public interface, it is currently used in a bit cumbersome manner to construct the strongly typed Config subclasses by just passing the parsed BeanConfig to the parent copy constructor from the Config subclass.\n\nI changed the visibility of the BeanConfig constructors in revision 370793. I hope this covers your immediate needs.",
            "date": "2006-01-20T20:31:40.000+0000",
            "id": 7
        },
        {
            "author": "Costin Leau",
            "body": "Thanks. I'm not in a hurry so I can wait on this one - it's not fun to constantly work on the configuration :)",
            "date": "2006-01-20T20:39:59.000+0000",
            "id": 8
        }
    ],
    "component": "config",
    "description": "From the mailing list (not archived at the moment):\n--- Jukka's reply ---\nI refactored the config classes last year but didn't change the way\nthe config instances are being used by Jackrabbit. In general I think\nthat a IoC approach (use setters to configure the Jackrabbit\ncomponents) would be better than passing config objects around and\nletting the components to instantiate any subcomponents based on the\nconfiguration. This is why I didn't really want to make the config\nconstructors public, otherwise we'd easily up with backwards\ncompatibility issues if we were to change the way configuration is\nhandled.\n---\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-306",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "repositoryConfig should use setter for its internal components",
    "systemSpecification": false,
    "version": ""
}