{
    "comments": [
        {
            "author": "angela",
            "body": "fixed at revision 945528 including for #canReadAll() and #grants(Path, int) where the same inconsistency appeared and added\ntest cases for the former inconsistency.\n",
            "date": "2010-05-18T07:56:41.327+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Merged to the 2.1 branch in revision 989591.",
            "date": "2010-08-26T10:25:45.434+0000",
            "id": 1
        }
    ],
    "component": "jackrabbit-core",
    "description": "JR core 2.0.0\nIn UserAccessControlProvider.compilePermissions(...), if no principal relating to a user node can be found, then a set or read only compiled permissions is provided. That set gives the session read only access to the entire security workspace regardless of path.\n\nIf the user node is found, then an instance of UserAccessControlProvider.CompilePermissions is used and in UserAccessControlProvider.CompilePermissions.buildResult(...) there is a check for no user node. If there is no user node, all permissions are denied regardless of path.\n\nAlthough the first case will never happen for an installation of Jackrabbit where there are no custom PrincipalManagers, I suspect, based on the impl of UserAccessControlProvider.CompilePermissions.buildResult(...) was to deny all access to the security workspace where there was no corresponding user node in a set of principals.\n\nSince this does not effect JR unless there is an external Principal Manager its a bit hard to produce a compact unit test, the issue was found by looking at the code.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-2630",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "UserAccessControlProvider handles users who dont have Jackrabbit managed Principals or User node inconsistently.",
    "systemSpecification": true,
    "version": "2.0"
}