{
    "comments": [
        {
            "author": "Michael Dürig",
            "body": "Fixed at revision: 905699  \n",
            "date": "2010-02-02T16:44:57.993+0000",
            "id": 0
        },
        {
            "author": "Thomas Mueller",
            "body": "I'm wondering if it's really worth adding all those \"@Override\" lines.\nMy opinion is that it just obfuscates the code, without helping. Similar to adding 'final' everywhere.\nTo ensure the code is correct, you anyway need automated tests.\n\nI'm not saying that the commit should be rolled back, just wondering what others think.\nI would favor disabling the compiler warning for missing @Override.\n",
            "date": "2010-02-03T06:47:12.758+0000",
            "id": 1
        },
        {
            "author": "Felix Meschberger",
            "body": "There is probably more to it, than just some syntax.\n\nFor the @Override it helps the compiler ensure correct extension. It is much simpler fixing issues occurring at compile time than to write tests and try to find issues at test/run time. Second it helps identifying overwritten methods when looking at the source without an IDE, e.g. by just skimming SVN with a browser.\n\nFor final: It serves AFAICT two purposes. One it helps preventing overwriting values inadvertedly, thus going into the \"find bugs at compile time\" category as the @Override annotation. The other use it might help compilers and vms optimizie the variable (though this may be of less importance nowadays with advanced compilers and modern VMs).\n\nSo, I think it is a good thing to have them.",
            "date": "2010-02-03T07:04:10.334+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "@Override is IMHO quite useful and I don't think we have too many cases of those (most of the commit was about generics).\n\nHaving too many @Override's around can actually be a good sign of a potential target for refactoring (composition over inheritance).",
            "date": "2010-02-03T07:11:17.141+0000",
            "id": 3
        },
        {
            "author": "Michael Dürig",
            "body": "If a super class (probably due to a library upgrade) removes a method which your code overrides, without @Override your code will compile fine, just your method won't get called anymore. This may lead to very subtle and probably hard to find bugs. With @Override your code wont compile anymore immediately directing you to the problem. \n\nI think the clutter of @Override is very low compared to the value added. \n",
            "date": "2010-02-03T11:09:41.950+0000",
            "id": 4
        },
        {
            "author": "angela",
            "body": "> I'm not saying that the commit should be rolled back, just wondering what others think.\n\ni'm very happy with the changes made by michael and i consider this kind of minor code improvements\nand cleanups as very valuable. the @Override lines never bothered me and they actually are a reasonable\nreplacement for my @see xzw-method comments that i tried to add consistently in order to force the ide\nto inform me about changes made to super-classes such as michael pointed out above [yes, i use to have \njavadoc problems reported as error] ",
            "date": "2010-02-03T12:29:23.049+0000",
            "id": 5
        },
        {
            "author": "Thomas Mueller",
            "body": "Ok, then I will use @Override as well. (But not 'final').",
            "date": "2010-02-03T13:34:53.689+0000",
            "id": 6
        }
    ],
    "component": "jackrabbit-jcr2spi",
    "description": "Add @Override and generics where possible to reduce the number of warnings issued by the compiler.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-2482",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Reduce number of compiler warning by adding @Override and generics where appropriate ",
    "systemSpecification": true,
    "version": "2.1"
}