{
    "comments": [
        {
            "author": "Bart van der Schans",
            "body": "The only problem I can think of is when running two JR instances in one JVM. If that is a concern we could add a method (in the JR api?) to fetch the id. Is this a real concern or can I go ahead and apply the patch?\n",
            "date": "2012-03-09T11:31:20.098+0000",
            "id": 0
        },
        {
            "author": "Alex Deparvu",
            "body": ">  two JR instances in one JVM\nI can see one problem where you start 2 nodes one after the other, the first one generates an id and sets the system property, then the second one will use the already set property as the id.\nThis will break the scenario where you start 2 nodes just to run a simple test on you local machine, and it can probably affect unit testing / integration testing as well.\n\nIf this is only about convenience, probably adding a method to JctUtils would be the easiest.",
            "date": "2012-03-09T14:22:31.846+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "In CRX we expose the cluster node id through an extra \"crx.cluster.id\" repository descriptor. I think Jackrabbit could well do something similar.",
            "date": "2012-03-09T14:28:11.726+0000",
            "id": 2
        },
        {
            "author": "Bart van der Schans",
            "body": "I like the descriptor idea. I'll try to find some time to create a patch,",
            "date": "2012-03-14T13:45:22.166+0000",
            "id": 3
        },
        {
            "author": "Bart van der Schans",
            "body": "Any objections to committing this also to the 2.4 and 2.2 branches?",
            "date": "2012-03-15T15:31:22.198+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "The descriptor, not the system property? No objections here.\n\nWe normally avoid backporting any non-bugfix changes to maintenance branches to reduce the chance of unexpected breakage (and to avoid compatibility issues between two patch releases from the same branch), but the potential impact of a change like this is so minimal that if you find this feature useful then I'm fine with backporting it to 2.4 and 2.2.",
            "date": "2012-03-15T21:32:06.280+0000",
            "id": 5
        },
        {
            "author": "Bart van der Schans",
            "body": "That is exactly the reason why I asked :-) Thx. Backported to 2.4 and 2.2.",
            "date": "2012-03-19T09:25:03.683+0000",
            "id": 6
        }
    ],
    "component": "",
    "description": "I need to know the cluster node id in my application. I didn't find any other way than to cast to org.apache.jackrabbit.core.RepositoryImpl : ((RepositoryImpl) session.getRepository()).getConfig().getClusterConfig().getId()\n\nI would appreciate it if I could get to this using the system property ClusterNode.SYSTEM_PROPERTY_NODE_ID.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-3255",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Access cluster node id",
    "systemSpecification": true,
    "version": ""
}