{
    "comments": [
        {
            "author": "Felix Meschberger",
            "body": "+1\n\nBut don't forget the NodeReferencesId.",
            "date": "2007-11-26T08:41:28.792+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Any objections to this? Otherwise I'll assume lazy consensus in a few days.\n",
            "date": "2008-03-05T16:05:24.599+0000",
            "id": 1
        },
        {
            "author": "Marcel Reutegger",
            "body": "This breaks all existing persistence managers implementations. Are we really willing to accept this, just to make jackrabbit look better in code quality tools?",
            "date": "2008-03-07T12:30:14.514+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "Yes, I'm having second thoughts about this as well now that I looked at it again in more detail.\n\nI'll come up with a proposed patch, but let's delay this until we need to change the PM interface for some other reason.",
            "date": "2008-03-07T12:36:49.506+0000",
            "id": 3
        },
        {
            "author": "Thomas Mueller",
            "body": "Why does it break persistence managers implementations?",
            "date": "2008-03-07T13:01:47.766+0000",
            "id": 4
        },
        {
            "author": "Marcel Reutegger",
            "body": "The various Ids are part of the method signatures of the persistence manager interface.",
            "date": "2008-03-07T14:48:21.723+0000",
            "id": 5
        },
        {
            "author": "Thomas Mueller",
            "body": "So the package name would change.\nThe persistence managers would have to be recompiled.\nAs far as I see that is an acceptable change for 1.5 (not for 1.4.x of course).",
            "date": "2008-03-07T16:30:02.291+0000",
            "id": 6
        },
        {
            "author": "Felix Meschberger",
            "body": "Just my €.02 from the perspective of an OSGi user and modularization lover: Having all these classes mixed with internal implementation code prevents proper separation of API and implementation and in fact prevents proper OSGi separation. For example, it would be almost impossible to make the API externally visible and not at the same time make the implementation visible ...\n\nIMHO this is not a matter of  making \"jackrabbit look better in code quality tools\", it is a matter of good programming style (oh yeah, another one from pandorra's box) supporting separation of concern.",
            "date": "2008-03-12T15:33:01.223+0000",
            "id": 7
        },
        {
            "author": "Jukka Zitting",
            "body": "Side note: IMHO for code to look good in code quality tools is or at least should be equivalent to good programming style. If not, then there's something wrong with the tools. :-)\n\nAs for why I think moving the Ids to a separate package is especially important for code quality tools: as long as they are in o.a.j.core many tools have trouble identifying circular dependencies and other design issues beyond the obvious o.a.j.core.foo -> o.a.j.core dependencies caused by the Id classes. Creating o.a.j.core.id will not solve those issues, but will at least make them more visible and thus easier to solve.",
            "date": "2008-03-12T16:18:02.305+0000",
            "id": 8
        },
        {
            "author": "Jukka Zitting",
            "body": "Done in revision 792437. Targeting for Jackrabbit 2.0.\n",
            "date": "2009-07-09T08:38:07.932+0000",
            "id": 9
        }
    ],
    "component": "jackrabbit-core",
    "description": "I'd like to create a separate package for the identifier interfaces and classes in jackrabbit-core. Currently all the identifiers are in org.apache.jackrabbit.core, which makes almost all the other packages have dependencies to o.a.j.core and causes trouble for various package-level code quality and dependency analysis tools.\n\nFor now the package would contain the ItemId, NodeId, and PropertyId classes.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1233",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Create org.apache.jackrabbit.core.id",
    "systemSpecification": true,
    "version": ""
}