{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Another Jackrabbit 2.0 blocker.",
            "date": "2009-09-18T16:11:16.263+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "I updated the Jackrabbit compatibility test harness and it reports no more failures when opening Jackrabbit 1.x repositories with Jackrabbit 2.0. Thus resolving as Fixed.",
            "date": "2010-01-13T14:26:23.913+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "reopening.... from what i remember we have backwards compatibility issues introduced by\n\nJCR-1944: the property type of privileges has changed from STRING to NAME between 1.5 and 1.6.\n                     so upgrading from 1.5 is prone to be problematic.\nJCR-2313: the issue lists a couple of areas that could cause problems.\n\nI'm not sure if there is anything we have to do about those. but I would feel comfortable if\nwe could test these and - if they really turn out to be problems - at least state it somewhere.\n\nthanks\n\n",
            "date": "2010-01-14T12:45:44.186+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "I added a backwards compatibility section the the Jackrabbit 2.0 release notes and included the following:\n\n    Repositories that have used the new JSR 283 security features included\n    as a development preview in Jackrabbit 1.5 and 1.6 may face problems\n    when upgrading to Jackrabbit 2.0. See especially JCR-1944 and JCR-2313\n    for more details.\n\nI guess that's enough for now on this issue, so resolving as fixed.",
            "date": "2010-01-20T13:55:55.473+0000",
            "id": 3
        }
    ],
    "component": "jackrabbit-core",
    "description": "Jackrabbit 2.0 contains some changes that are not compatible with repositories created with earlier versions. It would be nice if Jackrabbit would automatically detect and upgrade repositories created with 1.x versions.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-2243",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Blocker",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Automatic upgrade to 2.0",
    "systemSpecification": true,
    "version": ""
}