{
    "comments": [
        {
            "author": "Thomas Mueller",
            "body": "This tool can also be used for older version of Jackrabbit.",
            "date": "2011-08-23T14:57:59.623+0000",
            "id": 0
        },
        {
            "author": "Alex Deparvu",
            "body": "Good idea.\nIs it possible to have the analyzer point to the problems? Rather than relying on manual validation of the properties found in the broken bundle?\n\nMaybe a status message after the dump? along the lines of: \n - bundle check ok \nor\n - bundle check failed: broken properties are (or might be): p1, p2...\n\nFor example, I'm looking at a bundle that has >35 properties, how can I know what is going on?",
            "date": "2011-08-24T10:29:24.104+0000",
            "id": 1
        },
        {
            "author": "Thomas Mueller",
            "body": "The tool doesn't try to detect broken properties currently, who and why would you want to detect them?\n\n> I'm looking at a bundle that has >35 properties, how can I know what is going on?\n\nI used it to manually read the data. I already knew the bundle was broken, because loading the bundle failed, so I knew roughly what the problem was (couldn't parse a timestamp because the year was out of range), but I needed to see the actual data.\n\nFor what I used the tool (to easily analyze broken bundles), it works well, but I wonder if adding more complexity is really necessary - I don't need more features currently.\n\nBut if have a use case then that's different of course.\n",
            "date": "2011-08-24T11:47:23.713+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "It would be great if we could refactor things so that no code duplication between BundleReader and BundleDumper is needed.",
            "date": "2011-08-24T12:03:34.672+0000",
            "id": 3
        },
        {
            "author": "Thomas Mueller",
            "body": "> It would be great if we could refactor things so that no code duplication between BundleReader and BundleDumper is needed.\n\nI agree, that would be great. However I don't see how it's possible.",
            "date": "2011-08-24T12:33:07.928+0000",
            "id": 4
        }
    ],
    "component": "",
    "description": "The BundleReader fails if it can't read a bundle. We should have a tool to analyze broken bundles.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-3058",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "BundleDumper to analyze broken bundles",
    "systemSpecification": true,
    "version": ""
}