{
    "comments": [
        {
            "author": "Julian Reschke",
            "body": "The remaining issue is caused by NODE_REMOVE events not having an identifier.\n\nIdentifiers are currently generated by the URIResolver, based on the URI of the node reported in the event. The URI resolver then does a PROPFIND, asking for the UUID, the local name (unescaped), and the index, from which a local identifier is built.\n\nThis, of course, doesn't work for nodes that were just deleted (unless the information happens to be cached).\n\nAs a matter of fact, the events returned by the server *do* contain the server's identifier for that event. Unfortunately, these identifiers are no quite the same as those needed in spi2dav, which only uses UUID-style identifiers for referenceable nodes, while jackrabbit-core uses them throughout.\n\nThe obvious fix would be to augment the event information sent by the server with more information, so that the subsequent PROPFIND is never needed.\n\nPutting this on hold while looking at the other observation related tickets...",
            "date": "2011-11-04T17:13:14.921+0000",
            "id": 0
        },
        {
            "author": "Julian Reschke",
            "body": "Updated summary now that the changes for JCR-2542 provide us with node type information:\n\nWe can now inspect the event and find out whether the node was referenceable, and if it was, compute the local node id from the remote id; this will remove the needed for any subsequent PROPFINDing\n\nI believe this would also clear the remaining failure in the GetIdentifierTest.\n\nWhat's not so nice is that this *only* works for referenceable nodes. For non.referenceable nodes, we'd need the nodeId of the parent (which may be unknown if it's removed as well).\n\nWe *might* have the parentId though if the associated event was received as well, and we have been able to compute *that* nodeId.\n\nRephrasing all of this...: -)\n\n- problem can be fixed for removal of referenceable nodes\n- for other nodes we need the parentId, which might be cached (*)\n\n(*) Doing two passes through an event bundle might help in case the events arrive in the \"wrong\" order\n\nHowever, if all else fails, we only have a few choices:\n\n(1) Drop the event\n(2a) Keep the event, and return null identifier (this is what happens now)\n(2b) ..., and compute the identifier based on the relative path to the closest ancestor nodeId we know; if an intermediate node *was* refererenceable, this would be an incorrect identifier\n\nFeedback appreciated, Julian\n",
            "date": "2011-11-17T14:18:06.988+0000",
            "id": 1
        },
        {
            "author": "Julian Reschke",
            "body": "Actually me recollection was wrong; the node removal test does not use a referenceable node.",
            "date": "2011-11-17T16:35:41.605+0000",
            "id": 2
        },
        {
            "author": "Julian Reschke",
            "body": "Correction: the node type information is for the associated parent node; so this doesn't help in fixing out whether the node itself was referenceable.",
            "date": "2011-11-17T18:12:17.173+0000",
            "id": 3
        },
        {
            "author": "Julian Reschke",
            "body": "Summarizing the remaining open issue:\n\nWe fail to compute an identifier for NODE_REMOVE events because computing the local identifier currently requires a lookup (PROPFIND) of the remote resource's properties (UUID, name, index). We *do* have the remote resource's identifier (as part of the event), but it's not necessarily the same locally, because the way identifiers are assigned is not the same (jackrabbit-core has uuids for all nodes, spi2dav only for referenceable nodes).\n\nThings we can do to improve things:\n\n(1) Make sure that the URIResolver cache is populated with mappings for all nodes the client is touching (right now this is not the case).\n\n(2) When not able to lookup the remote resource, compute an identifier solely based on the remote resource's href; that's not necessarily the one the client might have seen before, but it might be better than \"null\". Also note that if we do (1), we may already have the identifier. For nodes created by other sessions I think it's acceptable that the identifiers returned with REMOVAL events are slightly off (there are also RepositoryDescriptors reporting identifier stability we could tune).\n\n(3) Avoid doing the remote PROPFIND when it was a REMOVE event. If we ever get a 207, it'll be for a different resource anyway.\n\nFeedback appreciated...\n\n",
            "date": "2011-11-21T18:07:51.858+0000",
            "id": 4
        },
        {
            "author": "Marcel Reutegger",
            "body": "I think, I would do it on a best effort basis and build a path based identifier for the event in case the URI cannot be translated into a UUID based identifier.\n\nSee proposed patch.",
            "date": "2011-11-22T11:31:06.218+0000",
            "id": 5
        },
        {
            "author": "Julian Reschke",
            "body": "Yes, that works for me.\n\nProposal:\n\n- document the remaining non-conformance somewhere (where? JIRA todo?)\n\n- clean up the code a bit (I'd like to avoid the PROPFIND that we know will cause a 404)",
            "date": "2011-11-22T13:49:28.631+0000",
            "id": 6
        },
        {
            "author": "Julian Reschke",
            "body": "Fixed in trunk with r1205029.\n\n\"Fixed\" means here: test case passes. We are still not fully compliant here; will fix a separate issue as TODO.",
            "date": "2011-11-22T15:22:59.525+0000",
            "id": 7
        }
    ],
    "component": "jackrabbit-jcr-server, jackrabbit-spi2dav, JCR 2.0, observation",
    "description": "all TCK tests including move or reorder fail in the setup jcr2spi - spi2dav(ex) - jcr-server.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-2540",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "spi2dav : move/reorder not properly handled by observation",
    "systemSpecification": true,
    "version": "2.0"
}