{
    "comments": [
        {
            "author": "Tobias Bocanegra",
            "body": "fixed.\nCommitted revision 486082.\n",
            "date": "2006-12-12T10:11:15.000+0000",
            "id": 0
        },
        {
            "author": "Tobias Bocanegra",
            "body": "well, almost :-)\n\nadded the new methods to NamespaceRegistryImpl but did not alter indexer code. Assigning to marcel for further processing.",
            "date": "2006-12-12T10:12:33.000+0000",
            "id": 1
        },
        {
            "author": "Marcel Reutegger",
            "body": "The query handler now uses the stable index prefix from the namespace registry. This change is backward compatible in a sense that the lucene query handler will still use the old mechanism if it discovers an existing ns_mappings.properties file in the index directory. A new jackrabbit installation will\ntherefore use the new mechanism while an upgraded jackrabbit installation will still use the old mechanism. If you want to use the stable index prefixes from the namespace registry in an existing\njackrabbit installation you need to re-index the repository (stop jackrabbit, delete the index directories and start jackrabbit again).\n\nFixed in revision: 486099",
            "date": "2006-12-12T11:23:49.000+0000",
            "id": 2
        }
    ],
    "component": "indexing",
    "description": "The NamespaceMappings class in the indexer is used for generating small prefixes for namespace uris that are stored in the index. This mechanism of stable prefixes could be used in other places as well, for example in the persistence managers.\n\nSuggest to introduce general methods in the namespace registry:\n\nint getURIIndex(String uri)\nString getURI(int index)\n",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-669",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Move NamespaceMappings/Index from lucene to namespace registry.",
    "systemSpecification": true,
    "version": ""
}