{
    "comments": [
        {
            "author": "Roman Puchkovskiy",
            "body": "Attaching a workaround patch. It adds a static method which executes same actions as shutdown hook does and unregisters shutdown hook.",
            "date": "2008-06-01T09:44:25.102+0000",
            "id": 0
        },
        {
            "author": "Stefan Guggisberg",
            "body": "applied patch in svn r663634.\n\nthanks!",
            "date": "2008-06-05T14:53:39.839+0000",
            "id": 1
        },
        {
            "author": "Roman Puchkovskiy",
            "body": "I'm not sure is it correct to reopen the issue, but it turned out that the supplied patch breaks class unloading in some cases. I'm going to attach a patch which stops the reaper thread too, so no problems arise because of it.",
            "date": "2008-07-02T12:41:15.839+0000",
            "id": 2
        },
        {
            "author": "Roman Puchkovskiy",
            "body": "This patch stops the ReaperThread on shutdown too.",
            "date": "2008-07-02T12:42:22.663+0000",
            "id": 3
        },
        {
            "author": "Alexander Klimetschek",
            "body": "Once a patch is applied to svn and the bug is closed, it is better to create another issue instead of re-opening. You can link to this bug with \"relates to\" to connect the dots. The new JCR-1668 you created is a good fit - I created the link and close this bug, could you upload your patch to the other issue and provide the comments (so they are coming directly from you and not from me)?",
            "date": "2008-07-02T23:35:45.111+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-jcr-commons",
    "description": "TransientFileFactory class always registers shutdown hook. So, if jackrabbit classes were loaded by web-app classloader, they will not be released when web-app is undeployed (if jackrabbit-jcr-commons JAR is inside WAR). This causes classloader leak.\nIt seems to be useful to have ability to cancel TransientFileFactory's shutdown hook when application is going to be unloaded to avoid classloader leak.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1636",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Make shutdown hooks in TransientFileFactory removable",
    "systemSpecification": true,
    "version": "1.4, commons 1.4.2"
}