{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "Inverting lucene documents is not done with the help of a thread pool. The size of the pool is equal to the number of processors. The pool size is automatically adjusted if the number of available processors changes. E.g. processor affinity is changed.\n\nsvn revision: 596654",
            "date": "2007-11-20T13:51:59.650+0000",
            "id": 0
        },
        {
            "author": "Marcel Reutegger",
            "body": "The diagram shows the running times for re-indexing 20'000 nodes.\n\nThe first test used nodes with about 2kB of text, whereas the second test used text with about 12kB text.\n\nEach test was performed with:\n- process bound to single core\n- process uses both cores with current codebase\n- process uses both cores with changes from JCR-1222",
            "date": "2007-11-20T13:56:35.921+0000",
            "id": 1
        },
        {
            "author": "Ard Schrijvers",
            "body": "This is great Marcel! An impressive performance gain. \n\nFYI : I lately tried searching in the multiIndex structure with the lucene ParallelMultiSearcher but I merely found a decrease in speed (even on large indexes). I think it was because of filesystem access which might get worse (random access) in using parallel searching on indexes on a single FS (must admit I am guessing a little)",
            "date": "2007-11-20T14:11:10.545+0000",
            "id": 2
        }
    ],
    "component": "indexing, jackrabbit-core",
    "description": "CPUs with multiple cores are now standard and Jackrabbit should make use of it where it makes sense. Analyzing content while a node is indexed is quite costly, but can be broken easily into task that can be executed in parallel. E.g. index multiple nodes in parallel.",
    "hasPatch": false,
    "hasScreenshot": true,
    "id": "JCR-1222",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Index nodes in parallel",
    "systemSpecification": true,
    "version": ""
}