{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "> old non-pooled configurations to benefit from connection pooling\n\nwhat's the configuration diff between those two? or more specifically, are there configuration parameters that only apply to non-pooled PMs?",
            "date": "2010-11-03T13:13:13.952+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "> what's the configuration diff between those two?\n\nIIRC there are no configuration parameters in the non-pooled PMs that don't exist in the pooled counterparts. In case there are (need to check that), it should be easy to implement them also in the pooled versions.",
            "date": "2010-11-03T13:35:04.112+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Done in revisions 1036356 and 1036365.\n\nI reviewed the configuration parameters, and verified that all parameters supported by non-pooled bundle db PMs are also supported by the respective pooled versions.",
            "date": "2010-11-24T15:52:44.539+0000",
            "id": 2
        }
    ],
    "component": "config, jackrabbit-core",
    "description": "In JCR-1456 and Jackrabbit 2.0 we introduced database connection pooling, but decided to keep the existing database bundle persistence managers intact to avoid potential regressions. We haven't seen such problems even though pooled bundle persistence has been the default since the 2.0 release, so I think it would be safe to deprecate all the non-pooled bundle DB PMs.\n\nAnd in order to remove duplicate code (that has already complicated some changes within o.a.j.persistence), I'd also take the extra step of  making the o.a.j.p.bundle.* classes extend respective the o.a.j.p.pool.* classes. This would automatically allow also old non-pooled configurations to benefit from connection pooling.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-2803",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Deprecate non-pooled bundle DB persistence managers",
    "systemSpecification": true,
    "version": ""
}