{
    "comments": [
        {
            "author": "Alex Deparvu",
            "body": "Attached initial jmx support patch.",
            "date": "2011-04-01T11:11:54.227+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "I committed the patch in revision 1089061. Good work!\n\nAs you mention, the solution still need some work, so I'm leaving this issue open.\n\nThe most notable design issue I have with the current solution is that the JMX code now spills over to other parts of the codebase. A cleaner approach would be to statistics collectors right there with the query manager and other similar places with no JMX dependencies, and have the JMX code simply access that information through the RepositoryContext. Such an approach makes the collected statistics and other runtime information easier to use also for non-JMX purposes.",
            "date": "2011-04-05T14:40:38.085+0000",
            "id": 1
        },
        {
            "author": "Alex Deparvu",
            "body": "apparently when running multiple tests on the repository, the jmx bean registration fails in the initialization part.\n\nit may have something to do with the way the test repo is setup, but either way, it fails constantly\n\nI'm attaching a patch that fixes this problem.\n\nFor the design improvements, I'm still planning it out :)",
            "date": "2011-04-14T11:57:28.457+0000",
            "id": 2
        },
        {
            "author": "Stefan Guggisberg",
            "body": "> It is not enabled by default, so just being there should not affect the overall performance too much.\n\nwhat do you mean by \"not too much\"? can you provide performance figures?",
            "date": "2011-08-04T14:27:33.868+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "In revision 1160161 I created a branch (jackrabbit/branches/JCR-2936) for this and the related JCR-3040 work.",
            "date": "2011-08-22T09:35:37.200+0000",
            "id": 4
        },
        {
            "author": "Alex Deparvu",
            "body": "I've created JCR-3117 to track the work on PM stats. The patch is for trunk.\n\nFYI work on the dedicated branch (jackrabbit/branches/JCR-2936) has been merged back to trunk due to having to sync all the time, which was rather time consuming.",
            "date": "2011-10-17T15:24:09.708+0000",
            "id": 5
        },
        {
            "author": "Alex Deparvu",
            "body": "Marking as resolved. Further dev should follow on its own issue. This one is kinda fat already.",
            "date": "2011-11-22T22:36:50.211+0000",
            "id": 6
        }
    ],
    "component": "jackrabbit-core",
    "description": "There has been a slight interest in the past for adding JMX support.\nThis would be the first stab at it. It is a Top 15 slow query log. (the 15 part is configurable)\n\nIt is not enabled by default, so just being there should not affect the overall performance too much. You can enable it and play a little, tell me what you think.\nI've also added a test case that does a duration comparison with and without the logger.\n\nThe most important part of this issue is that it should open the way for some proper monitoring tools support around queries, caches, anything/everything Jackrabbit.\n\nAs usual, please let me know what you guys think",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-2936",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "JMX Bindings for Jackrabbit",
    "systemSpecification": true,
    "version": ""
}