{
    "comments": [
        {
            "author": "angela",
            "body": "initial draft for an ItemCache interface and an example implementation that uses an LRUMap.\nIn addition the patch moves the ItemLifeCycleListening from the ItemManager to the ItemCache and enables the ItemManager to listen to creation of ItemStates. The latter would be required to take advantage of the Batch-Read mechanism, that not only creates ItemStates for the 'requested' Item. Up to now those states were created and attached to their hierarchy-entry (both only being addressed by weak references).\n\nApart from the tests present with the build, i didn't yet perform any sophisticated tests, that measure the effect of the ItemCache.\n\ncomments?",
            "date": "2007-12-04T10:03:13.340+0000",
            "id": 0
        },
        {
            "author": "angela",
            "body": "scheduled for 1.4",
            "date": "2007-12-04T10:03:45.215+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Dropping from 1.4, looks nice but probably not essential for this release.",
            "date": "2007-12-20T22:23:57.287+0000",
            "id": 2
        },
        {
            "author": "Marcel Reutegger",
            "body": "I consider this a very important improvement to jcr2spi. Without this patch the cache is basically useless because it only uses weak references to Item instances.\n\nI suggest we include this in the 1.4 release.",
            "date": "2007-12-21T17:30:48.268+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "I'll include this if it's in svn trunk before the end of next week. :-)\n\nI think the main focus for SPI in the 1.4 release is to introduce the jackrabbit-spi interfaces and to showcase the jcr2spi/spi2jcr stack. Optimum performance is IMHO a secondary concern for now, we can always improve on that in subsequent releases.",
            "date": "2007-12-21T19:59:33.420+0000",
            "id": 4
        },
        {
            "author": "Marcel Reutegger",
            "body": "too bad, my previous comment to this issue was the last thing I did before I went on a two week vacation :-/\n  \nBut you are right, this can also be added in the next release.",
            "date": "2008-01-08T09:12:03.937+0000",
            "id": 5
        },
        {
            "author": "Julian Reschke",
            "body": "I have tested the patch with my SPI implementation and see no regressions. As it doesn't currently make any use of BatchRead, I'm not seeing performance changes either.\n\n+1 for including it so more tests can be done.\n",
            "date": "2008-02-07T13:36:35.110+0000",
            "id": 6
        },
        {
            "author": "angela",
            "body": "ok. committed (hopefully same as patch...)",
            "date": "2008-02-07T14:01:43.462+0000",
            "id": 7
        }
    ],
    "component": "jackrabbit-jcr2spi",
    "description": "Currently the ItemManager implementation uses a simple map with weak keys (ItemState) and weak values (Item) as cache.\nMarcel recently suggested to replace this with a more sophisticated cache mechanism that can be configured.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1011",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "JCR2SPI: add configurable cache for Item instances (ItemManager)",
    "systemSpecification": true,
    "version": ""
}