{
    "comments": [
        {
            "author": "Tobias Bocanegra",
            "body": "Patch that contains the new bundle persistence managers.",
            "date": "2007-02-20T15:29:49.585+0000",
            "id": 0
        },
        {
            "author": "Martijn Hendriks",
            "body": "Added Oracle-specific blob handling to the bundle OraclePersistenceManager, which seems to work fine now.",
            "date": "2007-03-02T10:46:18.680+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "I'm still waiting for the Day CCLA addendum to be recorded as received before I can proceed with the IP clearance process. Once the ASF secretary acknowledges the addendum as received, I will call a vote on the Incubator PMC to confirm the IP as cleared. Once (or if) the 72 hour vote passes, it's OK to commit the changes to svn. I'll keep you posted on the progress.",
            "date": "2007-03-05T12:13:25.044+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "The IP has been cleared and it's now OK to commit the changes to svn.\n\nThe record of the IP clearance process is at http://incubator.apache.org/ip-clearance/jackrabbit-bundle-persistence.html",
            "date": "2007-03-11T21:12:40.300+0000",
            "id": 3
        },
        {
            "author": "Tobias Bocanegra",
            "body": "comitted the code in r517150. \n\ni opened a new issue for the oracle problem: JCR-786",
            "date": "2007-03-12T09:57:30.123+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-core",
    "description": "we (day software) offer our set of bundle persistence managers to the jackrabbit project. those pms combine the node and property states into a single bundle and store them together. this improves performance and reduces storage-memory overhead (no exact numbers available). The bundle pms also have a \"bundle-cache\" that does a memory sensitive caching of the bundles and a negative cache for non-existent bundles. small binary properties are inlined into the bundle rather than stored in the blobstore.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-755",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Add Bundle Persistence Managers",
    "systemSpecification": true,
    "version": ""
}