{
    "comments": [
        {
            "author": "Brian Moseley",
            "body": "this patch also makes all of DavResourceImpl's private methods protected, so that subclasses can use them. sorry that i didn't extract those changes from the patch - i figured they'd be easy to spot and difficult to pull from the patch and get the remaining line numbers right.",
            "date": "2005-08-11T10:36:58.000+0000",
            "id": 0
        },
        {
            "author": "Brian Moseley",
            "body": "DavResourceImpl should also honor the ResourceFilter when setting and removing properties.",
            "date": "2005-08-12T04:22:08.000+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "as you may have noticed there is a //todo in the DavResourceImpl that addresses the issue of filtering properties.\n\nhowever, i intended to create a ResourceFilter... with that change it would turn into an ItemFilter. i will think about it.\n\nregards\nangela",
            "date": "2005-08-12T16:44:33.000+0000",
            "id": 2
        },
        {
            "author": "Brian Moseley",
            "body": "yup, i did notice the todo. i needed to implement PROPPATCH property filtering, so i thought i'd submit my changes to give you something to start with. i'm not married to the implementation - i just did what was easiest for me, knowing that you'd probably revise it later.\n",
            "date": "2005-08-13T02:38:22.000+0000",
            "id": 3
        },
        {
            "author": "Brian Moseley",
            "body": "this patch implements property filtering against the current HEAD revision without the extra noise of the previous patch (which is now removed).\n\nangela, your previous comment still stands, so i'd like to hear your current thoughts on the issue.\n",
            "date": "2005-12-08T02:57:13.000+0000",
            "id": 4
        },
        {
            "author": "Brian Moseley",
            "body": "whoops, mistakenly deleted the patch i just uploaded ;)",
            "date": "2005-12-08T02:58:01.000+0000",
            "id": 5
        },
        {
            "author": "angela",
            "body": "oh yes... this one is still open... forgot about it, sorry.\n\nyes, why not. i will apply the changes but also rename the filter class.\nregards\nangela",
            "date": "2005-12-08T03:16:16.000+0000",
            "id": 6
        },
        {
            "author": "Brian Moseley",
            "body": "/cheer\n",
            "date": "2005-12-08T03:22:05.000+0000",
            "id": 7
        },
        {
            "author": "angela",
            "body": "will be fixed as follows:\n\n- rename ResourceFilter -> ItemFilter\n- rename check methods: isFilteredItem instead of isFilteredResource\n- rename default implementation\n\n- DavResourceImpl:\n   > remove todo for props\n   > rename isFilteredNode to isFilteredItem\n   > no need for extra method checking filtering status of properties.\n\n- change config.xml and adjust description.",
            "date": "2005-12-08T18:49:24.000+0000",
            "id": 8
        },
        {
            "author": "angela",
            "body": "rev. 355130",
            "date": "2005-12-09T01:27:57.000+0000",
            "id": 9
        }
    ],
    "component": "",
    "description": "attached is a patch that implements jcr property filtering in jcr-server in the same way that nodes and resources are filtered. with the default filter configuration, this has the effect of filtering jcr:created, jcr:mixinTypes, and jcr:primaryType from nt:folder and nt:file nodes. \n\nthis is likely the expected default behavior for most webdav servers - they want to return the normal dav properties, live properties defined themselves, and dead properties defined by clients, but not jcr-internal properties which are for all intents and purposes implementation-specific.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-185",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "filter jcr properties in jcr-server",
    "systemSpecification": false,
    "version": ""
}