{
    "comments": [
        {
            "author": "Jan Kuzniak",
            "body": "Pom parent patch attached. It consists of three parts due to problems with Tortoise SVN. First two are simple .patch files; third is new file that has to be copied to main directory (with its directories).\n\nI hope that it is not too obfuscated.\n\njcr-server is not pommed yet because of pending restructurisation (i.e. I'm waiting for Angela).",
            "date": "2006-11-17T10:22:43.000+0000",
            "id": 0
        },
        {
            "author": "angela",
            "body": "uuuuuuuuuuuuuuuh....... and i was waiting for an ok... since my suggestion would lead\nto quite some move and restructuring of the jcr-server and i was not sure, if this\nwas ok for everybody.\n\nthe suggestion was:\n\n----< copy from dev-list mail >-----------------------------------------------------------------------------------\n\nwithout having a closer look at it, i could imagine the\nfollowing structure:\n\n+ jackrabbit\n  + webdav\n  + webapp     (repository-access etc., no dav-servlets).\n  + jcr-server (2 implementations; to be split later on; maybe rename)\n\nthis would mean:\n\n- one top-level 'webdav'\n- integrate 'client' classes into the 'webdav' project\n- integrate that impl. independant part of 'server' into the webdav\n  project\n- create 'webapp' project (but moving the implementation servlets\n  out and into 'jcr-server'... i don't know if this is feasible...)\n- 'jcr-server' would then only contain the implementations and\n  the servlets and could be split in a separate step.\n  (the original reason for JCR-417 was to clarify the difference\n  between the 2 implementations). \n\n----< copy from dev-list mail >-----------------------------------------------------------------------------------\n\nkind regards",
            "date": "2006-11-17T10:43:22.000+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "> Pom parent patch attached.\n\nThanks! Actually I already implemented some of this, see revision 472445 and followups, but your changes are more complete so I'll see how I can merge the changes.\n\n> third is new file that has to be copied to main directory (with its directories). \n\nYou mean textfilters/changes/changes.xml? I don't see why we should need a file like that.",
            "date": "2006-11-17T11:20:04.000+0000",
            "id": 2
        },
        {
            "author": "Jan Kuzniak",
            "body": "Jukka:\n> You mean textfilters/changes/changes.xml? I don't see why we should need a file like that.\nI just moved everything that I could from maven1 to maven2. There was changelog turned on in maven1 so I made it avaiable for maven2 as well. It seems to be quite informative report so I would think about turning it on in core or super project as well.\n\nAngela:\n> uuuuuuuuuuuuuuuh....... and i was waiting for an ok... [...]\nHeh, classic dead lock. I have to admit that I have the foggiest idea what sits inside jcr-server so I am was waiting for any decision. What do you think Jukka, should Angela make it real, or should I maven2 jcr-server as it is at the moment?\n\nRegards!",
            "date": "2006-11-17T11:34:05.000+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "> There was changelog turned on in maven1 so I made it avaiable for maven2 as well.\n> It seems to be quite informative report so I would think about turning it on in core or super project as well.\n\nWe'll probably limit the amount of reports that get generated for the public Jackrabbit web site, but enable quite a few to be generated as a part of the nightly builds I'm going to set up. See JCR-611 and INFRA-1008 for the progress.\n\n> What do you think Jukka, should Angela make it real, or should I maven2 jcr-server as it\n> is at the moment?\n\nI'm not too much of an expert on the webdav components, but Angela's plan looks good to me. I think we should go with that.\n",
            "date": "2006-11-17T14:03:20.000+0000",
            "id": 4
        },
        {
            "author": "angela",
            "body": "done.\njcr-server subprojects ==> moved one level up.\n\nformer structure was:\n========================================================================\n\n+ jackrabbit\n    + contrib\n    + jackrabbit\n    + jcr-rmi\n    + jcr-server\n         + client       (artifactId = jackrabbit-jcr-client)\n               +src \n                  + java\n         + server     (artifactId = jackrabbit-jcr-server)\n               +src \n                  + java\n         + webdav  (artifactId = jackrabbit-jcr-webdav)\n               +src \n                  + java\n         + webapp  (artifactId = jackrabbit-server)\n               +src \n                  + java\n                  + webapp\n\n\nnew structure is:\n========================================================================\n\n+ jackrabbit\n    + contrib\n    + jackrabbit\n    + jcr-rmi\n    + jcr-server          (artifactId = jackrabbit-jcr-server)\n          + src\n              + main\n                  + java\n    + webdav             (artifactId = jackrabbit-webdav)\n          + src\n              + main\n                  + java\n    + webapp           (artifactId = jackrabbit-webapp)\n          + src\n              + main\n                  + java\n                  + webapp\n\nexcept from the client code that was merged into the webdav project, i didn't move around\nany sources up to now.\n\nin additiion the dependencies in following projects have been adjusted:\n\n- contrib/jcr-browser\n- contrib/spi\n\ni'll send a specific notification to the dev-list later on.\nangela\n",
            "date": "2006-11-21T14:52:26.000+0000",
            "id": 5
        },
        {
            "author": "Jan Kuzniak",
            "body": "I have just ripped out jackrabbit-api and jackrabbit-commons and jackrabbit-core out of jackrabbit artifact (that is now empty). It is quite a big change and providing .patch file or everything zipped in here is hard to imagine. What are your preferences on how should I bring it here? I am thinking of one batch file or one ant file that when executed will copy files here and there. \n\nI am awaiting your comments. In the meantime I'll pom jcr-server, webdav and webapp. \n\nRegards,\n Jan",
            "date": "2006-11-28T16:10:22.000+0000",
            "id": 6
        },
        {
            "author": "Jukka Zitting",
            "body": "Jan Kuzniak:\n> What are your preferences on how should I bring it here? I am thinking of one batch file or one\n> ant file that when executed will copy files here and there.\n\nI'd most prefer a sequence of unix commands to execute, as I'd like to execute the changes manually if possible. An ant script or a batch file is fine as well, though I'll probably still evaluate it manually.",
            "date": "2006-11-29T21:14:57.000+0000",
            "id": 7
        },
        {
            "author": "Jan Kuzniak",
            "body": "As you wish: there you have a patch with all restructurisation and maven2 poms in one unix script. Just put directory _restructurisationPath inside trunk and run patch.sh inside this dir and in a short while you have everything done. I hope that I didn't miss anything.\n\nRegards,\n Jan",
            "date": "2006-11-30T13:39:50.000+0000",
            "id": 8
        },
        {
            "author": "Jukka Zitting",
            "body": "Looks great, thanks a lot! I'll go forward with the changes this weekend.",
            "date": "2006-11-30T15:44:23.000+0000",
            "id": 9
        },
        {
            "author": "Jukka Zitting",
            "body": "OK, I'll start applying the restructuring changes now. For anyone listening, please be aware of potential breakdown of the Jackrabbit build environment during these changes. You may want to avoid svn checkouts and updates until I'm done.",
            "date": "2006-12-03T11:45:49.000+0000",
            "id": 10
        },
        {
            "author": "Jukka Zitting",
            "body": "Restructuring done! See the \"Subversion Commits\" tab for the extensive list of changes. The new structure is now:\n\ntrunk/\n    jackrabbit-api\n    jackrabbit-core\n    jackrabbit-index-filters\n    jackrabbit-jca\n    jackrabbit-jcr-commons\n    jackrabbit-jcr-rmi\n    jackrabbit-jcr-server\n    jackrabbit-jcr-tests\n    jackrabbit-webapp\n    jackrabbit-webdav\n\nEach of these directories (including trunk) contains a Maven 2 project and a README file with a decent summary and basic build instructions.\n\nThe inter-component dependencies are:\n\n    jackrabbit-api\n    jackrabbit-core: jackrabbit-api jackrabbit-commons jackrabbit-jcr-tests\n    jackrabbit-index-filters: jackrabbit-core\n    jackrabbit-jca : jackrabbit-core\n    jackrabbit-jcr-commons\n    jackrabbit-jcr-rmi\n    jackrabbit-jcr-server: jackrabbit-commons jackrabbit-webdav\n    jackrabbit-jcr-tests\n    jackrabbit-webapp: jackrabbit-core jackrabbit-server jackrabbit-jcr-rmi\n    jackrabbit-webdav: jackrabbit-commons\n\nI'll probably still be tweaking some details, but since all the main parts are now in place, compile, and seem to work just fine, I'll resolve this issue as Fixed. Please file separate bug reports for anything that doesn't work.",
            "date": "2006-12-03T23:28:09.000+0000",
            "id": 11
        }
    ],
    "component": "",
    "description": "Reintroduce some of the changes in JCR-157 as a more general restructuring to simplify the Jackrabbit project structure. See http://thread.gmane.org/gmane.comp.apache.jackrabbit.devel/9170/ for the rationale and discussion. The main parts of this restructuring would be:\n\n1. Create a Jackrabbit \"super-project\" (artifactId: jackrabbit) in trunk/\n\n2. Use the super-project POM as the parent of all Jackrabbit component POMs\n\n3. Move the contents of trunk/jackrabbit/src/site directly to trunk/src/site, and use the super-project to generate the web site\n\n4. Create independent subprojects for the the jackrabbit-api and jackrabbit-commons components, moving the the corresponding parts of the source tree\n\n5. Move the jcr-server subprojects on level up\n\n6. Rename the subproject directories to match their artifactIds\n\nNote that this restructuring depends on JCR-611 and JCR-332, since the best way to implement this by utilizing a snapshot repository for the component dependencies.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-612",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Restructure the Jackrabbit source tree",
    "systemSpecification": true,
    "version": ""
}