{
    "comments": [
        {
            "author": "Julian Reschke",
            "body": "This implements the additional checks; getting the root version plus the root version's frozen node.",
            "date": "2011-10-07T13:23:11.692+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Looks good. As you mentioned, a more fine-grained recovery would be nice, but for now simply disconnecting a node from a broken version history seems good enough. Another potentially useful future improvement would be to check not just the root version but also all other versions in the history.",
            "date": "2011-10-07T13:52:48.877+0000",
            "id": 1
        },
        {
            "author": "Julian Reschke",
            "body": "Indeed I wasn't sure about how aggressive my checks should be. If you think we should be checking indeed all versions, I can add that.",
            "date": "2011-10-07T14:08:30.252+0000",
            "id": 2
        },
        {
            "author": "Julian Reschke",
            "body": "patch updated to check all versions (but not the consistency of relations between them)",
            "date": "2011-10-07T17:01:03.149+0000",
            "id": 3
        },
        {
            "author": "Julian Reschke",
            "body": "minimally modified patch applied to trunk (r1180922)",
            "date": "2011-10-10T12:40:31.579+0000",
            "id": 4
        },
        {
            "author": "Julian Reschke",
            "body": "r1181024 in 2.2, r1180922 in trunk",
            "date": "2011-10-10T15:39:19.948+0000",
            "id": 5
        }
    ],
    "component": "jackrabbit-core",
    "description": "JCR-2551 introduced a recovery mode which tries to instantiate the version history, and if this fails, disconnects the VH (version history) and makes the node unversioned.\n\nHowever, it appears it can happen that the persistence is damaged such as getting the VH does indeed work, but subsequent operations fail due to other problems. One problem that has been seen is a missing frozenNode property of the root version (or a missing frozenNode itself).\n\nAs a quick fix, we may want to change the checker so that it actually also tries to get the rootVersion and it's frozenNode. Long term, depending on how frequent this problem is, we may have to think about a less drastic recovery than disconnecting the VH.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-3101",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "recovery tool does not recover when version history can be instantiated, but root version can not",
    "systemSpecification": true,
    "version": ""
}