{
    "comments": [
        {
            "author": "angela",
            "body": "proposed solution for the listed questions/comments.",
            "date": "2007-10-03T16:45:06.059+0000",
            "id": 0
        },
        {
            "author": "Julian Reschke",
            "body": "Thanks for the proposal.\n\nTypo:\n\n\"* @return returns the <code>LockInfo</code> associated with the new lock...\"\n\ns/returns//\n\nIn general, I'd prefer a design where (on the SPI level) we do not throw an exception for things that aren't exceptions in the program flow. In this case, I'd vote for letting getLockInfo return null if the node is not locked.\n",
            "date": "2007-10-04T07:41:13.260+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "up to know we avoided 'null' return values in the RepositoryService interface (also in analogy to the JCR interfaces). on the other hand you are right, that asking for the LockInfo on a node should basically not throw an exception if no lock is present.\n\n ",
            "date": "2007-10-04T10:18:31.931+0000",
            "id": 2
        },
        {
            "author": "Julian Reschke",
            "body": "In particular, as - in contrast to JCR - we do not have isLocked() etc.\n\nSo do we want to make this a general rule for SPI? I guess it would affect more stuff in the repository service...\n",
            "date": "2007-10-04T10:28:46.495+0000",
            "id": 3
        },
        {
            "author": "angela",
            "body": "> I guess it would affect more stuff in the repository service... \n\ni quickly stepped through the interfaces i couldn't find an additional case where it felt natural to me.\nand the various Info interfaces already allow for null return values in those cases.\n\ndo you know of something else?\n\nangela\n\nbtw: i think get-whatever-Factory methods on the RepositoryService should throw if they cannot return the required factory, since that would really reveal a fundamental problem... but they can't at the moment.",
            "date": "2007-10-04T10:55:48.805+0000",
            "id": 4
        },
        {
            "author": "angela",
            "body": "applied patch with modifications suggested by julian (getLockInfo returns null if no lock applies).",
            "date": "2007-10-08T13:14:21.411+0000",
            "id": 5
        }
    ],
    "component": "jackrabbit-spi",
    "description": "in detail:\n\n1) getLockInfo\n\n- intended behavior if no lock is present?\n- intended behavior if locking is not supported?\n\n2) lock\n\n- currently InvalidItemStateException is listed. i don't think this make too much sense.\n\n3) refreshLock\n\n- intended behavior if locking is not supported?\n\n4) unlock\n\n- currently InvalidItemStateException is listed. i don't think this make too much sense.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1159",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "SPI: improve description of locking methods on RepositoryService",
    "systemSpecification": true,
    "version": ""
}