{
    "comments": [
        {
            "author": "chad davis",
            "body": "My fixes were done on 2.2.5.  In the next couple of days I'll port my work to the trunk and attach the patches to this ticket. ",
            "date": "2011-07-19T22:36:16.253+0000",
            "id": 0
        },
        {
            "author": "chad davis",
            "body": "These patches are against the trunk, but they apply equally well against 2.2.5.  ",
            "date": "2011-07-21T21:24:02.979+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "hi chad\nthanks a lot for the patches. i will take a look and apply them as soon as possible.",
            "date": "2011-07-22T07:15:35.006+0000",
            "id": 2
        },
        {
            "author": "angela",
            "body": "applied slightly modified patch.\n\nrunning the tests i noticed however the following warning:\n\n10:30:57.694 WARN  [14745440@qtp-1360221-0] SessionState.java:236 Attempt to close session-admin-45364 while another thread is concurrently accessing this session. Blocking until the other thread is finished using this session. Please review your code to avoid concurrent use of a session.\n\ni will open a new issue for that.",
            "date": "2011-07-27T09:32:10.677+0000",
            "id": 3
        }
    ],
    "component": "jackrabbit-jcr-server, jackrabbit-webapp",
    "description": "After doing the davex remoting performance work outlined in JCR-3026, the increased concurrency on my jcr server exposed a lot of errors related to getting and putting from the JcrWebdavServer.SessionCache's internal HashMap's.  This problem with HashMap's is a well known concurrency error and was easily fixed by upgrading these maps to ConcurrentHashMaps.  Performance seems dramatically better.  \n\nThe fix includes exposure of a tuning parameter that allows the user to set the expected concurrency level.  This is the number of concurrent requests you expect the server to be handling.  In the typical davex remoting scenario, this means you should tune this server side value to match the total max connections of all clients pointed at the server.  See JCR-3026. \n\nUSAGE:  Set the 'concurrency-level' init param for the JcrRemotingServlet, via the web.xml of the jackabbit-webapp component.  Default value is 50.  Or you can intervene in a lower level api if appropriate.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-3027",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "JCR Server has concurrency issues on JcrWebdavServer.SessionCache internal HashMap caches",
    "systemSpecification": true,
    "version": "2.2.5"
}