{
    "comments": [
        {
            "author": "Bart van der Schans",
            "body": "We have some code for this for the 1.5 branch. It should be portable to the trunk and 2.2 branch. Do you already have a patch yourself or should I try to make it work for the the trunk?",
            "date": "2011-02-03T13:13:40.614+0000",
            "id": 0
        },
        {
            "author": "Claus Köll",
            "body": "Feel free to attach the code, thanks",
            "date": "2011-02-03T13:17:21.363+0000",
            "id": 1
        },
        {
            "author": "Stefan Guggisberg",
            "body": "> It could happen that a child node is not in the ChildNodeEntries of its parent node. \n\ndo you still experience such problems with 2.2? if yes, are they reproducible?\n\ni was under the impression that we had fixed all issues which could potentially \nlead to repository corruption.",
            "date": "2011-02-03T13:28:40.341+0000",
            "id": 2
        },
        {
            "author": "Claus Köll",
            "body": "i don't know if it still could happen under 2.2. \nwe are migrating from a 1.6.4 repository and we have inconsistencies in the workspace and i would like to fix that with\na consistency check",
            "date": "2011-02-03T13:33:52.946+0000",
            "id": 3
        },
        {
            "author": "Claus Köll",
            "body": "Is there a way to determine the name of the node. The child node must add itself to its parent node but normally only the parent knows the name of the child node ?",
            "date": "2011-02-09T09:16:08.535+0000",
            "id": 4
        },
        {
            "author": "Stefan Guggisberg",
            "body": "> Is there a way to determine the name of the node. The child node must add itself to its parent node but normally only the parent knows the name of the child node ?\n\n*only* the parent knows the names of its child nodes. that's a core aspect of jackrabbit's data model.\nyou would have to make up a new (unique) name. the child node should IMO be easily identifiable as a \nresurrected orphaned child node.",
            "date": "2011-02-09T09:26:24.303+0000",
            "id": 5
        },
        {
            "author": "Bart van der Schans",
            "body": "We found two distinct cases:\n- a parent referencing a child node that no longer exists\n- a node of which the parent is missing (these can show up in searches)\n\nIn the first case we just remove the reference to the child node. In the second case we delete the node and all of it's children. This could potentially be a bit dangerous, but in our case we found that these nodes are usually leftovers from delete actions. Another option could be, but that requires a bit more work, follow the unix analogy of a lost+found folder. So instead of removing them just make them children of a  \"special\" node.\n\nI have to admit that we have mostly been using 1.5 and with recent 1.5 versions we see almost no data corruption anymore. There have also been some bugs in our custom extensions with virtual layers which caused some of these problems in the past.\n\nWe always had great difficulty reproducing the data corruptions. Sometimes we found a way to reproduce one, but others times not at all. \n\n \n\n",
            "date": "2011-02-09T11:29:46.336+0000",
            "id": 6
        },
        {
            "author": "Claus Köll",
            "body": "orphaned child node will be added again to its parent with a new unique name",
            "date": "2011-02-11T07:30:57.917+0000",
            "id": 7
        },
        {
            "author": "Claus Köll",
            "body": "resolved in rev. 1073280",
            "date": "2011-02-22T10:14:42.253+0000",
            "id": 8
        }
    ],
    "component": "jackrabbit-core",
    "description": "It could happen that a child node is not in the ChildNodeEntries of its parent node.\nYou will get something like (javax.jcr.ItemNotFoundException: failed to build path of node1: parentNode has no child entry for node1) if you try to retrieve the path from node1.\nWe should handle such cases and fix it on consistency check",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-2877",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Extend the consistency check in BundleDbPersistenceManager's to fix child-parent relations",
    "systemSpecification": true,
    "version": "2.2.2"
}