{
    "comments": [
        {
            "author": "Thomas Mueller",
            "body": "Instead of committing this patch is backport JCR-1825 (DBDataStore doesn't support concurrent reads). Another difference to the 1.4.x branch is JCR-1864 (Database Data Store: clean up the code).\n\nHow important is 1.4.6 for you (why don't you upgrade to 1.5)?",
            "date": "2009-01-07T16:10:55.745+0000",
            "id": 0
        },
        {
            "author": "Bart van der Schans",
            "body": "The code in 1.5 and trunk has clearly improved and looks much better. The idea of this patch instead of backporting the other patches is that it fixes the specific problem without doing any refactoring, minimizing the risk of introducing new behavior or bugs. We will be upgrading to 1.5 within the next month, but I could still be useful to people who are stuck to 1.4 when a new maintenance release is done of the core.\n\nFor some background: I ran into this bug when importing some 15GB of data for a customer. Without the patch I ran into OOMs using 1GB of memory within 40 minutes. With the patch the import script was running fine for almost 2 days straight getting all the data in. The setup  was running on linux 64bit with java 6 64bit in Tomcat 6 with mysql configured as a datasource.",
            "date": "2009-01-07T22:40:21.890+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Scheduling for jackrabbit-core 1.4.8.",
            "date": "2009-01-14T17:08:37.901+0000",
            "id": 2
        },
        {
            "author": "Thomas Mueller",
            "body": "The patch doesn't close the first result sets in the method DbDataStore.addRecord.\nI will create a new patch and test it.",
            "date": "2009-01-21T10:30:39.437+0000",
            "id": 3
        },
        {
            "author": "Thomas Mueller",
            "body": "I'm sorry - it does close the result set. I will test the patch and commit it.",
            "date": "2009-01-21T10:32:49.419+0000",
            "id": 4
        },
        {
            "author": "Thomas Mueller",
            "body": "The patch is incorrect if copyWhenReading is disabled. I will fix it.",
            "date": "2009-01-21T10:52:51.027+0000",
            "id": 5
        },
        {
            "author": "Thomas Mueller",
            "body": "Committed in r736286 (1.4 branch)",
            "date": "2009-01-21T11:31:30.684+0000",
            "id": 6
        },
        {
            "author": "Bart van der Schans",
            "body": "Thx Thomas!",
            "date": "2009-01-21T12:36:05.832+0000",
            "id": 7
        }
    ],
    "component": "jackrabbit-core",
    "description": "The DbDataStore does not always close the ResultSet which can lead to memory leaks and/or large memory usage. It seems that  this already has been fixed in trunk and 1.5.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1918",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "DbDataStore keeps ResultSets open",
    "systemSpecification": true,
    "version": "core 1.4.6, core 1.4.7"
}