{
    "comments": [
        {
            "author": "Esteban Franqueiro",
            "body": "I'm working on this refactoring and I ended up with an empty Oracle10R2FileSystem. From a code point of view this class should be removed, but from a user's perspective, I think its more clear to have a class with a more accurate name.\nThe other possibility is to rename the already mentioned OracleBaseFaileSystem as Oracle10R2FileSystem, and make OracleFileSystem inheriit from it. I don't like this either.\nWDYYT?\nRegards,\n",
            "date": "2008-04-17T20:31:31.724+0000",
            "id": 0
        },
        {
            "author": "Esteban Franqueiro",
            "body": "Is it worth doing this work for the Oracle DB Persistence Managers (not the bundle PMs) too?\nThe bundle PMs for Oracle already support 10.2+, but there's a name mismatch because there's an Oracle9PM, and OraclePM is for 10+.",
            "date": "2008-04-18T15:55:45.575+0000",
            "id": 1
        },
        {
            "author": "Thomas Mueller",
            "body": "Hi,\nI don't know how much it is used. I would deprecate those persistence managers soon, as they are much slower then the bundle persistence managers. So in my view it doesn't make sense to work on non-bundle persistence managers any more.\nRegards,\nThomas",
            "date": "2008-04-18T16:32:19.879+0000",
            "id": 2
        },
        {
            "author": "Esteban Franqueiro",
            "body": "This patch applies the suggested fix. We should decide what to do regarding what I mentioned in my previous comments.\nAs suggested by Thomas, this doesn't include changes for the older PMs.\nI tested it on Oracle 10.2.0.3.0 and all tests passed.",
            "date": "2008-04-18T18:16:39.030+0000",
            "id": 3
        },
        {
            "author": "Esteban Franqueiro",
            "body": "Hi all.\nWhat should we do regarding this issue? I've been running this code for some time now and haven't had any issues. Should we apply it to trunk? Or should we wait?\nRegards,",
            "date": "2008-08-12T13:49:52.164+0000",
            "id": 4
        },
        {
            "author": "Martijn Hendriks",
            "body": "We've been running your patch also and encountered no problems. It looks fine. +1 for committing the patch.\n\nCan we solve the naming inconsistency now that the trunk is on 2.0-SNAPSHOT?\n\n",
            "date": "2009-05-13T06:42:08.196+0000",
            "id": 5
        },
        {
            "author": "Thomas Mueller",
            "body": "+1 for the patch except:\n\nThe class names should match the names used in the bundle PMs. Currently the patch uses:\nOracle10R2FileSystem (for Oracle 10 and newer)\nOracleFileSystem (for Oracle 9)\n\nThe class names should be:\nOracleFileSystem (for Oracle 10 and newer)\nOracle9FileSystem (for Oracle 9)\n",
            "date": "2009-05-18T07:22:00.498+0000",
            "id": 6
        },
        {
            "author": "Jared Roberts",
            "body": "I took the liberty of updating the patch with a couple of modifications. The first is to rename the classes to align with the conventions that Thomas mentioned. Instead of Oracle9FileSystem, I chose Oracle10R1FileSystem, though. It seemed to make more sense, because that's technically the last version it supports. The second change I made was to remove the user/password initialization in the OracleBaseFileSystem constructor. Initializing them to empty strings causes problems when a JNDI data source is being used. They should be left null unless explicitly configured.",
            "date": "2009-07-10T21:48:54.040+0000",
            "id": 7
        },
        {
            "author": "Martijn Hendriks",
            "body": "Attached a new version of the proposed patch because the previous ones do not match anymore after the JCR-1456 merge.",
            "date": "2009-12-06T14:37:37.093+0000",
            "id": 8
        },
        {
            "author": "Martijn Hendriks",
            "body": "Fixed in revision: 887881.\n\nPlease note that this change is not backwards compatible: the OracleFileSystem class now does not use special blob handling required for 10R1 and earlier. If you need that, use the Oracle9FileSystem. We migh want to add this in the RELEASE-NOTES.txt.\n",
            "date": "2009-12-07T10:59:34.894+0000",
            "id": 9
        },
        {
            "author": "Sébastien Launay",
            "body": "> Please note that this change is not backwards compatible: the OracleFileSystem class now does not use special blob handling required for 10R1 and earlier. If you need that, use the Oracle9FileSystem. We migh want to add this in the RELEASE-NOTES.txt.\n\nDone in revision 888290.",
            "date": "2009-12-08T08:50:23.717+0000",
            "id": 10
        }
    ],
    "component": "jackrabbit-core",
    "description": "In Oracle versions previous to 10.2, Jackrabbit explicitly uses a class from the Oracle driver to provide BLOB support (see OracleFileSystem.init()). This special handling is no longer necesary for Oracle 10.2+, so we should provide a new implementation. As discussed on the list, we can create a new class for Oracle 10.2+, make it inherit from DbFileSystem, and override the createSchema(), and table space related methods, which are the ones that need special handling. Furthermore, we could refactor the current OracleFileSystem and break it into two clases, one of them to keep the current behavior and a new one to keep the common code (which we could rename to OracleBaseFileSystem or similar, to maintain compatiblity with code that uses OracleFileSystem for versions previous to 10.2). Then we make the Oracle10FileSystem inherit from the latter.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1525",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Jackrabbit depends on Oracle driver for BLOB support in Oracle versions previous than 10.2",
    "systemSpecification": true,
    "version": "2.0-beta5"
}