{
    "comments": [
        {
            "author": "angela",
            "body": "hi julian\n\nif i remember correctly, the reason for this is that JSR170 does not allow to perform a 'shallow' copy.\nthe conflict would be detected by the javax.jcr.Workspace#copy therefore no additional check for existing parent is performed.\n\nIf you think this is worth an extra check, i would add it to the AbstractWebdavServlet, where some basic validation of the destination is done.\n\nregards\nangela",
            "date": "2006-04-10T18:19:51.000+0000",
            "id": 0
        },
        {
            "author": "Julian Reschke",
            "body": "Angela,\n\nconfirmed: modifying the Litmus test case to use Depth: Infinity shows that in this case the correct response code is returned. Will investigate further.\n\nBest regards, \n\nJulian ",
            "date": "2006-04-10T19:43:29.000+0000",
            "id": 1
        },
        {
            "author": "Julian Reschke",
            "body": "OK, as Angela pointed out, this is because Litmus is trying a shallow copy, which currently isn't implemented. Returning 403 in this case is correct.\n\nHowever, there seems to be a very simple workaround which does not only make Litmus happy, but may also help in some real-world cases: only reject the request here if the source resource indeed is a collection (otherwise WebDAV semantics for Depth: 0 and Depth: Infinity are identical).\n\n(attached)",
            "date": "2006-04-13T00:42:22.000+0000",
            "id": 2
        },
        {
            "author": "angela",
            "body": "applied patch as is (rev. 393731)\n\nthanks for your effort\n",
            "date": "2006-04-13T14:31:17.000+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Merged for 1.0.1 in revision 409539.",
            "date": "2006-05-26T09:14:37.000+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-webdav",
    "description": "This is Litmus test case copy_nodestcoll. An attempt is made to COPY an existing resource to a new location, where the parent collection of the resource-to-be-created does not exist. RFC2518 asks for status code 409 (Conflict) instead of 403 (Forbidden) in this case.\n",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-391",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "WebDAV method invocation trying to create a new resource should fail with 409 (Conflict) if parent resource does not exist",
    "systemSpecification": true,
    "version": "1.0"
}