{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Proposed patch.",
            "date": "2009-09-29T12:09:09.941+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Minor update to the patch: Fix the javadocs about the default content node type (nt:unstructured instead of nt:resource). Thanks, Angela!",
            "date": "2009-09-29T12:36:33.585+0000",
            "id": 1
        },
        {
            "author": "Felix Meschberger",
            "body": "I'm not sure, whether replacing the MimeResolver interface with directly using Tika is a good idea. In fact in the Apache Sling WebDAV bundle, I made use of the ability to inject a custom MimeResolver to be able to use Sling's mime type resolver.\n\nSo, I would actually favor a solution which would provide a Tika-based Mime Resolver.",
            "date": "2009-10-01T08:30:17.528+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "Committed the patch in revision 830670.\n\nFelix:\n> in the Apache Sling WebDAV bundle, I made use of the ability to inject a custom MimeResolver to be able to use Sling's mime type resolver. \n\nYou can still provide custom type detection functionality by injecting an implementation of the org.apache.tika.detect.Detector interface.\n\n> I would actually favor a solution which would provide a Tika-based Mime Resolver. \n\nThe Detector interface is more expressive than the MimeResolver class we've used so far, so a Tika-based MimeResolver would not be as powerful a solution. For example the MimeResolver class did not support things like content sniffing or Content-Type hints.",
            "date": "2009-10-28T16:58:47.475+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Resolving as Fixed based on the changes in revision 830670. ",
            "date": "2010-01-13T14:10:06.774+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-jcr-server",
    "description": "As discussed on dev@, I'd like to make the jackrabbit-jcr-server component use Apache Tika for automatic media type detection.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-2334",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Tika-based type detection in jcr-server",
    "systemSpecification": true,
    "version": ""
}