{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "There is indeed a bug in the query builder that creates the lucene query tree from the JCR query statement.\n\nFixed in svn revision: 380766.\n\nThank you for reporting this issue.\n\nCould you please check if this fix works for you and give a quick feedback? I did only check it with existing predefined node types, but it should also works for any custom defined node types.",
            "date": "2006-02-25T03:26:44.000+0000",
            "id": 0
        },
        {
            "author": "Michael Daglian",
            "body": "Hi Marcel,\n\nThe fix does indeed work for custom types where the mixin is explicitly in the hierarchy. However, I've run into an issue now where type queries do not seem to locate mixins with other mixins as supertypes when querying for the supertype mixin. More concretely, using the type definitions attached, if I add nt:TestMixin to a node then the node responds true to isNodeType for nt:TestMixin and mix:versionable. Querying directly for nt:TestMixin using the element function also works. However, querying for mix:versionable does not seem to work.",
            "date": "2006-02-25T03:54:28.000+0000",
            "id": 1
        },
        {
            "author": "Marcel Reutegger",
            "body": "You are right. I'll look into it asap.",
            "date": "2006-02-25T06:24:18.000+0000",
            "id": 2
        },
        {
            "author": "Marcel Reutegger",
            "body": "Ok, second attempt ;)\n\nThe query builder now also searches for mixins that are derived from the node type in element test.\n\nI've also added a test cases that searches referenceable nodes (o.a.j.core.MixinTest). The test adds nodes that are made referenceable in three ways:\n- implicitly referenceable (node type definition has mix:referenceable as supertype)\n- explicitly referenceable (mix:referenceable is set on node instance)\n- explicitly referenceable using mixin derived from mix:referenceable\n\nsvn revision: 381292",
            "date": "2006-02-27T18:04:06.000+0000",
            "id": 3
        }
    ],
    "component": "nodetype, query",
    "description": "When creating custom nodetypes that contain mixins as the supertype, nodes of the custom type do not appear to be queryable when using statements of the form: //element(*, mixin). Attached are a relatively simple JUnit test and compact type definition that seem to illustrate the problem.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-327",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Mixins as supertypes do not appear to be queryable",
    "systemSpecification": false,
    "version": "0.9"
}