{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Fixed in revision 157916.\n\nThanks for reporting the issue!\n\nThe configuration parser attempts to throw a ConfigurationException whenever the configuration file does not match the DTD requirements. In this case however the missing searchConfig element is perfectly OK, and should be handled accordingly.\n\nAs reported, the problem was in the WorkspaceConfig.init() method that did not expect the SearchConfig to be null even when the ConfigurationParser.parseSearchConfig() method explicitly returns null for a missing search configuration.",
            "date": "2005-03-17T17:54:07.000+0000",
            "id": 0
        }
    ],
    "component": "config",
    "description": "When the search configuration is missing from the repository.xml configuration, the WorkspaceConfig.sc field is null and consequently the WorkspaceConfig.init() method throws a NullPointerException.\n\nThis is by itself a bug, especially since missing search configuration is perfectly ok resulting in Jackrabbit not building the search index (which is - believe it or - what really want).\n\nOn that matter, since the configuration file structure seems to be implied by the configuration framework but the DTD is inlined into the configuration file, the configuration framework should act very gracefully to missing or wrong or unexpected configuration elements. Thus, for example, if the file system configuration (WorkspaceConfig.fsc) would be missing, the WorkspaceConfig should probably hint at this point and not throw a NullPointerException without further explanations (of course throwing anything at all is still better than going wild).",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-71",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "WorkspaceConfig.init() throws NullPointerException if Search configuration is missing",
    "systemSpecification": true,
    "version": ""
}