{
    "comments": [
        {
            "author": "Michael Dürig",
            "body": "Patch implementing above proposal. Also adds a test suite to    jackrabbit-jcr-benchmark to validate the claims. ",
            "date": "2009-03-31T14:46:11.212+0000",
            "id": 0
        },
        {
            "author": "Michael Dürig",
            "body": "Above patch factors item invalidation into a InvalidationStrategy. There are two separate implementations: EagerInvalidation and LazyInvalidation. EagerInvalidation behaves like refreshing used to behave. LazyInvalidation implements above proposal. ",
            "date": "2009-03-31T14:49:31.038+0000",
            "id": 1
        },
        {
            "author": "Michael Dürig",
            "body": "Log file excerpt from benchmark. \n\nMost effect is visible for large trees. While fetching nodes is of the same order of magnitude for both strategies, refreshing is remarkably faster for LazyInvalidation.",
            "date": "2009-03-31T14:58:23.068+0000",
            "id": 2
        },
        {
            "author": "Michael Dürig",
            "body": "Updated patch.\nThis patch incorporates suggestions from Angela (thanks!)",
            "date": "2009-04-01T13:16:20.014+0000",
            "id": 3
        },
        {
            "author": "Michael Dürig",
            "body": "Fixed at revision 771280\nApplied patch with benchmark tests removed. See https://issues.apache.org/jira/browse/JCRBENCH-2",
            "date": "2009-05-04T12:07:47.473+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-jcr-benchmark, jackrabbit-jcr2spi",
    "description": "With the current implementation (recursive) refresh operations cause a full traversal of the sub-tree rooted at the item causing the refresh. This is potentially expensive. \n\nInstead of invalidating each item in the respective sub-tree I propose to mark the root of the sub-tree as invalidated. Such a mark would include a time stamp. Also individual items would be time stamped with their resolution time. When an item is accessed, it would check if its resolution time stamp is older than the latest invalidation time stamp. If so, it checks whether the invalidation applies to it at all (by traversing up the path) and if so it would re-resolve itself. In any case its resolution time stamp will be updated.\n\nThis approach would make invalidation much cheaper without putting much additional load to simple item access. Moreover most of the additional load (traversing up the path) only applies when an invalidation is pending.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-2050",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Optimize refresh operations ",
    "systemSpecification": true,
    "version": ""
}