{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Fixed in revision 613834. Thanks!",
            "date": "2008-01-21T10:40:33.113+0000",
            "id": 0
        },
        {
            "author": "Carsten Ziegeler",
            "body": "What about the version in the spi-commons? Shouldn't it be deprecated? ",
            "date": "2008-01-21T10:48:48.054+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Probably, but we shouldn't deprecate things in a patch release, so it'll have to wait until 1.5.\n\nAnyway, I've added the @deprecate marker to spi-commons in revision 613841. I'll figure out how to best handle these changes in terms of release tracking.",
            "date": "2008-01-21T11:09:50.866+0000",
            "id": 2
        },
        {
            "author": "Carsten Ziegeler",
            "body": "Thanks!",
            "date": "2008-01-21T13:06:50.680+0000",
            "id": 3
        },
        {
            "author": "angela",
            "body": "sorry. i don't agree on this change.\n\nand: jukka, i would expect that you wait at least for one day before you\nmake such modifications.\n\nmy suggestion to move the Locked class was by intention, i expect that at least\ngive me the change to tell you so.\n\ncan you please revert your modification made with r613841 unless we reached\nconsensus on this issue? thanks\n\nangela",
            "date": "2008-01-22T09:05:08.999+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "> sorry. i don't agree on this change.\n\nAh, I'm sorry for jumping the fox here. I've reverted my changes in revision 614158.\n\nFor the record, the reverted changes are included in the attached patch.\n\n> and: jukka, i would expect that you wait at least for one day before you\n> make such modifications.\n\nMy apologies. I thought this was a clear-cut issue so I didn't wait for review. Obviously I was wrong.\n\nWas there some other reason than the Name dependencies for moving the Locked class?\n",
            "date": "2008-01-22T10:00:56.049+0000",
            "id": 5
        },
        {
            "author": "angela",
            "body": "> was there some other reason than the Name dependencies for moving the Locked class? \n\nName, NamespaceResolver and NamePathResolver.\napart from that, there was no reason... and i don't have any strong feeling for the Locked class\nin particular nor about it's position in the code.\n\nbut i expect that we have a minimal response time to give everybody the time to look at a patch. apart from that i expect that patches and suggestions are really looked at, before they are commited. this applies both for this one and the one in JCR-1169 which was open for almost a month (and already suggested in the devlist before). that's all.",
            "date": "2008-01-22T10:53:39.684+0000",
            "id": 6
        },
        {
            "author": "Jukka Zitting",
            "body": "> Name, NamespaceResolver and NamePathResolver.\n\nMy patch replaces all those dependencies with code like the following:\n\n    session.getNamespacePrefix(\"http://www.jcp.org/jcr/mix/1.0\") + \":lockable\"\n\nAfter that change the Lockable class only depends on the JCR API and should be just fine in jcr-commons. Most notably it meets the criteria defined in [1]:\n\n    \"The jackrabbit-jcr-commons package should contain generic utility\n    classes that work *on top of* the JCR API. The classes should handle\n    names and paths in string format, and use the namespace methods on\n    javax.jcr.Session where name manipulation is needed.\"\n\n> apart from that, there was no reason... and i don't have any strong feeling for\n> the Locked class in particular nor about it's position in the code. \n\nOK, thanks. Unless anyone has further objections I'll re-commit the patch in a few days time.\n\n[1] http://www.mail-archive.com/dev@jackrabbit.apache.org/msg06698.html",
            "date": "2008-01-22T11:45:52.593+0000",
            "id": 7
        },
        {
            "author": "angela",
            "body": "> Unless anyone has further objections I'll re-commit the patch in a few days time. \n\nfine with me.\n",
            "date": "2008-01-22T13:09:21.391+0000",
            "id": 8
        },
        {
            "author": "angela",
            "body": "adjusting affected projects.",
            "date": "2008-01-22T13:11:24.544+0000",
            "id": 9
        },
        {
            "author": "Jukka Zitting",
            "body": "Re-purposing this as a purely jcr-commons issue to avoid cross-component complexity. We should add a separate issue\nto deprecate the class in spi-commons 1.5.",
            "date": "2008-03-17T22:18:02.721+0000",
            "id": 10
        },
        {
            "author": "Jukka Zitting",
            "body": "Fixed in jackrabbit-jcr-commons in revision 638099. Merged to the 1.4 branch in revision 638100.",
            "date": "2008-03-17T22:27:10.324+0000",
            "id": 11
        },
        {
            "author": "Felix Meschberger",
            "body": "Closing issue, has been release in jackrabbit-jcr-commons 1.4.2",
            "date": "2008-04-02T19:06:41.733+0000",
            "id": 12
        }
    ],
    "component": "jackrabbit-jcr-commons",
    "description": "The Locked class in the jcr-commons package has been deprecated with 1.4 and moved to the spi-commons.\nHowever as this is a common class which does not depend on the spi, it should rather stay in jcr-commons.\nThe dependencies to spi can simply be removed again.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1331",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Improper deprecation of Locked class",
    "systemSpecification": true,
    "version": "1.4"
}