{
    "comments": [
        {
            "author": "Felix Meschberger",
            "body": "Replaced the use of Xerces by JAXP, which causes the following changes:\n\n   * ImportContentHandler constructor throws a RepositoryException if JAXP is not able to\n             provide a transform DocumentHandler. Likewise the extended constructors forward\n             this exception. This is ok, since the calling methods within the library are declared to\n             throw a RepositoryException.\n\n   * Add a very simple testcase to ensure JAXP is used correctly to setup the DocumentHandler.\n\nImplemented in Rev. 614859.",
            "date": "2008-01-24T12:44:22.456+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "We probably need to do something similar to what's being discussed in JCR-1310 to avoid losing namespace declarations in the serialized XML document.",
            "date": "2008-01-24T12:57:51.076+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Resolved the namespace declaration issue in revision 616082 by leveraging the new SerializingContentHandler class from JCR-1350.",
            "date": "2008-01-28T22:14:48.396+0000",
            "id": 2
        },
        {
            "author": "Felix Meschberger",
            "body": "Schedule for rmi 1.4.1 release as this is a requirement for easy deployment in an OSGi framework such as Sling",
            "date": "2008-03-13T15:32:37.883+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "This should IMHO go to a jackrabbit-jcr-rmi 1.5 release. I'd rather not introduce dependency changes in a patch release...",
            "date": "2008-03-13T16:58:00.129+0000",
            "id": 4
        },
        {
            "author": "Felix Meschberger",
            "body": "In the sense of the considerations in [1] I think, we may well include this dependency in this release:\n\nTherefore, I include this in the 1.4.1 release.\n\n[1] http://markmail.org/message/zva7vih4c3k6br5y",
            "date": "2008-04-02T19:34:21.486+0000",
            "id": 5
        },
        {
            "author": "Felix Meschberger",
            "body": "Backported change of Rev. 616082 to 1.4 branch in Rev. 644020 for inclusion in the rmi 1.4.1 release.",
            "date": "2008-04-02T19:39:23.741+0000",
            "id": 6
        },
        {
            "author": "Jukka Zitting",
            "body": "The patch release should be drop-in compatible with any Jackrabbit 1.4 installation, so I'd very much prefer to avoid the explicit jcr-commons 1.4.2 dependency. If necessary, I'd even copy the relevant classes from jcr-commons in the 1.4 branch to avoid breaking drop-in compatibility.",
            "date": "2008-04-02T19:57:03.686+0000",
            "id": 7
        },
        {
            "author": "Felix Meschberger",
            "body": "As we do not yet officially do componentized releases I follow your proposal to copy the classes, only in the 1.4 branch though and makring them deprecated right from the start.",
            "date": "2008-04-02T20:50:08.548+0000",
            "id": 8
        },
        {
            "author": "Felix Meschberger",
            "body": "Released in jackrabbit-jcr-rmi 1.4.1 release. Closing issue.",
            "date": "2008-04-11T10:20:01.550+0000",
            "id": 9
        }
    ],
    "component": "jackrabbit-jcr-rmi",
    "description": "The org.apache.jackrabbit.rmi.xml.ImportContentHandler class currently uses Xerces to implement the SAX DocumentHandler and serialize XML into a byte[]. This dependency should be dropped and JAXP be used instead for this functionality.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1343",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Replace xerces for serialization by JAXP",
    "systemSpecification": true,
    "version": "1.4"
}