{
    "comments": [
        {
            "author": "fabrizio giustina",
            "body": "failing testcase",
            "date": "2008-07-27T12:10:29.678+0000",
            "id": 0
        },
        {
            "author": "fabrizio giustina",
            "body": "testcase + fix for parsing system properties in cluster \"id\" and \"syncDelay\" properties",
            "date": "2008-07-27T12:29:50.254+0000",
            "id": 1
        },
        {
            "author": "fabrizio giustina",
            "body": "(if the patch looks good it would be great to have it merged to the 1.4 branch for the upcoming 1.4.6 release, thanks)",
            "date": "2008-07-27T12:32:05.122+0000",
            "id": 2
        },
        {
            "author": "Alexander Klimetschek",
            "body": "For clustering, you can set the system property \"org.apache.jackrabbit.core.cluster.node_id\" instead of setting the id attribute in the Cluster config element. See http://wiki.apache.org/jackrabbit/Clustering.\n\nWe could have multiple ways of setting the id dynamically, but I would prefer to have only one way of doing this in this case. WDYT?",
            "date": "2008-08-11T16:24:00.455+0000",
            "id": 3
        },
        {
            "author": "fabrizio giustina",
            "body": "I wasn't aware of the org.apache.jackrabbit.core.cluster.node_id \"magic\" property, but since you can use system variables everywhere in the config file with a standard mechanism (except here, at the moment) IMHO it would be better to handle it consistently.\nSince it's more generic I think the way system properties are replaced using ${variables} is easier and more self-explanatory. This could also fully replace the \"org.apache.jackrabbit.core.cluster.node_id\" property, by just setting the default to ${org.apache.jackrabbit.core.cluster.node_id}. My vote to add the generic replacement of variables in the cluster config too.",
            "date": "2008-08-11T18:01:09.961+0000",
            "id": 4
        },
        {
            "author": "Dominique Pfister",
            "body": "Fixed in revision 695766.",
            "date": "2008-09-16T08:35:40.787+0000",
            "id": 5
        },
        {
            "author": "Jukka Zitting",
            "body": "I considered merging this to the 1.4 branch, but decided otherwise since this change affects the configuration settings. Better to leave this for 1.5.",
            "date": "2008-09-16T16:18:06.702+0000",
            "id": 6
        }
    ],
    "component": "config",
    "description": "Since JCR-1304 has been added to jackrabbit 1.4 I guess this should be reported as a bug...\n\nStill not debugged deeply, but if I try to configure a Cluster using:\n<Cluster id=\"${server}\" syncDelay=\"10\">\n\nafter setting a \"server\" system property I expect to have the cluster initialized properly using the value of such property... I just realized that my cluster node gets initialized with the final value of \"${server}\" instead :(\n\nCluster config is a very good place where to use system properties, since all the configuration is usually identical between cluster nodes while the \"id\" property must be different...\n\nIs there anything I missed/did wrong in my configuration?\n",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1694",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "System properties does not get replaced in a Cluster configuration",
    "systemSpecification": true,
    "version": "core 1.4.5"
}