{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Do we really need a meaningful progress bar for the garbage collection process? What's the use case?\n\nThis sounds like added complexity with little real benefit.",
            "date": "2008-03-13T11:32:02.121+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Why do you need to pass the full node to the ScanEventListener? Wouldn't passing a NodeId be enough, or even just calling a no-argument method to indicate that a node was scanned?\n\nAFAIUI you only need the ratio of nodes scanned vs. total number of nodes to display a good progress bar.",
            "date": "2008-03-13T13:54:04.164+0000",
            "id": 1
        },
        {
            "author": "Thomas Mueller",
            "body": "Fixed in revision 636774.\n\nThis patch introduces two new methods: GarbageCollector.setPersistenceManagerScan and getPersistenceManagerScan. Also, the ScanEventListener is called even when using the PersistenceManager scan, however with a null Node. My first idea was to add a PseudoNode class, but passing null is probably OK. In that case the client could count how many times the method was called. I remember there is a way to get the number of nodes in a repository (jcr.repository.stats.nodes.count).\n\nI agree the NodeId would be OK as well, however I think we should not change the API in a minor release.\n\nI hope this patch can be included in the next minor Jackrabbit release.\n\n",
            "date": "2008-03-13T14:49:47.662+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "OK, merged to the 1.4 branch in revision 638066.",
            "date": "2008-03-17T21:07:10.689+0000",
            "id": 3
        }
    ],
    "component": "jackrabbit-core",
    "description": "The ScanEventListener is currently only called when using the 'scan all nodes recursively' strategy. It is not called when all persistence managers implement IterablePersistenceManager (GarbageCollector.scanPersistenceManagers). The ScanEventListener should be called in every case, otherwise it is not possible to see the progress of the garbage collection.\n\nHowever there is a problem: IterablePersistenceManager.getAllNodeIds() doesn't return Node objects, and it would make little sense to create real node objects (the performance advantage of scanPersistenceManagers would be lost).\n\nTherefore, I propose a workaround: the ScanEventListener is called using a 'PseudoNode'. This is a class that implements Node but only has meaningful getUUID() and toString() methods. This allows to create a meaningful progress bar (as the UUIDs are returned in order).",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1469",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Data store garbage collection: ScanEventListener not working",
    "systemSpecification": true,
    "version": "core 1.4.1"
}