{
    "comments": [
        {
            "author": "Alex Deparvu",
            "body": "attaching proposed patch.\n\nBased on the indexing config we know if a field has its boost changed or not, so if a field has no boost setting we can safely disable norms.",
            "date": "2012-03-28T14:41:22.126+0000",
            "id": 0
        },
        {
            "author": "Alex Deparvu",
            "body": "I've had some issues with a test (IndexingRuleTest#testBoost), it failed a few times.\nThe sort seemed to not be stable, the field that had no initial boost (so no norms) kept moving from the first position to the last, messing with the test result.\nNow it seems ok.\n\nFixed in revision 1308833.",
            "date": "2012-04-03T12:09:48.515+0000",
            "id": 1
        },
        {
            "author": "Alex Deparvu",
            "body": "the patch was insufficient, I missed some norm creation code",
            "date": "2012-04-13T15:54:51.281+0000",
            "id": 2
        },
        {
            "author": "Alex Deparvu",
            "body": "tweaked LazyTextExtractorField so it doesn't add norms unless it's needed.\n\nfixed in revision 1308833 and 1325820.",
            "date": "2012-04-13T16:01:07.364+0000",
            "id": 3
        }
    ],
    "component": "indexing, jackrabbit-core",
    "description": "There is a very significant potential for optimizing the size of the search index.\n\nWe have seen a case where there were multiple segments with about the same number of nodes (roughly 10 million), but the size on disk was very different.\nOne segment was 19 GB while all others where around 3 GB. The major difference was the number of fields indexed. The large segment had significantly more fields, which resulted in a large norms file.\n\nWe should go through our implementation and see where norms are really necessary and disable tracking of norms wherever possible.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-3282",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Optimize usage of norms",
    "systemSpecification": true,
    "version": ""
}