{
    "comments": [
        {
            "author": "Thomas Mueller",
            "body": "Fixed as of revision 594470",
            "date": "2007-11-13T10:37:17.960+0000",
            "id": 0
        },
        {
            "author": "Esteban Franqueiro",
            "body": "Why not use UUID.randomUUID() directly?",
            "date": "2007-11-13T19:10:45.007+0000",
            "id": 1
        },
        {
            "author": "Felix Meschberger",
            "body": "> Why not use UUID.randomUUID() directly?\n\nThe problem is that Jackrabbit has its own UUID class implementation because Java only includes this starting with 1.5. Jackrabbit on the other hand is bound to be also running on Java 1.4. Therefore the JDK UUID class is not an option (currently).",
            "date": "2007-11-13T19:20:44.671+0000",
            "id": 2
        }
    ],
    "component": "jackrabbit-core",
    "description": "Currently, the UUID generation used the regular java.util.Random implementation to generate random UUIDs. The seed value of Random is initialized using System.currentTimeMillis(); for Windows, the resolution is about 15 milliseconds. That means two computer that start creating UUIDs with Jackrabbit within the same 15 millisecond interval will generate the same UUIDs. In a clustered environment the nodes could be started automatically at the same time (for example after a backup).\n\nAlso, the Random class uses a 48-bit seed, which is much less than the number of random bits in UUID (122). This is not secure. See also:\n\nhttp://en.wikipedia.org/wiki/UUID\nRandom UUID probability of duplicates\n\"The probability [of duplicates] also depends on the quality of the random number generator. A cryptographically secure pseudorandom number generator must be used to generate the values, otherwise the probability of duplicates may be significantly higher.\"\n\nTherefore, I suggest to change VersionFourGenerator to use the SecureRandom implementation in by default.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1206",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "UUID generation: SecureRandom should be used by default",
    "systemSpecification": true,
    "version": ""
}