{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "Patch provided in JCR-2031 looks good. Committed in revision 1305269",
            "date": "2012-03-26T08:52:01.639+0000",
            "id": 0
        },
        {
            "author": "Mete Atamel",
            "body": "Patch that adds counter and size support.",
            "date": "2012-03-26T13:09:21.296+0000",
            "id": 1
        },
        {
            "author": "Mete Atamel",
            "body": "The attached patch adds counter and size info to the debug log. Could someone with commit rights review and apply it please?",
            "date": "2012-03-28T13:12:02.085+0000",
            "id": 2
        },
        {
            "author": "Mete Atamel",
            "body": "The latest attached patch further improves the logs with additional info.",
            "date": "2012-04-02T14:11:29.077+0000",
            "id": 3
        },
        {
            "author": "Marcel Reutegger",
            "body": "Looks very good. I slightly changed where new data store items are logged. In your patch the BundleWriter logs a message when a node with a binary property is stored. This will also log when a node is updated, but the binary didn't change. I think this is confusing for a person looking at the log. Instead I moved the log statement to the class BLOBInDataStore. There the message will only be logged when a binary is actually added to the data store.\n\nComitted in revision: 1308743",
            "date": "2012-04-03T08:26:40.422+0000",
            "id": 4
        },
        {
            "author": "Marcel Reutegger",
            "body": "Re-opening because the log messages are only written on the cluster node where the changes are written. I think this is confusing because it will result in log information scattered across the cluster nodes.",
            "date": "2012-04-23T10:41:04.291+0000",
            "id": 5
        },
        {
            "author": "Marcel Reutegger",
            "body": "Patch provided by Mete Atamel to address the above mentioned limitation.",
            "date": "2012-04-23T11:53:29.422+0000",
            "id": 6
        },
        {
            "author": "Marcel Reutegger",
            "body": "Applied patch in revision 1329195",
            "date": "2012-04-23T11:55:52.211+0000",
            "id": 7
        },
        {
            "author": "Claus Köll",
            "body": "I would like to change the audit logs in ClusterNode also to debug like the other ones or is it needed as info for someone ?",
            "date": "2012-06-22T07:42:20.831+0000",
            "id": 8
        },
        {
            "author": "Claus Köll",
            "body": "changed to debug in revision 1352794.",
            "date": "2012-06-22T08:11:37.728+0000",
            "id": 9
        },
        {
            "author": "Mete Atamel",
            "body": "Hi Claus, we had set ClusterNode's audit log to info because it's the most useful one for audit purposes and not so chatty. We wanted to make sure it's logged by default, so we have useful audit info by default without people having to change to debug level. Other audit logs are at debug as they are more chatty and we didn't want the whole system to be overwhelmed with so many logs.",
            "date": "2012-06-25T06:02:06.003+0000",
            "id": 10
        },
        {
            "author": "Claus Köll",
            "body": "Ok i see .. but i think the logs are also chatty because it logs every  change on node level in the repo ;-) .. and we could add some speaking log and not only some values as used in other audit logs.\nI have changed it to debug but if you need it as info please feel free to change it back",
            "date": "2012-06-25T06:11:26.906+0000",
            "id": 11
        },
        {
            "author": "Mete Atamel",
            "body": "Yes, they are somewhat chatty but that's the nature of audit logging. I'm not sure if I follow your comment about speaking log. I think for audit logging to be useful, its basic form (i.e. ClusterNode part) needs to be logged at info level. Not many people want to enable debug logging which means no audit logging for majority of use cases and that defeats the purpose. So, I suggest we change ClusterNode audit logging back to info, so at least we have some audit log by default. I'd do it myself but I don't have commit rights :-)",
            "date": "2012-06-25T06:29:20.466+0000",
            "id": 12
        },
        {
            "author": "Claus Köll",
            "body": "You are right its the nature :-) and so i thought we should have all audit logs at same level. You are right audit log should be logged in basic form but i don't like to have different formats.\nAt the moment we have audit logs in ClusterNode, AbstractBundlePersistenceManager and BLOBInDataStore.\nTwo on debug level and one on info level. One looks like \"Stored {} to DataStore ({})\" and the other one in ClusterNode looks like \"[{}] {} {} ({})\" This is what i meant with speaking log ...\nWe should document what values are logged or not.\n\n",
            "date": "2012-06-25T07:09:58.868+0000",
            "id": 13
        },
        {
            "author": "Marcel Reutegger",
            "body": "I'm also in favour of changing it back to info.\n\nPlease also note that this issue has fix version 2.5, which has already been released. We should not make changes anymore with this issue, but rather create a new one. Otherwise it's not clear anymore what the behaviour is in a given release.",
            "date": "2012-06-25T08:32:55.256+0000",
            "id": 14
        },
        {
            "author": "Claus Köll",
            "body": "Ups sorry .. i will change it back and open a new one .. so that we may use in all audit logs a similar log style.",
            "date": "2012-06-25T08:36:33.197+0000",
            "id": 15
        },
        {
            "author": "Geoffroy Schneck",
            "body": "Additional comment / enhancement proposal :\n\nWhen saving several transaction at the same time, the Audit log could log all nodes impacted by the commits.\n\nFor example, (using CRXDE Lite) I created 2 nodes,  /tmp/test and /tmp/test/subtest .\nOn save , I see only one line : \n\n10.10.2012 12:04:37.795 *DEBUG* [10.136.133.138 [1349863477688] POST /crx/server/crx.default/jcr%3aroot HTTP/1.1] org.apache.jackrabbit.core.cluster.ClusterNode revision 1099516356096 admin@/tmp\n\n",
            "date": "2012-10-10T10:10:10.116+0000",
            "id": 16
        }
    ],
    "component": "jackrabbit-core",
    "description": "JCR-2031 added the user name and path in debug logs for audit purposes. There are some problems with the fix that I had outlined in the comments for JCR-2031 and provided a patch. Additionally, it would use useful to add an update counter and size information to the debug log as well. Something like this:\n\n17.03.2009 14:43:37 [1] 18216140 admin@/apps/acme/templates/contentpage/thumbnail.png (12343) \n17.03.2009 14:43:37 [2] 18216141 admin@/apps/acme/templates/contentpage/my.png (123) \n17.03.2009 14:43:37 [3] 18216142 admin@/apps/acme/templates/contentpage/blah.png (1423) \n17.03.2009 14:43:37 [4] 18216143 admin@/apps/acme/templates/contentpage/test.png (123423) \n17.03.2009 14:43:37 [5] 18216144 admin@/apps/acme/templates/contentpage/test2.png (123423) \n\n<date> <time> [<counter>] <txid> <userid>@<path> (<size>)\n\nWe should also think about whether we want this log as part of regular jackrabbit log or in a separate audit log. \n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-3275",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Audit log",
    "systemSpecification": true,
    "version": "2.4"
}