{
    "comments": [
        {
            "author": "Paco Avila",
            "body": "This PDF shows the modifications needed in the jackrabbit core to preserve node UUID and document version history date in repository migrations.",
            "date": "2009-02-09T09:20:14.034+0000",
            "id": 0
        },
        {
            "author": "Alexander Klimetschek",
            "body": "Could you provide the diff in a normal txt/patch format (svn diff > JCR-1972.patch)? A pdf is a rather unusual format for that ;-)",
            "date": "2009-02-09T11:20:17.004+0000",
            "id": 1
        },
        {
            "author": "Paco Avila",
            "body": "Patch solicited by Alexander Klimetschek. This patch works with jackrabbit-core-1.4.6 and i'm not sure if it works for more recent versions.",
            "date": "2009-02-09T13:08:37.351+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "If I read the patch correctly, it breaks the NodeImpl.checkin() method.\n\nAlso, please use only spaces (no tabs) for indentation.\n\nOther than that I think the changes are reasonable. We may even want to consider adding the extra method signatures to jackrabbit-api.",
            "date": "2009-07-08T14:33:33.177+0000",
            "id": 3
        },
        {
            "author": "Paco Avila",
            "body": "As I wrote some time ago, these modifications make two enhacements in the jackrabbit-core functionality:\n\n- Enable UUID parameter in addNode: this allow to preserve the unique node identifier across a repository migration. If you use references this change is fundamental.\n\n- Enable Calendar parameter in checkin: this change can be used to preserve checking date in document version history in a possible migration.\n\nThis migration can be of two types: \n\n- Change the repository backend: you use the default Derby database, but you want to swith to MySQL, for example. Actually this is not possible in a easy way.\n\n- Change the repository node definitions: jackrabbit actually can't deal with these changes depending on their complexity. You have to write a program to make this migration.\n\nFrom my point of view, this patch introduces very neccessary funtionality into Jackrabbit. If you want to include these modifications in a near release, I can try to send a new patch that works with an specific jackrabbit-core version.",
            "date": "2009-07-09T06:42:55.866+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "We should protect against the case of adding a node with an UUID that already exists in the workspace. See the XML import functionality for potential ways of dealing with such cases.",
            "date": "2009-07-11T08:57:06.764+0000",
            "id": 5
        },
        {
            "author": "Paco Avila",
            "body": "Updated patch for the 1.x branch",
            "date": "2009-07-13T14:56:38.844+0000",
            "id": 6
        },
        {
            "author": "Paco Avila",
            "body": "I've updated the patch and also added two JUnit test (CheckinCalendarTest and added a new method at NodeImplTest). \n\nIn addNode(..., UUID) I can test if the node has the MIX_REFERENCEABLE mixing but I'm not sure if this good because the mixin can be added after the node creation. This check is commented in the patch.\n\n",
            "date": "2009-07-13T15:02:06.625+0000",
            "id": 7
        },
        {
            "author": "Jukka Zitting",
            "body": "The patch is creating lots of duplicate code in the extra methods. Can we avoid that?\n\nAlso, it would be good to have a check to prevent someone to add a new node with an id that already exists in the workspace.",
            "date": "2009-07-14T12:40:19.392+0000",
            "id": 8
        },
        {
            "author": "Paco Avila",
            "body": "Updated patch -> Check for existing UUID.\n\nI have to duplicate some methods to add a new parameter with the UUID. ",
            "date": "2009-07-16T09:04:42.360+0000",
            "id": 9
        },
        {
            "author": "Jukka Zitting",
            "body": "Thanks for the update! Still more comments:\n\n* It would be better if the UUID argument was a String instead of an instance of the UUID class. Also, it might be useful to rename the relevant methods to addNodeWithUUUID to avoid signature clashes with the already overloaded addNode method.\n\n* It would be good to have javadocs for all the new methods.\n\n* Please use only spaces to indent the code.\n\n* About the duplicate methods: It's OK to have extra method signatures for different purposes, but now you're duplicating also the entire method bodies. For example the new NodeImpl.checkin(Calendar) method is some 40 lines of code that's essentially identical to the code in NodeImpl.checkin(). If we later on encounter a bug and fix it in the checkin() method, how do we make sure that the fix also gets applied to checkin(Calendar)?",
            "date": "2009-07-17T13:42:10.137+0000",
            "id": 10
        },
        {
            "author": "Paco Avila",
            "body": "Improvements by recommendation of Jukka",
            "date": "2009-07-20T10:55:30.542+0000",
            "id": 11
        },
        {
            "author": "Jukka Zitting",
            "body": "Thanks! I made some modifications to the patch (no tabs, less extra methods, even less code duplication; see attached patch for details) and committed it to the 1.x branch in revision 800385.\n\nI'll see what it takes to forward port this to the trunk.\n\n",
            "date": "2009-08-03T14:04:31.395+0000",
            "id": 12
        },
        {
            "author": "Jukka Zitting",
            "body": "One more thing... Your patch referenced a CheckinCalendarTest class, but the relevant java file wasn't included in the patch. Can you attach the file so we can include it in the test suite?",
            "date": "2009-08-03T14:31:10.713+0000",
            "id": 13
        },
        {
            "author": "Jukka Zitting",
            "body": "The new method signatures are now available also in trunk. Resolving as fixed for 1.6.0.",
            "date": "2009-08-03T18:11:15.102+0000",
            "id": 14
        },
        {
            "author": "Paco Avila",
            "body": "Sorry for the missing test class. I did no review of the generated patch and thought it was included. I'm on holiday but i will try to get a decent Internet connection to attach the missing class. ",
            "date": "2009-08-03T19:58:15.967+0000",
            "id": 15
        },
        {
            "author": "Paco Avila",
            "body": "The missing test class",
            "date": "2009-08-03T21:09:35.829+0000",
            "id": 16
        }
    ],
    "component": "jackrabbit-core",
    "description": "I have been working I an migration utility for OpenKM and I performed some changes in jackrabit-core to enable version import, preserving\nthe modification date. Also modified org.apache.jackrabbit.core.NodeImpl to preserve UUID in the migration process.\n\nThis migration process is needed because there are changes in repository node definition, and Jackrabbit can't deal with this actually.\n\nI've attache a PDF with the changes needed in Jackrabbit-core. It works and there was no problems with the migrated repository.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1972",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Preserving UUID and document version history on repository migration",
    "systemSpecification": true,
    "version": "core 1.4.8"
}