{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Implemented alternative JNDI binding and access servlets in revision 543821. See JCR-956 for related information.",
            "date": "2007-06-03T01:27:34.164+0000",
            "id": 0
        }
    ],
    "component": "jackrabbit-jcr-rmi",
    "description": "The current deployment options for RepositoryStartupServlet bind a local repository to JNDI and/or register a remote ServerRepository via RMI using an RMIServerSocketFactory and LocateRegistry. \n\nThe LocateRegistry mechanism does not appear to work by default in a Weblogic environment.\n\nI would like to request the option of binding a ServerRepository in registerRMI() to JNDI using the servlets current context instead of attempting LocateRegistry.createRegistry() and then LocateRegistry.getRegistry(). This JNDI binding option could use a different name so as to not interfere with the JNDI binding attempted in registerJNDI().\n\nFor example, if requested in the web.xml config, registerRMI() could bind the following using it's reference to a ServerRepository:\n\n      Context ctx = new InitialContext();\n      ctx.bind(repositoryName + \"Remote\", remote);\n\nThis allows for easy remote access using weblogic's native T3 protocol using the following on the client with:\n\n      Context ctx = new InitialContext(); // with say -Djava.naming.provider.url and -Djava.naming.factory.initial set \n      Object ref = ctx.lookup(repositoryName + \"Remote\");\n      LocalAdapterFactory laf = new ClientAdapterFactory();\n      Repository remote = laf.getRepository((RemoteRepository) ref);\n\nFrom the initial tests I have done this appears to work well inside the Weblogic container. \n\n- Paul.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-419",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Request for other RMI binding options in RepositoryStartupServlet",
    "systemSpecification": true,
    "version": ""
}