{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Attached a patch that makes all exceptions that extend BaseException extend Exception instead. Since BaseException is nowhere caught and there is little in common with the descendant exceptions, there's no benefit in making them all extend BaseException.",
            "date": "2007-12-13T05:00:39.706+0000",
            "id": 0
        },
        {
            "author": "Stefan Guggisberg",
            "body": "i don't agree. what's the benefit of removing BaseException?\n\nfor a related discussion see http://www.mail-archive.com/jackrabbit-dev@incubator.apache.org/msg04384.html\n\n-1 for removing BaseException unless there's a substantial benefit in doing so.",
            "date": "2007-12-13T08:36:20.892+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Stefan:\n> i don't agree. what's the benefit of removing BaseException?\n\nOn the other hand, what's the benefit of having BaseException? A while ago (the jackrabbit-dev@i.a.o reference) there still were a few catch clauses for BaseException, but now there are *no* places where BaseException is caught.\n\nIf it's not used, I'd rather just get rid of it.",
            "date": "2007-12-13T08:56:15.180+0000",
            "id": 2
        },
        {
            "author": "angela",
            "body": "this issue does not affect jcr2spi any more.\nthe only usages of BaseException in jcr2spi got removed with revision 641299. ",
            "date": "2008-04-10T13:50:32.391+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Patch applied in revision 732883.",
            "date": "2009-01-09T00:24:07.288+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "Hmm, should I have asked before committing this?\n\nThere are old -1s from Stefan and Felix (on the mailing list), but I figured that they applied to the era when we still had some code that actually did catch BaseExceptions. As Angela mentioned, the last such cases were gone in April last year, and currently the BaseException class is just dead code.\n\nI'll revert the change if someone still feels against this (why?), otherwise I'll assume lazy consensus and leave my commit as is.",
            "date": "2009-01-09T00:34:17.141+0000",
            "id": 5
        },
        {
            "author": "Felix Meschberger",
            "body": "Looking again at this issue and the related discussion, I do not change my mind with respect to simply removing the BaseException.\n\nI still think, it should have been renamed and the Jackrabbit-internal exception extend from it.\n\nWhat we cold do is make the BaseException extend RepositoryException, because that's what it ultimately is - an exception in the Repository",
            "date": "2009-01-09T08:21:58.755+0000",
            "id": 6
        },
        {
            "author": "angela",
            "body": "> Hmm, should I have asked before committing this? \n\nno :)\ni'm in favor of the changes made. while working on jcr2spi and the nameexceptions i found that after all the BaseExceptions where always caught and re-thrown as RepositoryException. getting rid of that in jcr2spi was an improvement from my point of view.",
            "date": "2009-01-09T08:39:40.637+0000",
            "id": 7
        },
        {
            "author": "Jukka Zitting",
            "body": "> I still think, it should have been renamed and the Jackrabbit-internal exception extend from it.\n\nWhy? The class does nothing and is used for nothing. I fail to see the reason why it should exist.\n\n",
            "date": "2009-01-09T09:03:03.456+0000",
            "id": 8
        },
        {
            "author": "Felix Meschberger",
            "body": "@angela: I see your point, this is why I suggested to have the BaseException extend the RepositoryException\n\n@Jukka: The problem is consistent exception handling and understanding what this is all about. In that sense its kind of a categorization of the exceptions. Of course the exceptions previously extending BaseException could just extend RepositoryException. But having them extend Exception is IMHO wrong.\n\n\nAnyway, since these are just internal exceptions, I don't care too much -- unless this would lead to method declarations of the form\n\n    public type someMethod() throws Exception",
            "date": "2009-01-09T09:46:22.037+0000",
            "id": 9
        }
    ],
    "component": "jackrabbit-core",
    "description": "The o.a.j.BaseException class is deprecated (since JCR-1169) and not caught anywhere, so there's no need to keep using it.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1269",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Stop using BaseException",
    "systemSpecification": true,
    "version": ""
}