{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Attached a patch that to my best knowledge adds all missing license headers. I already got a confirmation from David for adjusting the files committed by Day employees, but there are also a few files (JMX files in JCR-RMI, JBoss files in JCA) from Edgar that need the license headers. Edgar, can you confirm that it's OK for me to add those license headers?\n\nA few points worth notice:\n\n* I implemented explicit comment support (the # syntax) for the database schema files to allow license headers\n* I didn't add license headers to JAAS configuration files, since there seems to be no documented syntax for comments\n* I didn't add license headers to the expected test output files to avoid comparison issues\n* I assumed that the MIME type and HTTP status code lists in jcr-server are either original works or copies from within the ASF\n",
            "date": "2006-10-04T06:29:37.000+0000",
            "id": 0
        },
        {
            "author": "Stefan Guggisberg",
            "body": "+1 for yukka's patch",
            "date": "2006-10-04T08:36:50.000+0000",
            "id": 1
        },
        {
            "author": "Edgar Poce",
            "body": "> Edgar, can you confirm that it's OK for me to add those license headers? \n\nit's ok",
            "date": "2006-10-04T14:05:30.000+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "Fixed by applying the above patch and updating the NOTICE and LICENSE files.",
            "date": "2006-10-05T12:53:49.000+0000",
            "id": 3
        }
    ],
    "component": "",
    "description": "There are a few source files and a number of other files with missing or incorrect license headers within the Jackrabbit source tree. See the  discusssion at http://thread.gmane.org/gmane.comp.apache.jackrabbit.devel/8698 for details. The missing license headers need to be added. \n\nThere are also W3C licensed files. This needs to be mentioned in the NOTICE file.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-573",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Blocker",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Add missing license headers",
    "systemSpecification": true,
    "version": ""
}