{
    "comments": [
        {
            "author": "Justin Edelson",
            "body": "here's a patch",
            "date": "2011-07-20T20:48:08.888+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Is there really even a need for this configuration setting? I'd just use the standard java.io.tmpdir for temporary files and simply avoid the need for these configuration options. See the attached patch for the proposed change.",
            "date": "2011-08-08T16:30:43.513+0000",
            "id": 1
        },
        {
            "author": "Justin Edelson",
            "body": "if this setting can be simply removed, that works for me.",
            "date": "2011-08-08T17:46:01.262+0000",
            "id": 2
        },
        {
            "author": "angela",
            "body": "hi jukka, i would prefer a patch that is backwards compatible but dealing with missing init-param. was that possible?",
            "date": "2011-08-09T06:47:35.521+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Sounds OK. I'll make another patch that uses java.io.tmpdir as the default, but keeps to the current behavior when the any of the init-params is present. That should cover Justin's needs as well as retaining backwards compatibility for existing configurations.",
            "date": "2011-08-09T08:03:24.638+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "I modified the fix as proposed and committed the revised version in revision 1155403.\n\nNow java.io.tmpdir gets used (as the default from DiskFileItemFactory) when neither the \"home\" nor the \"temp-directory\" init parameters are present. If either is set, then the temporary directory is constructed as before.",
            "date": "2011-08-09T15:34:59.837+0000",
            "id": 5
        }
    ],
    "component": "jackrabbit-jcr-server",
    "description": "For deployment scenarios where the same Jackrabbit WAR file is deployed multiple times on the same server with the same current working directory, it is useful to have the home init-param support system property interpolation.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-3029",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "JcrRemotingServlet should interpolate system properties in the home init-param",
    "systemSpecification": true,
    "version": ""
}