{
    "comments": [
        {
            "author": "Cédric Damioli",
            "body": "do you mean lucene tokenizer ?\nwhat about non-whitespace-aware tokenizers ? (is there any ? CJK maybe ?)\n",
            "date": "2010-02-22T12:35:25.037+0000",
            "id": 0
        },
        {
            "author": "Marcel Reutegger",
            "body": "> do you mean lucene tokenizer ? \n\nyes.\n\nactually it's not that bad and only affects Jackrabbit versions 1.4 and lower. That's also the version where I discovered the issue. More recent versions use lucene-core 2.3.2 or 2.4.1, which only use one TokenStream at a time and even try to re-use the tokenizer.\n\nSee LUCENE-969.\n\nThere's still room for improvement. The JackrabbitAnalyzer does not implement reusableTokenStream(). That is, each value of a multi-valued property will instantiate a new Tokenizer.\n\nThe proposed patch fixes this. With the patch applied, the JCRAPITest suite takes about 10% less time to execute on my machine.",
            "date": "2010-02-22T16:27:30.023+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "+1 Sounds great!",
            "date": "2010-02-22T16:40:30.361+0000",
            "id": 2
        },
        {
            "author": "Marcel Reutegger",
            "body": "Applied patch in revision: 915718",
            "date": "2010-02-24T08:19:19.177+0000",
            "id": 3
        }
    ],
    "component": "jackrabbit-core",
    "description": "Multi-valued string properties are tokenized per value, which may consume quite some memory when there are lots of small values in on a property. The memory footprint is 2k per value, because each value is tokenized with a separate tokenizer instance. That tokenizer uses a stream buffer of 2k bytes.\n\nInstead the values should be concatenated (whitespace separated) and then tokenized in one go.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-2505",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "High memory usage on node with multi-valued string properties",
    "systemSpecification": true,
    "version": ""
}