{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "..., which is also the default in lucene.",
            "date": "2007-11-27T14:03:23.502+0000",
            "id": 0
        },
        {
            "author": "Ard Schrijvers",
            "body": "Performance drops indeed almost linearly when the number of indexes grow very large. OTOH, merging very large indexes also means loosing possibly very large hierarchical caches (which we just hopefully  fixed :-)). I agree on setting it to Integer.MAX_VALUE, but I think I would personally use values around 1.000.000.  I'd like to have some configuration thing or some hook/trigger  which could say to optimize and merge all (at startup or at some point in time which i might control myself). ",
            "date": "2007-11-27T14:23:21.198+0000",
            "id": 1
        },
        {
            "author": "Christoph Kiehl",
            "body": "Sounds good! +1",
            "date": "2007-11-27T19:19:01.459+0000",
            "id": 2
        },
        {
            "author": "Marcel Reutegger",
            "body": "Committed change in revision: 598940",
            "date": "2007-11-28T10:23:40.745+0000",
            "id": 3
        }
    ],
    "component": "jackrabbit-core",
    "description": "This is actually a left over from the time before JCR-197 was implemented. Back then index merges were performed with the client thread and would hold up execution for a long time if a large number of nodes were merged. The default value for maxMergeDocs limited this to 100'000 nodes, resulting in a couple of seconds for the merge operation.\n\nThis default value does not make sense anymore because index merges are performed in a background thread and may take a long time without an effect on regular workspace operations. If a workspace grows large it may cause performance degradation because the number of index segments increases linearly when there are more than 100'000 nodes.\n\nI propose to set the new default to Integer.MAX_VALUE",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1238",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Change default value for maxMergeDocs",
    "systemSpecification": true,
    "version": ""
}