{
    "comments": [
        {
            "author": "fabrizio giustina",
            "body": "maven 2 pom.xml",
            "date": "2006-03-05T03:41:47.000+0000",
            "id": 0
        },
        {
            "author": "fabrizio giustina",
            "body": "updated pom with slf4j dependency",
            "date": "2006-03-12T23:16:34.000+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Great work! I'd be happy to migrate to Maven2 once the 1.0 release is out.\n\nWhat do you think would be the best way to handle the JTA and JCR dependencies? In the current Maven1 project.xml we are pointing to the JTA jar in geronimo-spec to avoid forcing the user to manually download the API jar. Should we do that as well in the Maven2 pom.xml? The Maven2 configuration also complains about the POM of the JCR API jar. Should Day provide a Maven2 version of the JCR API POM or can we work around this?\n\nI like your idea about the test configuration. The test suite could do with some simple restructuring in any case, but we are somewhat constrained by the JSR TCK test cases being hosted in org.apache.jackrabbit.test.",
            "date": "2006-03-13T03:06:34.000+0000",
            "id": 2
        },
        {
            "author": "fabrizio giustina",
            "body": "Regarding the jcr API dependency: if the license doesn't impose any limitation on this, I can proceed with an upload request to the official ibiblio repo (converting the pom to the m2 format), it will surely be better than making any app that uses jcr dependant on the day repository. If not, I can simply request the upload of the m2 pom and javadocs without the jar (and you will have to manually download the jar)\n\nAbout JTA, we can freely depend on the geronimo implementation or requesting users to download it manually (personally,I prefer to use the standard javax.transaction dependency... if you use maven soon or later you have to download it to your repository).\n",
            "date": "2006-03-13T04:24:47.000+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Committed the Maven 2 POM in revision 422315 to get people to test it out. Thanks again, Fabrizio, for the help!\n\nI think I'll do similar Maven 2 POMs for the simpler subprojects and come back to tweaking the core build once the subprojects work flawlessly with Maven 2.",
            "date": "2006-07-15T23:11:38.000+0000",
            "id": 4
        },
        {
            "author": "fabrizio giustina",
            "body": "Hi Jukka,\nthere is now a maven plugin for m1 to m2 pom conversion. Still in the sandbox, but you might find it useful for quick conversion of all the remaining poms... you will have to build it from sources at\nhttps://svn.apache.org/repos/asf/maven/sandbox/plugins/maven-maven1-plugin/\n\n(you can then run \"mvn maven1:convert\" in order to obtain a base m2 pom)",
            "date": "2006-07-16T08:00:11.000+0000",
            "id": 5
        },
        {
            "author": "Christoph Kiehl",
            "body": "Added a patch which does the following:\n\n- Change artifactId from \"jackrabbit\" to \"jackrabbit-core\"\n- Omit generating XPath.jjt \n- Use javacc 3.2 because with 4.0 I got syntax errors\n- Set system properties for unit tests\n\nThere is still some work to do to get the tests running, but at least I can build jackrabbit with \"maven -Dmaven.test.skip=true install\"",
            "date": "2006-08-01T11:03:07.000+0000",
            "id": 6
        },
        {
            "author": "Jukka Zitting",
            "body": "Thanks for the update! Committed in revision 427531.",
            "date": "2006-08-01T11:10:18.000+0000",
            "id": 7
        },
        {
            "author": "Christoph Kiehl",
            "body": "Added jcr-rmi-pom.xml. This is a basic maven 2 pom for jackrabbit-jcr-rmi. Checkstyle reports are still missing cause I just needed a working build.",
            "date": "2006-08-03T17:23:48.000+0000",
            "id": 8
        },
        {
            "author": "Jukka Zitting",
            "body": "Thanks for the jcr-rmi-pom.xml contribution! Committed in revision 428511.",
            "date": "2006-08-03T20:12:15.000+0000",
            "id": 9
        },
        {
            "author": "Christoph Kiehl",
            "body": "Added two patches which change the following:\n\njackrabbit-core & jackrabbit-jcr-rmi:\n- Maven does not like multiline description in the pom (see http://jira.codehaus.org/browse/MJAR-4). This problem should be gone with the relase of Maven 2.0.5. Until then put the description on _one_ line.\n\njackrabbit-jcr-rmi:\n- Added compilation of RMI Stubs\n",
            "date": "2006-08-04T13:44:44.000+0000",
            "id": 10
        },
        {
            "author": "Jukka Zitting",
            "body": "Thanks again, Chistoph! I committed the RMI compilation change in revision 429258.\n\nI digged a bit deeper on the multiline description issue. It is caused by http://jira.codehaus.org/browse/PLX-185. As discussed in the comments of that issue, it only causes manifest corruption if the multiline entry contains rows that start with something else than a space. Since our pom.xml is space-indented,  I don't think that this is more than a cosmetic issue for us. Thus in the interest of keeping the POM clean and easy to read, I prefer not to apply the multiline fixes. Please comment if you disagree.",
            "date": "2006-08-07T07:09:18.000+0000",
            "id": 11
        },
        {
            "author": "Christoph Kiehl",
            "body": "Jukka,\n\nI my case the problem were the newlines of the multiline description. Plexus archiver adds a line break after a certain amount of characters. Somehow I ended up with a manifest that contained an empty line which is not allowed by specification. One could probably try to adjust the line length in the description to avoid this, but that way it gets really fragile against changes. Just try to build the jcr-rmi jar and look at your manifest.",
            "date": "2006-08-07T08:50:31.000+0000",
            "id": 12
        },
        {
            "author": "Jukka Zitting",
            "body": "> I my case the problem were the newlines of the multiline description. \n\nAh, bugger. OK, I think that's reason enough to apply the multiline changes. Thanks for pointing this out.",
            "date": "2006-08-07T09:23:28.000+0000",
            "id": 13
        },
        {
            "author": "Christoph Kiehl",
            "body": "Corrected SCM settings",
            "date": "2006-08-16T11:00:40.000+0000",
            "id": 14
        },
        {
            "author": "Przemo Pakulski",
            "body": "Patch (maven2-test.patch) containing following changes added:\n- dependencies to xerces, xercesXMLApis added again (jackrabbit-core is still dependent on Xerces directly during runtime, I post some comments on JCR-367),\n- deleteSources, prepareTestRepository, cleanTestData ant targets added to make possible running tests on Maven2, all ant targets extracted to external build.xml file (as suggested by Maven docs),\n- maven-surefire-plugin configuration changed (to run initialization tests first before others), \n- minor changes in resources, test-resources (based maven1 project.xml file),\n- minor changes in javacc goal (to reuse single directory for generated sources and timestamps).",
            "date": "2006-10-20T11:27:22.000+0000",
            "id": 15
        },
        {
            "author": "Miro Walker",
            "body": "Has anyone had a chance to try this patch yet? There's a recent comment on JCR-352 suggesting that the work to migrate is ongoing, but I wonder what is left to do?",
            "date": "2006-10-27T14:58:56.000+0000",
            "id": 16
        },
        {
            "author": "Jukka Zitting",
            "body": "Applied the patch (maven2-test.patch) without the Xerces dependencies (since JCR-602 was resolved) in revision 468968. Thanks Przemo!\n\n> Has anyone had a chance to try this patch yet? There's a recent comment on JCR-352 suggesting\n> that the work to migrate is ongoing, but I wonder what is left to do?\n\nHaving the tests running was a major milestone. I think we're mostly done for jackrabbit-core, but we still need to upgrade the other main components (textfilters, jcr-server, etc.) to Maven 2 before moving from Maven 1 as the official build environment. See also the recent restructuring discussion on the dev mailing list.",
            "date": "2006-10-29T20:01:32.000+0000",
            "id": 17
        },
        {
            "author": "Jan Kuzniak",
            "body": "see JCR-612 - there is more maven2 stuff attached. I decided to put it there because it's closer to restructurisation than migration itself.",
            "date": "2006-11-17T10:38:23.000+0000",
            "id": 18
        },
        {
            "author": "Jukka Zitting",
            "body": "All the main Jackrabbit components now have working Maven 2 builds. Thus resolving this issue as fixed. Many thanks to everyone who participated!",
            "date": "2006-12-03T23:29:34.000+0000",
            "id": 19
        }
    ],
    "component": "maven",
    "description": "If you are interested in migrating to maven2 (or adding optional maven 2 build scripts) this is a full maven 2 pom.xml for the main jackrabbit jar.\n\nAll the xpath/javacc stuff, previously done in maven.xml, was pretty painfull to reproduce in maven2... the attached pom exactly reproduces the m1 build by using the maven2 javacc plugin + a couple of antrun executions.\nTest configuration is not yet complete, I think it will be a lot better to reproduce the previous behaviour (init tests run first) without any customization (maybe using a single junit test suite with setUp tasks). Also custom packaging goals added to maven.xml (that can be esily done in m2 by using the assembly plugin) are not yet reproduced too.\n\nIf there is interest, I can also provide poms for the contribution projects (that will be easy, the only complex pom is the main one).\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-332",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Upgrade to Maven 2",
    "systemSpecification": true,
    "version": ""
}