{
    "comments": [
        {
            "author": "angela",
            "body": "hi felix\n\nmay i ask you to create separate issues for different things?\nit makes discussions and issue-resolution hard if various issues are packed into one.\n\nin this special case the 2 issues also affect different jackrabbit projects. one more reason to keep it in separate issues.\n\nthanks a lot\nangela",
            "date": "2007-12-07T16:05:49.261+0000",
            "id": 0
        },
        {
            "author": "angela",
            "body": "a part from that... i'm in favour of the proposed changes.",
            "date": "2007-12-07T16:08:33.117+0000",
            "id": 1
        },
        {
            "author": "Felix Meschberger",
            "body": "Reducing the extent of this issue to the modification of the AbstractWebdavServlet as suggested by Angela. See JCR-1263 for the former second part regarding the SimpleWebdavServlet.",
            "date": "2007-12-09T18:17:22.750+0000",
            "id": 2
        },
        {
            "author": "Felix Meschberger",
            "body": "Patch implementing proposed change to the AbstractWebdavServlet:\n\n  - Extend new AbstractWebdavServlet\n  - Remove all methods",
            "date": "2007-12-09T18:25:06.723+0000",
            "id": 3
        },
        {
            "author": "Felix Meschberger",
            "body": "Fixed in Rev. 603175.",
            "date": "2007-12-11T08:36:22.818+0000",
            "id": 4
        },
        {
            "author": "angela",
            "body": "scheduled for 1.4",
            "date": "2007-12-11T08:42:15.780+0000",
            "id": 5
        }
    ],
    "component": "jackrabbit-jcr-server",
    "description": "The AbstractWebdavServlet has been copied from the jcr-server to the webdav project. The class at the old location has been marked deprecated. I suggest that in addition to marking it deprecated we should have this class extend the new AbstractWebdavServlet class from the webdav project but not contain any fields and methods. This way, users of the old class will always get the newest and best version but can still use the old class.\n\nWill provide a patch for this proposal",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1262",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Deprecated AbstractWebdavServlet should be empty and extend new AbstractWebdavServlet",
    "systemSpecification": true,
    "version": ""
}