{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Jackrabbit now uses Apache Tika (version 0.3) as the default text extractor.\n\nAll the previous text extractor classes still exist, so any existing configurations should still work as before.",
            "date": "2009-04-07T15:50:50.238+0000",
            "id": 0
        },
        {
            "author": "Marcel Reutegger",
            "body": "I don't feel that comfortable with the new dependencies that were added with this change. More specifically the size of icu4j and ooxml-schemas. The first is about 4MB and the latter 13MB (!). Comparing the size of jackrabbit-standalone in 1.5 with current trunk shows that it doubled from 20 to over 40 MB.\n\nWhat do others think about this?",
            "date": "2009-04-16T10:40:14.810+0000",
            "id": 1
        },
        {
            "author": "Felix Meschberger",
            "body": "I think using tika would be great. But I agree: this increase makes me shiver ...",
            "date": "2009-04-16T10:50:24.914+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "We need the ooxml-schemas dependency in any case if we want to support Microsoft Office 2007 files (see JCR-1887). I think that's a pretty important improvement, that's definitely worth keeping even if it notably increases the standalone jar size.\n\nI'll ping the POI people on whether the ooxml-schemas jar could be trimmed down somehow.\n\nAlso, in Tika we could perhaps find some ways to reduce the size of the dependencies, as not all of the included functionality is really needed (text extraction is typically just a part of the functionality included in the parser libraries).\n\nAnyway, I'm reopening this issue until we have a solution that satisfies everyone.",
            "date": "2009-04-16T11:12:57.040+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "There is progress in Tika to address these concerns (for example the ICU4J dependency was replaced by inlining just those classes that are really needed), but I don't think we'll have a Tika 0.4 release out in time for Jackrabbit 1.6.\n\nThus I'm inclined to revert these (and JCR-1887) changes from the 1.x branch and focus on Jackrabbit 2.0 for Tika integration.",
            "date": "2009-05-26T08:56:40.865+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "OK, reverted the changes from 1.x in revision 779501. Targeting the 2.0 release instead.",
            "date": "2009-05-28T09:22:01.384+0000",
            "id": 5
        },
        {
            "author": "Jukka Zitting",
            "body": "I upgraded the Tika dependency to 0.4 in revision 807139. This dropped the size of jackrabbit-standalone jar from 44MB to 39MB. It's still quite a bit, but until we have an alternative way to extract text from OOXML files we're stuck with the large ooxml-schemas jar. I had a discussion with the POI team about a trimmed down \"extract only\" version of the OOXML support, but it looks like that would have to use a different design than the current implementation and there doesn't seem to be too many people with such an itch. So for now I'm OK to live with the extra megabytes.",
            "date": "2009-08-24T10:22:40.517+0000",
            "id": 6
        },
        {
            "author": "Jukka Zitting",
            "body": "I have now dropped the jackrabbit-text-extractors component in favor of a direct Apache Tika dependency.\n\nTODO:\n* Add a configuration option for using custom Tika settings\n* Replace extractor pool configuration with repository-global pool config\n* Document the change in the release notes",
            "date": "2009-09-16T13:52:48.207+0000",
            "id": 7
        },
        {
            "author": "Jukka Zitting",
            "body": "Resolving as fixed, we can add the extra configuration options in later releases.",
            "date": "2010-01-18T15:47:23.645+0000",
            "id": 8
        },
        {
            "author": "Julian Reschke",
            "body": "trunk: [r887170|http://svn.apache.org/r887170] [r884646|http://svn.apache.org/r884646] [r884642|http://svn.apache.org/r884642] [r884575|http://svn.apache.org/r884575] [r883777|http://svn.apache.org/r883777] [r883382|http://svn.apache.org/r883382] [r816089|http://svn.apache.org/r816089] [r815785|http://svn.apache.org/r815785] [r815776|http://svn.apache.org/r815776] [r815774|http://svn.apache.org/r815774] [r807139|http://svn.apache.org/r807139] [r794633|http://svn.apache.org/r794633] [r778621|http://svn.apache.org/r778621] [r763242|http://svn.apache.org/r763242] [r763160|http://svn.apache.org/r763160] [r762823|http://svn.apache.org/r762823] [r762821|http://svn.apache.org/r762821] [r762818|http://svn.apache.org/r762818] [r762817|http://svn.apache.org/r762817] [r762814|http://svn.apache.org/r762814] [r762813|http://svn.apache.org/r762813] [r762804|http://svn.apache.org/r762804] [r762802|http://svn.apache.org/r762802]\r\n",
            "date": "2017-12-18T14:32:03.765+0000",
            "id": 9
        }
    ],
    "component": "jackrabbit-text-extractors",
    "description": "Once Apache Tika is released with a resolution to TIKA-175 (making Tika available to Java 1.4 projects), we should replace our direct parser library dependencies with Tika parsers. Ideally we'd just use the Tika AutoDetectParser that'll automatically detect the type of a binary and parse it accordingly, solving JCR-728.\n\nI guess we should keep some level of backwards compatibility with existing textFilterClasses=\"...\" configurations, perhaps by keeping the existing TextExtractor classes as wrappers around respective Tika parsers.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1878",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Use Apache Tika for text extraction",
    "systemSpecification": true,
    "version": ""
}