{
    "comments": [
        {
            "author": "Brian Moseley",
            "body": "any comments on this issue? these changes have been very useful to me in building a command line tool that can register custom namespaces and nodetypes in a repository (see http://svn.osafoundation.org/server/commons/trunk/jackrabbit/).",
            "date": "2005-08-11T08:05:31.000+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "I'm sorry for not acting on this issue sooner. I was a bit occupied at times during the summer and didn't really notice this issue until now.\n\nThe changes you proposed were committed in revision 290470 with some modifications. I actually made the main NodeTypeReader methods public instead protected to facilitate composition in addition to inheritance as an extension mechanism. I also didn't change any of the DOMWalker functionality as the getNamespaces() method should always return the namespace registrations of the *current* element. Instead i changed the NodeTypeReader to cache the top-level namespaces as a private property that is accessible through the proposed getter method.\n\nThanks for reporting the issue! I hope that the committed changes cover the functionality you need, even if the issue was pending so long.",
            "date": "2005-09-21T00:25:30.000+0000",
            "id": 1
        }
    ],
    "component": "nodetype",
    "description": "in working towards an offline tool to import custom namespaces and node types, i found that i needed to make some small changes to NodeTypeReader and DOMWalker so that i could subclass NodeTypeReader and access the namespaces specified in the node type definition file. see the attached patch.\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-142",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "allow subclassing of NodeTypeReader",
    "systemSpecification": false,
    "version": ""
}