{
    "comments": [
        {
            "author": "Vijai Kalyan",
            "body": "This patch needs the patch from the linked issue for Oracle to be applied first.",
            "date": "2008-01-07T21:13:23.379+0000",
            "id": 0
        },
        {
            "author": "Vijai Kalyan",
            "body": "Modified / New source files in entirety for addressing this issue. Note that the patch included in the linked issue need to be applied first.",
            "date": "2008-01-07T21:14:02.862+0000",
            "id": 1
        },
        {
            "author": "Vijai Kalyan",
            "body": "This issue requires that patch in JCR-968 to be applied first. It is similar to JCR-968 but adds the same support for MS SQL Server.",
            "date": "2008-01-07T21:15:53.370+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "I committed a partial and slightly modified version of the patch in revision 610214. The committed version only contains the bundle persistence and journal changes.\n\nI dropped the db persistence and file system changes since they didn't compile (createSchemaSql vs. getSchemaDDL, etc.). Also, as of Jackrabbit 1.4 I would recommend people to use bundle persistence over db persistence and to disable useExternalBlobs over using a database file system. Thus I don't think it's necessarily even worthwhile implementing tablespace support for those features.\n\nMerged to the 1.4 branch in revision 610219 for inclusion in the Jackrabbit 1.4 release.\n\nThanks for the contribution!",
            "date": "2008-01-08T23:10:34.273+0000",
            "id": 3
        },
        {
            "author": "Vijai Kalyan",
            "body": "I will recheck the file system changes. As for the changes in db persistence, we are at present using db persistence over bundle persistence since bundle persistence does not provide a method to override how a connection is obtained (and we have a need to route connection requests through our internal code which provides connection pooling etc). ",
            "date": "2008-01-14T17:34:59.921+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-core",
    "description": "Tablespace support was added for Oracle database servers in this issue\n\nhttps://issues.apache.org/jira/browse/JCR-968\n\nWe would like tablespace (or filegroup) support for MS SQL Server as well. To address this, we have created a patch using the trunk of JackRabbit that closely follows the patch in the above named issue.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1295",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Tablespace (Filegroup) support for MS SQL Server",
    "systemSpecification": true,
    "version": ""
}