{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "Assuming lazy consensus I committed the patch in revision: 550466",
            "date": "2007-06-25T12:16:59.144+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Merged to the 1.3 branch in revision 581168.",
            "date": "2007-10-02T09:27:46.909+0000",
            "id": 1
        }
    ],
    "component": "versioning",
    "description": "From a architectural perspective the VersionManagerImpl (VMgr) is at a higher level as the VersionItemStateProvider (VISP). While the VMgr deals with Items the VISP deals with ItemState object. Nonetheless the VISP has a reference to the VMgr and also calls the method setNodeReferences(), which violates the rule of a strictly layered system. E.g. one negative effect of this was a deadlock as described in JCR-672. It also makes it hard to solve JCR-962.\n\nThe attached patch includes the following changes:\n\n- Move method VersionManagerImpl.setNodeReferences() VersionItemStateManager. The method can operate on ItemStates only and does not need to be in VersionManagerImpl. As can be seen in the current method it directly calls the PeristenceManager, which indicates it should be located in a lower layer.\n- Promote the class VersionItemStateManager to a top level class\n- Change method VersionManagerImpl.createSharedStateManager to return a VersionItemStateManager\n- Remove VersionManagerImpl instance variable from VersionItemStateProvider\n- In VersionItemStateProvider.setNodeReferences() call VersionItemStateManager.setNodeReferences()\n- Instead of using the PersistenceManager in VersionManagerImpl.getItemReferences() use the ItemStateManager. It also seems that locking is not necessary for this method.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-978",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Remove circular dependency between VersionManagerImpl and VersionItemStateProvider",
    "systemSpecification": true,
    "version": ""
}