{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "Initial patch.\n\nComments welcome.",
            "date": "2009-07-16T07:15:41.485+0000",
            "id": 0
        },
        {
            "author": "Marcel Reutegger",
            "body": "Updated patch.",
            "date": "2009-08-05T11:54:00.783+0000",
            "id": 1
        },
        {
            "author": "Marcel Reutegger",
            "body": "Updated patch again.",
            "date": "2009-08-05T14:43:14.546+0000",
            "id": 2
        },
        {
            "author": "Marcel Reutegger",
            "body": "OK, this one is now really against current trunk ;)",
            "date": "2009-08-05T14:46:59.225+0000",
            "id": 3
        },
        {
            "author": "Marcel Reutegger",
            "body": "Committed most recent patch in revision: 801253\n\nIndex segment information and redo logs are now write once and append only. That is both now have a generation suffix. E.g. you might now see files like: indexes_13 and redo_13.log\n\nThe indexes file references the persistent index segment, while the associated redo log contains the changes on top of them that are not currently flushed to disk.\n\nThere is a new parameter maxHistoryAge, which tells the index for how long it should keep past index commit points (basically the indexes_<gen> and possibly unused the index segments it references). The default value is zero, which means past index commit points are deleted immediately.",
            "date": "2009-08-05T15:05:02.600+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-core",
    "description": "Currently index updates modify some existing files. This is troublesome in scenarios like a backup or when an index will be shared in a cluster (though this is not yet the case).\n\nRequirements are:\n\n- index segments need a custom (lucene) IndexDeletionPolicy to keep index commits for a given time.\n- index segments are not only referenced by their name, but also with their generation\n- the segments file must now also record the generation of a segment. the file itself must be generational itself.\n- purging of outdated index segment commits\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-2216",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Append-only index updates",
    "systemSpecification": true,
    "version": ""
}