{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Tagged for 1.0\n",
            "date": "2006-01-11T18:12:01.000+0000",
            "id": 0
        },
        {
            "author": "Sandro Boehme",
            "body": "o The registration of the internal node types at start up of the repository is left as it is, as good as possible.\no The creation of the effective node types is left as it is, as good as possible.\no The patch adds a cloned EffectiveNodeTypeCache object and a cloned map of registered NodeTypeDefs to the context of the node type registration.\nAll node type definitions specified in the registerNodeTypes(Collection) method call are temporarily added to this map of registered NodeTypeDefs.\nThe validation of the node types uses the registration context and therefore also considers all new node types no matter if they are\ncyclic dependend like the one this issue is about. Stefans nice checks for circular node auto creation and circular inheritance should still work.\nOnly if all node types definitions are valid and all node types could be created they are finally added to the repository. \nA failed validation or registration does not effect the repository.\nThat also fixes JCR-274.\nThank you Stefan, for the support behind the scenes.\n",
            "date": "2006-01-21T07:37:16.000+0000",
            "id": 1
        },
        {
            "author": "Sandro Boehme",
            "body": "As it is not yet possible to unregister node types this test is just for a one time use. ",
            "date": "2006-01-21T07:40:55.000+0000",
            "id": 2
        },
        {
            "author": "Sandro Boehme",
            "body": "My first comment assumes to be posted in JCR-273 not in this issue :-/ ",
            "date": "2006-01-21T07:43:44.000+0000",
            "id": 3
        },
        {
            "author": "Stefan Guggisberg",
            "body": "committed sandro's patch with some modifications (mainly formatting related)\nthanks sandro!\n\nfixed in svn r. 373516\n\n",
            "date": "2006-01-30T23:15:49.000+0000",
            "id": 4
        }
    ],
    "component": "nodetype",
    "description": "the javadoc says:\n\n     * Note that in the case an exception is thrown, some node types might have\n     * been nevertheless successfully registered.\n\nthe problem hereby is, that it cannot be determined easily, what nodetypes could be registered, and which couldnt. i would rather prefer a all-or-nothing behaviour.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-274",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "NodeTypeRegistry.registerNodetypes(Collection) should not register a partial set",
    "systemSpecification": true,
    "version": ""
}