{
    "comments": [
        {
            "author": "Felix Meschberger",
            "body": "Created pluginManagement section for base configuration of the Maven Bundle Plugin in the root pom.xml in Rev. 614848.\n\nThe Maven Bundle Plugin of the Apache Felix project is used to build the project jar files and also creates the OSGi manifest headers from the respective configuration.",
            "date": "2008-01-24T11:36:13.243+0000",
            "id": 0
        },
        {
            "author": "Felix Meschberger",
            "body": "Define bundle packaging in the jackrabbit-jcr-commons project and declare all packages to be exported.\n\nFixed in Rev. 614850.",
            "date": "2008-01-24T11:41:51.370+0000",
            "id": 1
        },
        {
            "author": "Felix Meschberger",
            "body": "Define bundle packaging in the jackrabbit-api project and declare all packages to be exported.\n\nFixed in Rev. 614853.",
            "date": "2008-01-24T11:45:44.743+0000",
            "id": 2
        },
        {
            "author": "Felix Meschberger",
            "body": "Removed Bundle-SymbolicName definition in the root pom as the default is ${pom.groupId}.${pom.artifactId} which is more appropriate for Jackrabbit than to just the artifact ID in Rev. 614860.\n\nDefine bundle packaging in the jackrabbit-jcr-rmi project and declare all packages to be exported in Rev. 614859.",
            "date": "2008-01-24T12:42:04.545+0000",
            "id": 3
        },
        {
            "author": "Felix Meschberger",
            "body": "All projects named in this issue (jackrabbit-api, jackrabbit-jcr-commons and jackrabbit-jcr-rmi) have been modified to create bundle manifest headers. So this issue can now be closed.",
            "date": "2008-01-24T12:45:24.423+0000",
            "id": 4
        },
        {
            "author": "Felix Meschberger",
            "body": "Schedule for rmi 1.4.1 and commons 1.4.1 releases",
            "date": "2008-03-13T12:27:18.713+0000",
            "id": 5
        },
        {
            "author": "Felix Meschberger",
            "body": "Descheduling from the rmi 1.4.1 release.",
            "date": "2008-03-14T08:57:41.787+0000",
            "id": 6
        },
        {
            "author": "Martin Zdila",
            "body": "I think that also jackrabbit-text-extractors, jackrabbit-spi-commons, jackrabbit-spi and jackrabbit-core libraries should be budles. How could we otherwise use Jackrabbit in the OSGi environment if not all required libraries are bundles? You maybe could also provide jcr-1.0.jar as OSGi bundle. Current;y I must create bundles from forementioned libraries by using the bnd tool. Thanks in advance.",
            "date": "2009-01-22T08:28:18.403+0000",
            "id": 7
        }
    ],
    "component": "jackrabbit-api, jackrabbit-jcr-commons, jackrabbit-jcr-rmi",
    "description": "To be able to easily uses libraries from Jackrabbit inside an OSGi framework, for example in Apache Sling, it would be very helpfull if some of the Jackrabbit libraries include OSGi Bundle Manifest headers. It will of course not be possible to define such manifest header definition for all libraries, but jackrabbit-api, jackrabbit-jcr-commons and jackrabbit-jcr-rmi are certainly good candidates.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1342",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Create OSGi Bundle Manifest Headers",
    "systemSpecification": true,
    "version": "1.4"
}