{
    "comments": [
        {
            "author": "Claus Köll",
            "body": "+1 from me :-)",
            "date": "2011-12-05T14:30:19.509+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Done in revision 1210476.",
            "date": "2011-12-05T14:39:22.408+0000",
            "id": 1
        },
        {
            "author": "Felix Meschberger",
            "body": "Sorry for being late. But I don't think, that I really like this ...\n\nIf you want to integrate this you can have an Maven Eclipse plugin setup to have the JavaCC process run on demand. Checking in generated code as primary source does not feel right.",
            "date": "2011-12-05T22:25:58.047+0000",
            "id": 2
        },
        {
            "author": "Thomas Mueller",
            "body": "In this case, checking in the generated code probably simplifies a lot (anyway I hope we don't need JavaCC in the future).\n\nFelix, do you have a list of concrete disadvantages? If not that's OK.",
            "date": "2011-12-06T08:24:19.888+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "So far I haven't figured out a way to make Eclipse and other IDEs pick up the generated sources automatically during an import. Until we have such a patch I think having the precompiled sources in svn under src/main/java is the best solution here.\n\nPS. For future reference: When changing the JavaCC sources, use \"mvn clean install -Pjavacc\" in jackrabbit-spi-commons and commit the updated files.",
            "date": "2011-12-06T10:46:04.518+0000",
            "id": 4
        },
        {
            "author": "Michael Dürig",
            "body": "> PS. For future reference: When changing the JavaCC sources, use \"mvn clean install -Pjavacc\" in jackrabbit-spi-commons and commit the updated files. \n\nI'm almost sure this will backfire since people will forget about this. At the very least we should put this note into the headers of all the JavaCC source files. \n\nHowever, is it really worth to trade correctness for convenience here? I feel the IDE pain too. In fact I felt it for the past couple of years. Why the sudden hurry now?",
            "date": "2011-12-06T11:24:36.917+0000",
            "id": 5
        }
    ],
    "component": "jackrabbit-spi-commons",
    "description": "The JavaCC-generated Java source files in jackrabbit-spi-commons require special configuration when importing Jackrabbit sources to an IDE like Eclipse. To make IDE integration smoother it would be nice if precompiled copies of the Java files existed the src/main/java folder.\n\nPrecompiling the sources would also allow us to avoid the JavaCC processing step during each Jackrabbit build. Instead we could have a separate profile for explicitly recompiling the JavaCC sources when they have been modified. In the past three years that has happened only once (JCR-952), so I think a bit of extra complexity there is justified by the simplification we can achieve in normal builds and IDE integration.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-3170",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Precompile JavaCC parsers in jackrabbit-spi-commons",
    "systemSpecification": true,
    "version": ""
}