{
    "comments": [
        {
            "author": "Dominique Pfister",
            "body": "Fixed in revision 581150 as suggested.",
            "date": "2007-10-02T07:50:09.294+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Reopening to set resolution for 1.4",
            "date": "2007-11-22T00:28:52.974+0000",
            "id": 1
        }
    ],
    "component": "clustering, config, jackrabbit-core",
    "description": "In the 1.3 upgrade to JackRabbit, the DatabasePersistenceManager class was refactored to allow easy subclassing.  On my project, the subclassing is required because the DBAs have a specific naming convention for database columns, and the default JackRabbit columns don't fit within the naming convention.\n\nAt this point, we're cutting over to a clustered setup in preparation for production.  In my design, I would like to use the database for journaling.  But once again, the DBAs will want to change the column names to their own naming convention.  The existing DatabaseJournal class is not set up for the same type of subclassing that the PersistenceManager (or even the FileSystem) hierarchies.  I'd like the DatabaseJournal class to be updated accordingly.\n\nIn specific, here are the changes I'm looking for:\n\n* Extract protected instance variables for selectRevisionsStmtSql, updateGlobalStmtSql, selectGlobalStmtSql, and insertRevisionStmtSql.\n* Extract method protected void buildSQLStatements() which sets up the above sqls, and allows subclasses to override.\n* Update the existing prepareStatements method to use the above instance variables.\n* Update the init method to call the buildSQLStatements method before the call to prepareStatements.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1156",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "DatabaseJournal refactoring for subclassing capability",
    "systemSpecification": true,
    "version": ""
}