{
    "comments": [
        {
            "author": "Julian Reschke",
            "body": "Why would that be a \"misbehaving\" editor???\n",
            "date": "2008-10-29T19:54:22.237+0000",
            "id": 0
        },
        {
            "author": "Grégory Joseph",
            "body": "Because it makes Jackrabbit unhappy ;)\n\nMore seriously, simply because it modified the file - most likely - without informing the user. If some software modifies the format of a file it edits into what is essentially a different format, one could qualify that as misbehavior. That's sort out of the scope of this issue, though ;)",
            "date": "2008-10-29T20:04:59.514+0000",
            "id": 1
        },
        {
            "author": "Julian Reschke",
            "body": "Yep. I just wanted to clarify that a UTF-8 BOM is totally legal in an XML file.\n",
            "date": "2008-10-29T20:10:33.285+0000",
            "id": 2
        },
        {
            "author": "Grégory Joseph",
            "body": "It is, and unfortunately, as it stands, Jackrabbit won't support it.",
            "date": "2008-10-29T20:14:37.760+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Good catch, thanks! Patch applied in revision 709142.",
            "date": "2008-10-30T11:37:35.993+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "Merged to the 1.4 branch in revision 736684.",
            "date": "2009-01-22T15:59:30.744+0000",
            "id": 5
        }
    ],
    "component": "config, jackrabbit-core",
    "description": "I wondered if there was a specific reason why workspace.xml files are loaded using a FileReader instead of an InputStream in RepositoryConfig?\n\nIf the workspace.xml file has a BOM (which could happen if someone edited the file manually with some misbehaving editor), then it can't be loaded (\"Content not allowed in prolog\") - here's a little patch that fixes this.\n\nI left the output part untouched (i.e still using a Writer) - which makes it a little inconsistent - maybe someone with a better knowledge of the JR FileSystem api could fix this.\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1841",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Workspace.xml can't be loaded if it has a BOM",
    "systemSpecification": true,
    "version": "core 1.4.6, 1.5"
}