{
    "comments": [
        {
            "author": "Julian Reschke",
            "body": "Proposed patch.",
            "date": "2006-08-10T13:20:34.000+0000",
            "id": 0
        },
        {
            "author": "Marcel Reutegger",
            "body": "This is done on purpose. Throwing a NotExecutableException will indicate to the TCK that the test case\ndid not fail even though it did not run. Hence the test was successful.\n\nIf all Level 2 tests on a Level 1 repository throw NotExecutableExceptions the TCK would finally declare the Repository Level 2 compliant which is not the case.\n\nFailing Level 2 test cases of a Level 1 repository do *not* have an effect on its Level 1 compliance.",
            "date": "2006-08-10T14:02:50.000+0000",
            "id": 1
        },
        {
            "author": "Julian Reschke",
            "body": "Well.\n\nI can't run api.TestAll on a level 1 rep, because the cleanup code tails, and leaves dangling sessions. So - at least over here - the test suite never terminates. Can we agree that at a minimum, that needs to be fixed?\n\nFurthermore, is there a way to run just the level 1 tests? If not, how is a tester supposed to know whether the repository is L1 compliant without having to investigate each and every test failure?\n\n",
            "date": "2006-08-10T14:13:24.000+0000",
            "id": 2
        },
        {
            "author": "Julian Reschke",
            "body": "New proposed patch, not using NotExecutableException.\n\nI'd still like to see an easy way to find out whether a repository supports L1 completely. Did I miss something? If not, should I open a separate issue?\n",
            "date": "2006-08-10T17:09:46.000+0000",
            "id": 3
        },
        {
            "author": "Marcel Reutegger",
            "body": "I agree. This session leak should be fixed. Which means this is indeed a bug not an enhancement.",
            "date": "2006-08-11T08:01:50.000+0000",
            "id": 4
        },
        {
            "author": "Marcel Reutegger",
            "body": "Thank you for the patch. I slightly changed your proposal because I would rather like to call fail() instead of throwing a RepositoryException.\n\nWDYT?\n\nDoes that work for you?",
            "date": "2006-08-11T08:07:12.000+0000",
            "id": 5
        },
        {
            "author": "Marcel Reutegger",
            "body": "> I'd still like to see an easy way to find out whether a repository supports L1 completely.\n\nYes, there is the official TCK, which comes with a test harness that executes the various test cases grouped in the specified compliance levels and optional features. There you can easily see which level 1 tests failed.\n\nSee: \nhttp://jcp.org/aboutJava/communityprocess/final/jsr170/index.html\nand\nhttp://www.day.com/site/en/index/related/downloads/tck_form.html\n\nPlease note that the currently available TCK is based on the test cases present in the jackrabbit branch ri-1.0. While you are the test cases from jackrabbit trunk, which will eventually go into a maintenance release of the TCK at some time.",
            "date": "2006-08-11T08:16:36.000+0000",
            "id": 6
        },
        {
            "author": "Julian Reschke",
            "body": "Marcel, yes that patch works for me. Thanks.\n",
            "date": "2006-08-11T09:19:26.000+0000",
            "id": 7
        },
        {
            "author": "Marcel Reutegger",
            "body": "Applied JCR-540-svn430367.patch.\n\nsvn revision: 430758\n\nThank you for reporting this issue.",
            "date": "2006-08-11T12:33:21.000+0000",
            "id": 8
        }
    ],
    "component": "jackrabbit-jcr-tests",
    "description": "If a test case indicates that it's not read-only, org.apache.jackrabbit.test.AbstractJCRTest tries to cleanup the test root in the setUp method. This will cause the test case to fail, because a Level 1 repository will throw an UnsupportedOperationException here.\n\nProposal: before trying the cleanup, check for L2 functionality and throw a NotExecutableException otherwise:\n\n            if (! isSupported(Repository.LEVEL_2_SUPPORTED)) {\n              cleanUp();\n              String msg = \"Test case requires level 2 functionality\";\n              throw new NotExecutableException(msg);\n            }\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-540",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "AbstractJCRTest fails on level 1 repositories",
    "systemSpecification": true,
    "version": ""
}