{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Attached an initial draft of the required changes.\n\nAll the shared constants are moved to jackrabbit-webdav.\n\nFor now the patch simply copies the relevant code in the shared classes to o.a.j.spi2dav.server. More work is needed to avoid the duplication.",
            "date": "2010-01-07T11:39:08.769+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "I solved part of this issue by explicitly excluding the troublesome transitive dependencies in revision 896870.",
            "date": "2010-01-07T13:05:58.278+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "i don't agree with the proposed changes. the jackrabbit-webdav project must not have any notion of JCR as\nit is designed to work with any kind of webdav implementation. the constants invented for the JCR remoting over\nwebdav do not belong there from my point of view.\n\n> For now the patch simply copies the relevant code in the shared classes to o.a.j.spi2dav.server\n\nthen i would rather copy the constants to spi2dav.",
            "date": "2010-01-07T13:07:08.499+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "> the jackrabbit-webdav project must not have any notion of JCR\n\nWhat about existing classes like o.a.j.webdav.observation.ObservationConstants?\n\nI definitely agree that we don't want to introduce a JCR API dependency on jackrabbit-webdav. But just like we include support for other WebDAV extensions like DASL or the extra properties used by Microsoft, can we not also include similar support for the JCR extensions?",
            "date": "2010-01-07T13:26:57.176+0000",
            "id": 3
        },
        {
            "author": "angela",
            "body": "> What about existing classes like o.a.j.webdav.observation.ObservationConstants? \n\nas far as i know there is no JCR constant in there... it's a custom extension of webdav that isn't defined\nby either of the dav-rfcs.\n\nIf you want to move the jcr-remoting specific stuff to the webdav project they should at least be\nrenamed from JCR-something to Jackrabbit-something or Day-something and put into a different *Constants \nclass in order to make sure that those constants have nothing to do with standard webdav.\n\ni really don't want JCR to appear in the dav library... it's hard enough to explain why jackrabbit, which is known\nas reference implementation for JCR, provides it's own webdav library. we definitely should avoid anything that\nintroduces additional confusions. no jcr strings within the dav-library...\n\n\n",
            "date": "2010-01-07T13:39:01.444+0000",
            "id": 4
        },
        {
            "author": "angela",
            "body": "why not moving the shared code to jcr-commons? actually i already happen to put code shared davex and the server into the commons \npackage before... it would have been natural to move the rest as well. i can take care of that.\n",
            "date": "2010-01-19T12:46:23.267+0000",
            "id": 5
        }
    ],
    "component": "jackrabbit-jcr-server, jackrabbit-spi2dav, jackrabbit-webdav",
    "description": "Currently the spi2dav component has a dependency on the jcr-server component, which is troublesome due to the extra transitive dependencies and which strictly speaking should not be necessary from an architectural point of view.\n\nThe dependency exists mostly for sharing a number of JCR-specific WebDAV constants. I'd like to push those constants down to jackrabbit-webdav as they are essentially just shared strings and as jackrabbit-webdav already contains a number of constants used by JCR extensions.\n\nIn addition to constant values, code in the following classes is shared between jcr-server and spi2dav: JcrValueType, NamespacesProperty, NodeTypesProperty, SearchResultProperty, SubscriptionImpl, ValuesProperty. The shared code in JcrValueType and SubscriptionImpl is mostly just about mapping constant value mappings and could fairly easily be moved to jackrabbit-webdav. The Property classes are a but trickier, but it looks like it would be possible to split the code to separate server- and client-side classes for jcr-server and spi2dav.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-2453",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Break the spi2dav dependency to jcr-server",
    "systemSpecification": true,
    "version": ""
}