{
    "comments": [
        {
            "author": "Martijn Hendriks",
            "body": "This issue has the same cause as JCR-1309, which has been fixed in 1.5.0. As of that version you can configure the OracleDatabaseJournal using a JNDI resource (see details at JCR-1309).",
            "date": "2009-03-09T12:21:04.443+0000",
            "id": 0
        }
    ],
    "component": "clustering, jackrabbit-core",
    "description": "Database journal works fine on oracle when using the OracleDatabaseJournal implementation; but when you need to use a jndi datasource you actually need to use org.apache.jackrabbit.core.journal.JNDIDatabaseJournal which doesn't work fine with the \"oracle\" schema.\n\nWith the following configuration:\n<Cluster id=\"node1\" syncDelay=\"10\">\n    <Journal class=\"org.apache.jackrabbit.core.journal.JNDIDatabaseJournal\">\n      <param name=\"schema\" value=\"oracle\" />\n\njackrabbit crashes at startup with a not well defined sql error. Investigating on the problem I see that the \"oracle.ddl\" file contains a \"tablespace\" variable that is replaced only by the OracleDatabaseJournal implementation.\n\nAs a workaround users can create a different ddl without a tablespace variable, but this should probably work better out of the box.\n\nWDYT about one of the following solutions?\n- make the base DatabaseJournal implementation support jndi datasource just like PersistenceManagers do (without a specific configuration property but specifying a jndi location in the url property)\n- move the replacement of the tablespace variable (and maybe: add a generic replacement of *any* parameter found in the databaseJournal configuration) to the main DatabaseJournal implementation. This could be handy and it will make the OracleDatabaseJournal extension useless, but I see that at the moment there can be a problem with the MsSql implementation, since it adds \"on \" to the tablespace name only when it's not set to an empty string.\n\n\n\n\n\n",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1693",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "JNDIDatabaseJournal doesn't work with \"oracle\" schema (or: unable to use OracleDatabaseJournal with a jndi datasource)",
    "systemSpecification": true,
    "version": "core 1.4.5"
}