{
    "comments": [
        {
            "author": "angela",
            "body": "sorry, i can't follow you. which servlet are you using?\nhow do you copy across workspaces?\n\nnote, that with jcr-server Workspace.copy is not yet implemented (and as far as i know throws an exception).\nand the simple server on the other hand doesn't even attempt to implement a workspace copy (only one workspace is exposed).\n\nthanks for posting additional info.\nangela",
            "date": "2007-03-28T14:51:53.735+0000",
            "id": 0
        },
        {
            "author": "Alexandre Costa Martins",
            "body": "angela,\n\nI´m using a webdav application that come with jackrabbit. \nThe steps are:\n\n* Create 2 workspaces\n* Put files using webdav into a fisrt workspace\n* Using Windows View (My Network places), copy one file (CTRL-C) and open the other workspace (windows interface) and paste (CTRL-V)\n",
            "date": "2007-03-28T15:19:40.556+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "well, i guess you are using the 'SimpleWebdavServlet'.\nthere, i never tried to copy resources between 2 workspaces.... but it shouldn't be a big thing to add a check to the DavResourceImpl making sure, that copy (and move) between workspace will be detected (and forbidden).\n\nregards\nangela",
            "date": "2007-03-28T16:26:27.172+0000",
            "id": 2
        },
        {
            "author": "angela",
            "body": "Fixed as suggested: i added a check with copy and move that makes sure, that src and destination resource belong to the same workspace. if that is not the case the operation fails.\n\nrev. 523640  \n\nbtw:\ni couldn't reproduce the behaviour described (resource then gets deleted at the source).\nhowever, what i found was:\n\n- without the additional check the copy already failed with 'conflict' \n- windows dav client doesn't stop the copy then but adds some additional PROPFIND calls and asks \n  whether i want to replace the existing resource.\n- in case of 'no' the copy operation is aborted.... in case of 'yes' the COPY operation again results in \n  conflict and finally tries to COPY forever.",
            "date": "2007-03-29T09:17:09.385+0000",
            "id": 3
        }
    ],
    "component": "jackrabbit-webdav",
    "description": "When i make a copy of files from one workspace to other (CTRL-C -> CTRL-V). The file isnt copied, but the original file is deleted.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-824",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Problems with File Copy using WebDAV",
    "systemSpecification": true,
    "version": "1.1, 1.1.1, 1.2.1, 1.2.2, 1.2.3"
}