{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Attached a proposed patch. I'll commit the changes in a few days unless anyone objects.",
            "date": "2007-10-20T21:25:14.892+0000",
            "id": 0
        },
        {
            "author": "angela",
            "body": "hi jukka\n\nwhile working on JCR-1169 i was not sure about the status of the classes in the org.apache.jackrabbit.commons package, because they were not used anywere. therefore i decided not to touch them.\n\nhowever, if you would like to make jackrabbit-core and jcr2spi use them, i would suggest to move them out of the jcr-commons project as well and adjust them in order to get rid of their usage of QName and the other deprecated classes.\n\nwhat do you think?\n\n",
            "date": "2007-10-22T14:11:54.910+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Angela:\n> however, if you would like to make jackrabbit-core and jcr2spi use them, i would suggest to move them\n> out of the jcr-commons project as well and adjust them in order to get rid of their usage of QName and\n> the other deprecated classes.\n\nThe classes in org.apache.jackrabbit.commons use the (now deprecated) QName class for a few namespace constants. In fact I just dropped the dependency by copying the jcr and mix URI string constants to o.a.j.commons.AbstractNode in revision 587120.\n\nThe classes are intimately related to the JCR API boundary and they only deal with prefixed names in string format. There are no dependencies to SPI concepts. Thus I'd rather keep the classes in jcr-commons instead of spi-commons. Alternatively we could (or perhaps should!) move them over to jcr2spi, but I'm not sure if we're yet ready to introduce jcr2spi as a dependency to jackrabbit-core.",
            "date": "2007-10-22T15:05:23.706+0000",
            "id": 2
        },
        {
            "author": "angela",
            "body": "> The classes in org.apache.jackrabbit.commons use the (now deprecated) QName class for a \n> few namespace constants. In fact I just dropped the dependency by copying the jcr and mix URI \n> string constants to o.a.j.commons.AbstractNode in revision 587120. \n\nok. then i'm fine :) \ni just wanted to make sure, we get rid of the QName and don't introduce a dependency to\nspi/spi-commons in the jcr-commons... that's all.",
            "date": "2007-10-22T15:28:23.447+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Resolved in a sequence of commits (see the Subversion Commits tab).",
            "date": "2007-12-19T12:56:50.144+0000",
            "id": 4
        }
    ],
    "component": "jackrabbit-core, jackrabbit-jcr2spi",
    "description": "As part of JCR-742 I've implemented a number of generic JCR base classes and adapters in org.apache.jackrabbit.commons. These classes are based on existing code in jackrabbit-core.\n\nTo encourage code reuse across jackrabbit-core and jcr2spi, I'd like to make both components use these generic base classes.\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1181",
    "issuetypeClassified": "REFACTORING",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Use common base classes in jackrabbit-core and jcr2spi",
    "systemSpecification": true,
    "version": ""
}