{
    "comments": [
        {
            "author": "Felix Meschberger",
            "body": "Edgar reported this presumably due to his testing Sling and not being able to get the DefaultContent mapping for the root node. It seems that this method looks after the strategy of the node type and then after a class descriptor given the node type or dscriminator accordingly.\n\nIn the latter case, an exception is thrown if no discriminator property is available, while it former case a NullPointerException might be thrown if there is no class descriptor for the node type.\n\nAssuming from the method that I give the actual class I expect the returned object to be a member of it is somewhat strange to have another class resolution step. Still, this step probably makes sense if the mapper would be able to resolve to a more appropriate class mapping, yet this mapping should actually be assignment compatible to the class given as a parameter, otherwise unexpected behaviour may occurr.\n\nI suggest to fix this method as follows: try to resolve a class descriptor from the discriminator if available or from the node type. If such a descriptor can be found and the described class is the same or extends the request class, the new descriptor is taken. Otherwise the descriptor for the requested class is taken.",
            "date": "2007-09-21T15:30:14.755+0000",
            "id": 0
        },
        {
            "author": "Felix Meschberger",
            "body": "Patch implemented the proposed behaviour",
            "date": "2007-09-21T15:30:54.310+0000",
            "id": 1
        },
        {
            "author": "Christophe Lombart",
            "body": "Patch applied. I suggest to add more unit tests on ocm.getObject(class, string) before closing this issue.",
            "date": "2007-09-24T20:47:57.703+0000",
            "id": 2
        }
    ],
    "component": "jackrabbit-ocm",
    "description": "ObjectConverterImpl#getObject(Session session, Class clazz, String path) should validate whether there's a suitable mapping in order to throw a more descriptive exception as ObjectConverterImpl#getObject(Session session, String path) does.\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-1142",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "ocm fails with NPE when a ClassDescriptor isn't found",
    "systemSpecification": true,
    "version": ""
}