{
    "comments": [
        {
            "author": "Michael Dürig",
            "body": "This patch implements a proof of concept fix for this issue:\n\n- implements javax.jcr.RepositoryFactory\n- configuration is passed as map instead of URLs since (1): jsr 283 compliant and (2): parts of the configuration settings need to go to jcr2spi and parts need to be passed on to spi. This is kind of troublesome using URLs. The URL scheme can still be implemented on top of this for the more common use cases though. \n- With this patch jcr2spi could be cleanly OSGi bundled by only exporting org.apache.jackrabbit.jcr2spi.factory (partial fix for JCR-1991)\n- With this patch jackrabbit-jcr-client could be redesigned on top of Jcr2spiRepositoryFactory which would remove the compile time dependencies of jcr-client to the various spi implementations (improvement to JCR-2041).\n\n",
            "date": "2009-09-16T12:19:25.777+0000",
            "id": 0
        },
        {
            "author": "Michael Dürig",
            "body": "Here's the patch mentioned in my previous comment",
            "date": "2009-09-16T12:20:48.024+0000",
            "id": 1
        },
        {
            "author": "Michael Dürig",
            "body": "Fixed in revision: 816402",
            "date": "2009-09-17T22:53:26.964+0000",
            "id": 2
        }
    ],
    "component": "jackrabbit-jcr2spi, jackrabbit-spi",
    "description": "There should be a RepositoryFactory implementation in jcr2spi that also covers acquiring the underlying RepositoryService.\n\nFor this purpose I suggest to create:\n-  a RepositoryServiceFactory in jackrabbit-spi, which encapsulates the spi implementation specifc instantiation of the RepositoryService. the factory probably just needs a single method that takes a parameters map.\n- a RepositoryFactory implementation in jcr2spi, which works with a URI that contains all required information to connect/acquired the RepositoryService.\n\nTo use jcr2spi/spi2jcr/jackrabbit-core:\n- jcr+file://path/to/repository/home?config=repository.xml\n\nTo use jcr2spi/spi2dav:\n- jcr+dav://localhost:8080/server/repository/?br=4\n\nTo use jcr2spi/spi2davex:\n- jcr+davex://localhost:8080/server/repository/\n\nAn implementation of RepositoryServiceFactory must check the scheme and decide if it can handle it and create a RepositoryService instance with it, otherwise it must return null. This means there would be a single name for the connect URI for all RepositoryServiceFactory implementations.\n\n",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "JCR-2042",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "RepositoryFactory implementation for jcr2spi",
    "systemSpecification": true,
    "version": "2.0"
}