{
    "comments": [
        {
            "author": "angela",
            "body": "changed property definition in built-in nodetypes and adjusted the corresponding createValue/setProperty calls to user PropertyType.NAME.",
            "date": "2009-01-21T09:58:19.114+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Changing this to an improvement issue as the original implementation was in line with previous spec text (and I don't think we should merge this to 1.5).\n\nBTW, do you think this should be noted in the 1.6 release notes for people who are already trying out the new security code? I'm not sure how big an impact the changed property type will cause.",
            "date": "2009-02-11T13:31:26.809+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "> I don't think we should merge this to 1.5\n\nno, rather not.\n\n> BTW, do you think this should be noted in the 1.6 release notes for \n> people who are already trying out the new security code? I'm not sure \n> how big an impact the changed property type will cause.\n\nbig. that's why i scheduled it for 2.0.0.\n\nbut after all the 283 implementation is still work in progress and Issue #JCR-1588 has not been closed up to now. unless the spec is finalized there may be any kind of changes that break backwards compability.\n\nlisting in in the release notes may still be a good idea.",
            "date": "2009-02-12T14:01:38.579+0000",
            "id": 2
        }
    ],
    "component": "jackrabbit-core, security",
    "description": "the content representation of jcr privileges should reflect that fact that privilege names changed from simple string to JCR name.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1944",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Privilege content representation should be of property type NAME",
    "systemSpecification": true,
    "version": "1.5"
}