{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Thanks for raising the issue! You are absolutely correct, the available documentation is not very beginner-friendly. I'll take a look at the issues you raised.\n\nAbout having a help forum on the web site: We are currently using on the jackrabbit-dev mailing list as the forum for asking questions as well as discussing Jackrabbit issues. Would there be interest in for example setting up a part of the Jackrabbit wiki as an easier-to-approach Q/A forum for new users?\n",
            "date": "2006-01-05T18:17:48.000+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Made the following improvements:\n\n- Updated and clarified the First Hops document\n- Created a questions and answers page on the Jackrabbit wiki\n- Improved the \"Getting Started\" section of the Jackrabbit documentation page\n\nIt's not much, but hopefully better than nothing. :-)\n\nPS. If you (or anyone else) have ideas of good examples to be included on the Jackrabbit web site, please file a Jira issue for those!\n",
            "date": "2006-01-06T10:00:23.000+0000",
            "id": 1
        }
    ],
    "component": "docs",
    "description": "Hi everyone,\n\nI'm one of these beginners trying to make their way in Jackrabbit and content repositories universe.\n\nBesides the fact that there exist but very few examples on Jackrabbit use, all of them, including the official web site of Jackrabbit miss few details, simple though essential, for beginners.\n\nMy first point is the following: once Jackrabbit source is checked out and built, time to test it using simple examples. But, where to put the example directory from the beginning. How to run it (maven java:compile....) ?\n\nA second point is the fact that there is no help forum on the Jackrabbit web site.\n\n A third point, taking my case as an example, the example would just not create a new workspace configuration.\nAnd many other troubleshoots - I repeat - basic but essential, that could avoid dozens of wasted hours and discouragment, if just mentioned on the website.\n\nHere it is my wish :-) for the best of Jackrabbit ;-) I hope!\nRegards,\nCelina",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-296",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "More details for beginners",
    "systemSpecification": false,
    "version": ""
}