{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Fixed in revision 1085038 by adding a special \"TextExtractionError\" token to the index for any binary property for which text extraction failed. Also reduced the severity of log messages about extraction failures.",
            "date": "2011-03-24T17:13:04.665+0000",
            "id": 0
        },
        {
            "author": "Paco Avila",
            "body": "So if I search for \"TextExtractionError\" should return all the binary properties which failed to be indexed?",
            "date": "2011-03-24T17:34:51.475+0000",
            "id": 1
        },
        {
            "author": "Jukka Zitting",
            "body": "Exactly.",
            "date": "2011-03-24T17:38:12.186+0000",
            "id": 2
        },
        {
            "author": "Paco Avila",
            "body": "Great, I was missing this feature for years! At least, now I can see which document were not indexed. Is also possible to make a relation between the document and the text extraction error?",
            "date": "2011-03-24T17:44:18.427+0000",
            "id": 3
        },
        {
            "author": "Jukka Zitting",
            "body": "Yes, to the search index such documents look like simple text documents that contain just the string \"TextExtractionError\". You can query for that token and include any other constraints (path, etc.) just like when searching for normal documents.\n\nPS. In revision 1085050 I excluded extraction errors caused by linkage problems from being reported. They are caused by required extraction libraries not being present, which is a configuration/deployment choice instead of any inherent problems with the documents being parsed.",
            "date": "2011-03-24T17:52:55.557+0000",
            "id": 4
        }
    ],
    "component": "indexing, jackrabbit-core",
    "description": "Full text indexing of a binary document can fail for various reasons. Currently we just log a generic error message in such cases, which makes it difficult for the user to locate such problems for review and reindexing. We should improve this by making the logs more informative or by adding some other mechanism for locating troublesome documents.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-2873",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Add a way to locate full text extraction problems",
    "systemSpecification": true,
    "version": ""
}