{
    "comments": [
        {
            "author": "angela",
            "body": "Done.\n\nThe method that sets and removes properties now returns a multistatus response object which contains the individiual property states.\nIn addition modifyed the PROPPATCH so it now always returns a multistatus response (even if the resource is locked), as it is required by the RFC (as far as i understood).\n\nNOTE: with later change the nonowner-modify PROPATCH test of litmus 0.10.3 runs into an known bug. If we experience problem with clients as will i will remove the code that catches the DavExceptions and packs them into the mulitstatus (see also note in the code).",
            "date": "2005-09-15T18:18:12.000+0000",
            "id": 0
        },
        {
            "author": "angela",
            "body": "hi brian\n\nby end of this week (or latest beginning next week).\n\nkind regards\nangela",
            "date": "2005-09-28T14:53:36.000+0000",
            "id": 1
        }
    ],
    "component": "",
    "description": "Rob Owen commented on JCR-175:\n--------------------------------------------------\n\ndoPropPatch in AbstractWebdavServlet still needs to send back a multistatus (207) response even in the successful case.\n\nI didn't see a way to collect the success/failure status for each property, but instead created a multistatus response and added a propstat (SC_OK) for each of the properties in the setProperties and removeProperties. This allowed a WebDAV client, which expected a multistatus response from PROPPATCH, to work correctly with jcr-server. In the more general case the actual property status code will need to be used .",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-193",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "MultiStatus response for PROPPATCH (copied from JCR-175)",
    "systemSpecification": false,
    "version": ""
}