{
    "comments": [
        {
            "author": "Roy T. Fielding",
            "body": "Done.\n",
            "date": "2006-03-24T17:30:39.000+0000",
            "id": 0
        },
        {
            "author": "Roy T. Fielding",
            "body": "The ASF board just changed the license header text (added a sentence).\n\n         RESOLVED, that the NOTICE file shall begin with the following\n         text, suitably modified to reflect the product name\n         and year(s) of distribution of the current and past releases:\n\n           Apache [PRODUCT_NAME]\n           Copyright [yyyy] The Apache Software Foundation\n\n           This product includes software developed at\n           The Apache Software Foundation (http://www.apache.org/).\n           \n         and be it further\n\n         RESOLVED, that files licensed to The Apache Software\n         Foundation shall be labeled with the following notice:\n\n           Licensed to the Apache Software Foundation (ASF) under one\n           or more contributor license agreements.  See the NOTICE file\n           distributed with this work for additional information\n           regarding copyright ownership.  The ASF licenses this file\n           to you under the Apache License, Version 2.0 (the\n           \"License\"); you may not use this file except in compliance\n           with the License.  You may obtain a copy of the License at\n\n             http://www.apache.org/licenses/LICENSE-2.0\n\n           Unless required by applicable law or agreed to in writing,\n           software distributed under the License is distributed on an\n           \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY\n           KIND, either express or implied.  See the License for the\n           specific language governing permissions and limitations\n           under the License.\n \n         and be it further\n\n         RESOLVED, that for the case of works that have not been\n         directly submitted by the copyright owners to the Foundation\n         for development, the associated copyright notices for the work\n         shall not be moved, removed, or modified. \n\nI'll start working on the changes.\n",
            "date": "2006-05-27T06:19:27.000+0000",
            "id": 1
        },
        {
            "author": "Roy T. Fielding",
            "body": "I have done trunk.  Should I do the jackrabbit-1.0 branch as well, or wait\nuntil after the 1.0.1 release?\n",
            "date": "2006-05-27T09:07:34.000+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "The 1.0 branch is OK for changes now, though I don't plan to make any more releases from that branch.",
            "date": "2006-05-31T17:35:42.000+0000",
            "id": 3
        },
        {
            "author": "Roy T. Fielding",
            "body": "No need to update the old branch.\n",
            "date": "2006-06-01T08:21:45.000+0000",
            "id": 4
        }
    ],
    "component": "",
    "description": "We need to replace all of the license headers with a new template\nthat replaces the Copyright and license lines with\n\n---BEGIN PROPOSED SOURCE FILE HEADER---\n  Licensed to the Apache Software Foundation (ASF) under one or more\n  contributor license agreements.  The ASF licenses this file to You\n  under the Apache License, Version 2.0 (the \"License\"); you may not\n  use this file except in compliance with the License.\n  You may obtain a copy of the License at\n\n      http://www.apache.org/licenses/LICENSE-2.0\n\n  Unless required by applicable law or agreed to in writing, software\n  distributed under the License is distributed on an \"AS IS\" BASIS,\n  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n  See the License for the specific language governing permissions and\n  limitations under the License.\n---END PROPOSED SOURCE FILE HEADER---\n\nThe copyright line is being removed from files due to legal advice from ASF attorneys.\nIt is replaced with a statement that the copyright owners have licensed it to the ASF.\n",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-356",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "OTHER",
    "priority": "Blocker",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Replace license headers with new policy text",
    "systemSpecification": true,
    "version": "1.0.1, 1.1"
}