{
    "comments": [
        {
            "author": "Marcel Reutegger",
            "body": "Fixed in revision: 685139",
            "date": "2008-08-12T13:05:08.064+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Merging this to 1.4 seems non-trivial, so I'm leaving this to 1.5.",
            "date": "2009-01-22T15:57:54.625+0000",
            "id": 1
        }
    ],
    "component": "jackrabbit-core",
    "description": "ackrabbit version is 1.4 (jackrabbit-core - 1.4.5).\nI use searches with result limit and offset but it is working some wrong for my case.\nLets suppose the total of nodes that will return with the search:\n\nNAME      - GRANTACCESS -   OFFSET\nnode1     -     true                    - 0\nnode2     -     false                  -  1\nnode3     -     true                    - 2\nnode4     -     true                    - 3\nnode5     -     false                  -  4\n\nMy page must have 2 records, so first I do a count for the search and get size of 3 records (after filtered by my security class invoked automatically by jackrabbit), so I have 2 pages to show to the user. The first page must return 2 records, of course, and the second must return 1 record.\n\nIn the first search I do set:\nQueryImp.setOffset(0);\nQueryImpl.setLimit(2);\n\nSo, I get the nodes 1 and 3, thats correct.\n\nIn the second same search (for second page), I do set:\nQueryImp.setOffset(2);\nQueryImpl.setLimit(2);\n\nThis way I pretend to get two records, starting from the record nro 3, which would be only the node4.\nBut, the result I got is node3 (again) and node4, because the offset worked not according to the grantacess (provided by the security class), but according to the sequence of the raw result.\n\nThis offset have to start in the correct position, counting only the granted nodes returned by the security class.\nHope this make sense for you.\n\nThanks.\nHelio.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1714",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "QueryImpl result offSet must be considered after security class grant the item.",
    "systemSpecification": true,
    "version": "core 1.4.5"
}