{
    "comments": [
        {
            "author": "Jukka Zitting",
            "body": "Angela, what's the current status in spi2dav? Should we target at releasing it in Jackrabbit 1.6?",
            "date": "2008-11-24T14:51:55.980+0000",
            "id": 0
        },
        {
            "author": "angela",
            "body": "> Angela, what's the current status in spi2dav? \n\nthere are a couple of things i'd like to be addressed before we promote the spi2dav sandbox:\n\n- rework the URIResolver (see TODOs in the code)\n- setup automated test execution\n- do some more testing\n\n- add RepositoryFactory.\n  but that is an issue for all spi implementations.\n  basically, i feel that the RepositoryFactory should not reside within the\n  same project. the spi-impls should not have a dependency to jcr2spi\n  (except for testing), should it?\n\n> Should we target at releasing it in Jackrabbit 1.6? \n\n- i would be nice if we managed to do that for 1.6 but i can't promise that i have the time.\n",
            "date": "2008-11-25T07:50:37.692+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "further more (not related to the code base):\n\ni would like to see at least another person being familiar with the code base and thus able\nto fix issues or implement improvements. (see above regarding time limitation).",
            "date": "2008-11-25T08:16:15.610+0000",
            "id": 2
        },
        {
            "author": "Greg Klebus",
            "body": "+1\n\nNB during a chat Angela pointed out that with the basic spi2dav we should also promote the recently-contributed spi2davex extended remoting (see JCR-1958).",
            "date": "2009-02-20T13:51:47.213+0000",
            "id": 3
        },
        {
            "author": "angela",
            "body": "as announced on the dev list: i will go ahead and promoting the spi2dav and spi2davex sandbox projects to the jackrabbit top level even if there are still open todos.\n\nin a first step this includes:\n\n- moving spi implementations from jackrabbit/sandbox to jackrabbit/trunk/jackrabbit-spi2dav\n- adding new component to JIRA and moving open issues.\n\nas soon as we have the component released:\n\n- adjust jackrabbit webpage and replace references to spi2dav sandbox project by links to the\n  released project.\n\nas time and resources permit:\n\n- address the open issues\n- setup automated test execution\n\nregarding the open RepositoryFactory issue:\n\n- as this applies to all spi implementations, i would suggest to create a separate module\n  for that. proposed name: jackrabbit-jcr-client. i will put that into a separate issue. (see JCR-2041)",
            "date": "2009-03-24T10:02:59.670+0000",
            "id": 4
        },
        {
            "author": "Ken Yue",
            "body": "Angela,\n\nFirst of all, thank you very much for doing this.  I really appreciate it.\n\nPlease tell me the issue number that tracks the RepositoryFactory issue. \n  Thanks again.\n\nKen\n\n\n",
            "date": "2009-03-24T16:16:25.957+0000",
            "id": 5
        }
    ],
    "component": "sandbox",
    "description": "Remoting JSR170 calls requires obviously both server and client sides.  The server is available for download, as JCR WebDAV Server in both http://www.apache.org/dyn/closer.cgi/jackrabbit/binaries/jackrabbit-jcr-server-1.4.1.jar and http://www.apache.org/dyn/closer.cgi/jackrabbit/binaries/jackrabbit-webapp-1.4.war.  However, the client is just casually mentioned as \"can be found in the Jackrabbit sandbox.\"  This issue is to request that the SPI2DAV client code (especially a ResponseFactory that returns a JCR2SPI Repository implementation) be available for download as well.\n\nFurthermore, please make the RepositoryFactory implements javax.naming.spi.ObjectFactory so that only configuration (vs. Java coding) is needed in order to use it.  This is how org.apache.jackrabbit.rmi.client.ClientRepositoryFactory works.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-1877",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "RFE",
    "priority": "Major",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "the spi2dav sandbox project should be put into a common release cycle",
    "systemSpecification": true,
    "version": ""
}