{
    "comments": [
        {
            "author": "Michael Dürig",
            "body": "There is already org.apache.jackrabbit.commons.flat.FilterIterator which might get reused for this",
            "date": "2010-08-20T15:33:52.884+0000",
            "id": 0
        },
        {
            "author": "Jukka Zitting",
            "body": "Thanks. I'm looking for something that implements also RangeIterator and allows for more than just a single element to be pre-fetched so that the getSize() method could return an accurate result for short iterators even before the client application has consumed the iterator.",
            "date": "2010-08-20T15:45:19.380+0000",
            "id": 1
        },
        {
            "author": "angela",
            "body": "at revision 987435 i added jackrabbit/trunk/jackrabbit-jcr-commons/src/main/java/org/apache/jackrabbit/commons/iterator/FilteringNodeIterator.java  \nthat takes a NodeIterator and a Predicate in the constructor... that could be a starting point... i just needed it for nodes, that's why i didn't\npay special attention to the other rangeiterator types.\n\n",
            "date": "2010-08-20T15:58:47.085+0000",
            "id": 2
        },
        {
            "author": "Jukka Zitting",
            "body": "I added a new FilteredRangeIterator class in revision 987567 based on the previous classes mentioned above.\n\nBoth of the other classes serve a slightly different purpose than the new one, so merging all the code into a single class may be a bit difficult. For now I think we can live with all three classes.",
            "date": "2010-08-20T16:52:59.433+0000",
            "id": 3
        },
        {
            "author": "Carsten Ziegeler",
            "body": "With revision 988172 the RowIteratorAdapter class changed it's signature which causes IllegalAccessErrors for all code which has \nbeen compiled with the older version.\nThe old version used a constructor with a RangeIterator which is now not available anymore",
            "date": "2010-08-25T09:54:18.999+0000",
            "id": 4
        },
        {
            "author": "Jukka Zitting",
            "body": "Good point, thanks! I reverted the troublesome changes in revision 988970. The constructor changes I made earlier were only backwards compatible after recompiling downstream sources.\n\nPerhaps we should add some automatic binary backwards compatibility checker as a part of the build of client-visible components like jcr-commons.",
            "date": "2010-08-25T10:16:41.094+0000",
            "id": 5
        }
    ],
    "component": "jackrabbit-jcr-commons",
    "description": "It would be useful to have a FilteredRangeIterator utility class that can be used to apply arbitrary filters on other RangeIterators.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "JCR-2722",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "IMPROVEMENT",
    "priority": "Minor",
    "product": "JACKRABBIT",
    "project": "JACKRABBIT",
    "summary": "Add a filtered RangeIterator",
    "systemSpecification": true,
    "version": ""
}