{
    "comments": [
        {
            "author": "igor@mir2.org",
            "body": "It seems the regression is caused by a JDK bug on Win98 when it returns for\nRhino classes loaded from CLASSPATH variable a class loader that can only load\nclasses from Rhino jar or system locations and can not find classes from other\ncomponents of CLASSPATH. On the other hand a class loader returned by\nThread.getContextClassLoader() is able to find classes from all CLASSPATH\ncomponents and since Rhino 1.5R3 uses that for class loading, the problem only\nappeared in 1.5R4.\n",
            "date": "20030305T10:41:40",
            "id": 0
        },
        {
            "author": "igor@mir2.org",
            "body": "Created attachment 116297\nUse Thread.getContextClassLoader as the last resort to find classes\n\nThe patch does not restore 1.5R3 since it used Thread.getContextClassLoader()\ninitially and only then it tried a class loader for Rhino classes leading to\nvarious problems. The patch instead uses Thread.getContextClassLoader() as a\nlast attempt to find the required class thus preserving child-parent class\nloader semantics between generated and Rhino classes.",
            "date": "20030305T10:50:00",
            "id": 1
        },
        {
            "author": "igor@mir2.org",
            "body": "I commited the patch, for verification I asked Anreas Rozek to check it, let see\nwhat he will report.",
            "date": "20030306T09:55:51",
            "id": 2
        },
        {
            "author": "pschwartau@meer.net",
            "body": "Can we mark this one Verified? Have we heard from Anreas?",
            "date": "20030314T03:04:18",
            "id": 3
        },
        {
            "author": "igor@mir2.org",
            "body": "Marking as verified assuming that silence of Anreas Rozek means it is OK for him...",
            "date": "20030316T14:00:00",
            "id": 4
        },
        {
            "author": "igor@mir2.org",
            "body": "Targeting as resolved against 1.5R4.1",
            "date": "20040213T11:48:40",
            "id": 5
        }
    ],
    "component": "Core",
    "description": "New class loader code for generated classes in 1.5R4 to fix bug 166530 causes a\nregressions when used with some JDK 1.4 releases as was reported by Anreas Rozek:\n\nAfter having \"installed\" Rhino 1.5r4 on my system, many of my old\nRhino scripts fail to run any longer. Reason: Java class lookup seems\nto be broken!\n\nHere are some facts:\n - Java classes and interfaces within JAR files or directory trees\n   (within my \"ClassPath\") are no longer found - although they are\n   definitely present\n - unpacking JAR files (or moving directory tree contents) into a\n   folder such as $JavaHome/jre/lib/classes solves the problem -\n   however, I would even have to unpack the Rhino library (js.jar) \n - going back to Rhino 1.5r3 immediately solves the problem as well\n - I'm currently running Sun JDK 1.4.0_03 - but the problem exists\n   as well under 1.4.0_02, 1.4.0_01 and 1.3.?_06 (don't remember the\n   version number) I already had a similar problem with \"BeanShell\"\n   (www.beanshell.org) and JDK 1.4.1 a few weeks ago - I then deci-\n   ded to go back to 1.4.0_03 as this solved most of the problems.\n   Later, a colleague ran into similar class loading problems and\n   had to go back to 1.4.0 as well...(very strange)\n - I'm running Win98SE, she was running WinXP Professional",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "196017",
    "issuetypeClassified": "BUG",
    "issuetypeTracker": "BUG",
    "priority": "-- normal",
    "product": "Rhino",
    "project": "RHINO",
    "summary": "1.5R4 regression: script can not find classes on some versions of JDK",
    "systemSpecification": true,
    "version": "other"
}