{
    "comments": [
        {
            "author": "igor@mir2.org",
            "body": "CC Brendan and Gervase as well:\n\nNo matter what would be the outcome of the discussion about APL and other\nlicense schemas, I think at least MPL/LGPL/GPL should be put in place. \n\nFor practical matters I would suggest to finish this work first as gven the\nprevious experience any too generic question would rsult in nothing done.\n\nSo the question is: who should authorise this?",
            "date": "20040311T23:23:53",
            "id": 0
        },
        {
            "author": "brendan@mozilla.org",
            "body": "We're thinking of relicensing under an MIT-X style license, which means there is\nno point in multi-licensing under copyleft licenses.  It's a break from\nMozilla's licensing policy to date, but one that we would like to make for\nRhino.  So I don't see any point in fixing this bug as summarized.  Here is a\ncounterproposal:\n\nIgor, from the emails with Cocoon folks, it sounds like you have no objection to\nan MIT-X-style license.  The ASL (not APL, my typo, sorry) is one such and it\nfits the bill for Apache projects using Rhino.  I'll follow up with Mitchell to\nmake sure it's the right license, and wait for agreement here.\n\nThen, we need to get agreement from all the copyright holders, as discussed with\nthe cocoon folks.  This is work.\n\nOnce everyone is agreed, we can morph this bug, make a special case in Mozilla's\nlicensing policy documents, and get on with relicensing.  Should be soon.\n\n/be",
            "date": "20040316T01:16:47",
            "id": 1
        },
        {
            "author": "igor@mir2.org",
            "body": "Changing title to be more generic to reflect recent discussion.",
            "date": "20040316T13:39:55",
            "id": 2
        },
        {
            "author": "igor@mir2.org",
            "body": "Created attachment 144038\nList of Rhino contributors from Steven Noels\n\nFrom Steven Noels email:\n\nOn 12 Mar 2004, at 22:57, Brendan Eich wrote:\n\n> Our CVS logs are open and complete (http://www.mozilla.org/cvs.html).\n>\n> You need to scour the CVS logs, not only for direct checkins, but especially\nalso for people checking in patches on behalf of others who originated those\npatches, but who lacked CVS access.  Gerv (cc'd again) knows about this from\nour experience relicensing the bulk of Mozilla's source code, but I don't know\nhow much time and motivation (if any) he has to help, especially for the Cocoon\ntine of the fork.\n\n\nFolks, before going off to think about administrative procedures (finding real,\ncurrent email addresses, how to officially record consent...), I'd like you to\ndo a brief sanity check of my current email address harvest from the CVS logs.\n\nThe format is a bit funny (it's a dump of a Python list), with the first field\ncontaining the to-be-contacted email address, the second one is the guy who\nactually committed, and then some administrative data (time of commit and\ntouched file). Please check attached file if it makes sense. I did automated\nscanning for email addresses - I hope I catched most if not all. There's a few\nduplicates and false hits in the list as well.\n\nA quick look shows me that about 45 people should be contacted, which still\nseems feasible.\n\nOn the code-side, some small progress has already been made in assembling a\ntask force for recruting JavaScript engine hackers. Batik, another ASF project\nwhich uses Rhino (the official version, that is, not our fork) might be\ninterested in the same relicensing effort as well, since they would now be\nobliged to not include Rhino in their shipping version anymore, and only refer\nto it in their documentation. So even if the code reintegration is a bit slow\nin the beginning, there's an incentive for both the Cocoon and Batik project to\nhave an ASF-shippable, MIT/X-licensed Rhino in the future.\n\nOh, in order to cut down on the recipient list: I'd like to have some main\ncontact on the Mozilla side, and am happy to keep others posted if they want -\njust tell me who and what.",
            "date": "20040316T13:44:24",
            "id": 3
        },
        {
            "author": "igor@mir2.org",
            "body": "(In reply to comment #2)\n> Igor, from the emails with Cocoon folks, it sounds like you have no objection to\n> an MIT-X-style license.  The ASL (not APL, my typo, sorry) is one such and it\n> fits the bill for Apache projects using Rhino.  I'll follow up with Mitchell to\n> make sure it's the right license, and wait for agreement here.\n\nYes, I have no objections and any of my contributions to Rhino can be relicensed\nunder MIT-X-style license. \n\nNow what exactly should it be? ",
            "date": "20040316T13:51:26",
            "id": 4
        },
        {
            "author": "stevenn@apache.org",
            "body": "(In reply to comment #5)\n> (In reply to comment #2)\n> Yes, I have no objections and any of my contributions to Rhino can be relicensed\n> under MIT-X-style license. \n> \n> Now what exactly should it be? \n\nIgor, IIUC Brendan suggest a relicensing to ASL2.0, but wants to check with Mitchel. If he's OK with that, \nI'll proceed with putting up some page where people can check they effectively contributed to Rhino in \nthe past, and post their (dis)agreement - possibly as a comment on this entry. Seems like Bugzilla is an \nappropriate way to record votes.",
            "date": "20040316T14:33:02",
            "id": 5
        },
        {
            "author": "norrisboyd@gmail.com",
            "body": "I looked through the attachment and I know some multiple emails are all due to\nsingle people:\n\nKurt Westerfeld: 'kurt@ManagedObjects.com', 'kurt@managedobjects.com',\n'kurt@mosol.com', 'kurt@westerfeld.com', 'kurt@westerfield.com',\n'kwester@ManagedObjects.com'\n\nNorris Boyd: 'nboyd@atg.com', 'norris@netscape.com'\n\nSteven Lobo: 'slobo@espial.com', 'slobo@espialgroup.com'\n\nIgor Bukanov: 'igor.bukanov@windriver.com', 'igor@mir2.org', 'igor@icesoft.no'\n\nI'm fine with the relicensing scheme. ",
            "date": "20040316T14:38:38",
            "id": 6
        },
        {
            "author": "igor@mir2.org",
            "body": "(In reply to comment #6)\n> (In reply to comment #5)\n> > (In reply to comment #2)\n> > Yes, I have no objections and any of my contributions to Rhino can be relicensed\n> > under MIT-X-style license. \n> > \n> > Now what exactly should it be? \n> \n> Igor, IIUC Brendan suggest a relicensing to ASL2.0, but wants to check with\nMitchel. \n\nSorry but I got another impression: the idea is to have MIT-X-style license\nwhich is compatible with MPL/GPL/LGPL/APL. Since APL 2 is not compatible with\nGPL (well, according to FSF and I prefer to trust FSF is that area), the license\ncan not be APL 2.0. \n",
            "date": "20040316T15:07:55",
            "id": 7
        },
        {
            "author": "gerv@mozilla.org",
            "body": "According to:\nhttp://www.gnu.org/philosophy/license-list.html\n- the ASL 1.0 is incompatible with the GPL due to its advertising clause\n- the ASL 1.1 is incompatible with the GPL\n- the ASL 2.0 is incompatible with the GPL due to the patent clauses\n\nTherefore, none of these licenses have the four-way compatibility we seek.\n\nIt is true that the ASF claims the ASL 2.0 is compatible with the GPL; however,\nit's the copyright owner of the GPLed code who has (potential) standing to sue,\nwhoever they may be. As this issue is unclear, relicensing under the ASL 2.0 is\nprobably not the best choice.\n\nIf we want compatibility with MPL, GPL, LGPL and ASL, I would suggest the\ntraditional MIT license:\nhttp://www.opensource.org/licenses/mit-license.php\n\nIt has the advantage of compatibility, being a well-known name (saying \"X\nlicense\" these days can be confusing due to the recent XFree86 1.1 license\nissue), and simplicity.\n\nGerv",
            "date": "20040316T18:00:40",
            "id": 8
        },
        {
            "author": "gerv@mozilla.org",
            "body": "Mechanism.\n\nIt is not sufficient to email all the people who have checked into the codebase.\nYou need to take into account:\n\n- Copyright in some of those people's contributions may be owned by their\nemployer or employers during the time they contributed. Their employers\ntherefore need to give permission.\n- Others without checkin access will have contributed; they may or may not be\nmentioned in checkin comments. They will be mentioned in bugs.\n\nGathering the list of people to ask is a time-consuming task.\n\nYou then need to put together an email, and send it out. Collect the bounces,\nand try and find new email addresses for those people. Deal with the replies,\nand keep track of who hasn't got back to you. Chase them up, over months if\nnecessary. \n\nOnce you have a hard core of uncontactables, you have to evaluate their\ncontributions by reading old bugs and patches, and see if it's still possible to\ngo ahead, and how much code you have to rewrite.\n\nYou do have one trump card. If the code is under the NPL or a license including\nthe NPL, the Mozilla Foundation can relicense it by decree, without a need for\npermission. You need to decide whether you want to do that, and risk annoying\npeople, or ask and risk getting a No.\n\nAnd, before you ask, I am happy to advise as necessary, but I would like to\nfinish one relicensing project (Mozilla) before starting another one. :-)\n\nGerv\n",
            "date": "20040316T18:07:08",
            "id": 9
        },
        {
            "author": "brendan@mozilla.org",
            "body": "Now that I review email, I see that Brian Behlendorf did suggest MIT; probably I\nconfused things by suggesting ASL.  Thanks, Gerv.\n\nIf http://www.opensource.org/licenses/mit-license.php is agreeable (need\nMitchell here, her agreement is necessary), then we can settle this issue and\napproach the remaining copyright holders.\n\n/be",
            "date": "20040316T18:45:14",
            "id": 10
        },
        {
            "author": "mitchell@mozilla.org",
            "body": "Yes, the MIT license does seem a good choice.  Looks OK to me.\n\nmitchell",
            "date": "20040317T07:46:39",
            "id": 11
        },
        {
            "author": "stevenn@apache.org",
            "body": "(In reply to comment #12)\n> Yes, the MIT license does seem a good choice.  Looks OK to me.\n\nGreat. Then I propose to go further down the road, contacting people and asking for a relicensing of \ntheir contributions to MIT. Thanks!",
            "date": "20040317T07:49:13",
            "id": 12
        },
        {
            "author": "igor@mir2.org",
            "body": "Changing the title: I assume that there is agreement to change Rhino license to\nhttp://www.opensource.org/licenses/mit-license.php\n\nNow how it should be done practically? Assuming that copyright holders for a\nparticular file agrees to chnage the license, should the license header be\nchanged to the MIT license? But how then the the current copyright holder and\ncontributor information should be altered to fit MIT style? And since the\nlicense text is itself copyrighted, how should it be properly included?\n\n",
            "date": "20040317T11:33:41",
            "id": 13
        },
        {
            "author": "stevenn@apache.org",
            "body": "(In reply to comment #14)\n\n> But how then the the current copyright holder and\n> contributor information should be altered to fit MIT style?\n\nIIUC, they should be preserved.\n\nJust fyi: ASF licensing & (c) works slightly different. Contributors are required to sign a license \nagreement that makes sure their contributions become (c) ASF. We have a NOTICE or CREDITS file to \ncapture names of contributing entities which want to be credited explicitely.\n\nI don't know whether obtaining such an agreement from the old Rhino contributors should be part of \nthis relicensing operation, requiring contributors to \"give up\" (c) to the Mozilla Foundation. This of \ncourse would make future license changes a lot easier - but I understand that's not how Mozilla works.\n\n> And since the\n> license text is itself copyrighted, how should it be properly included?\n\n---------------\n\nCopyright (c) ???? <names of current copyright holders>\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and \nassociated documentation files (the \"Software\"), to deal in the Software without restriction, including \nwithout limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell \ncopies of the Software, and to permit persons to whom the Software is furnished to do so, subject to \nthe following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial \nportions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, \nINCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR \nPURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE \nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT \nOR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR \nOTHER DEALINGS IN THE SOFTWARE.\n\n--------\n\nWe might add some reference to that, stating the license is \"the MIT license\".\n\nThoughts?",
            "date": "20040317T13:38:39",
            "id": 14
        },
        {
            "author": "gerv@mozilla.org",
            "body": "The license text isn't really itself copyrighted. The copyright line is for you\nto add the names of those who own the copyright on the software.\n\nWe could ask for copyright attribution at the same time - but it's an\nadministrative hurdle, and we'd have to keep doing so going forward. It also\nmight hold up the process, particularly if people have moved employers. Whether\nwe do this or not is probably up to the person doing all the hard work :-)\n\nBTW, please don't anyone start contacting anyone until we've drawn up a plan of\naction. :-) \n\nGerv\n",
            "date": "20040317T21:29:40",
            "id": 15
        },
        {
            "author": "gerv@mozilla.org",
            "body": "So Steven, are you willing to take a lead on this? Someone has to :-)\n\nGerv\n",
            "date": "20040321T17:30:49",
            "id": 16
        },
        {
            "author": "stevenn@apache.org",
            "body": "(In reply to comment #17)\n\n> So Steven, are you willing to take a lead on this? Someone has to :-)\n\nSure thing, Gerv, just had some busy days. Let me try and figure out some plan in the next few days.",
            "date": "20040321T19:21:44",
            "id": 17
        },
        {
            "author": "morten@nvg.org",
            "body": "\nJust to ask, what exactly (if any) does this proposed lisence change do for\ncommercial usage of Rhino?\n",
            "date": "20040615T00:11:23",
            "id": 18
        },
        {
            "author": "brendan@mozilla.org",
            "body": "> Just to ask, what exactly (if any) does this proposed license change do for\n> commercial usage of Rhino?\n\nIt removes requirements on the licensee, to the point where you have only to\npreserve the copyright and license notices in the source files.\n\n/be",
            "date": "20040615T00:42:16",
            "id": 19
        },
        {
            "author": "gerv@mozilla.org",
            "body": "Steven: ping? ;-)\n\nGerv",
            "date": "20040714T21:11:40",
            "id": 20
        },
        {
            "author": "igor@mir2.org",
            "body": "Ping and ricing the original issue one more time due to yet another comming\nRhino release:\n\n> No matter what would be the outcome of the discussion about APL and other\n> license schemas, I think at least MPL/LGPL/GPL should be put in place. \n> \n> For practical matters I would suggest to finish this work first as gven the\n> previous experience any too generic question would rsult in nothing done.\n> \n> So the question is: who should authorise this?\n\nDue to the nature of NPL As discussed above mozilla.org can relicense\nNPL-licensed files under MPL/LGPL/GPL trio and since it was done for the browser\ncodebase without asking contributors is it possible to apply such treatment to\nRhino sources? And who should say the final answer for this?",
            "date": "20040806T20:55:09",
            "id": 21
        },
        {
            "author": "gerv@mozilla.org",
            "body": "Igor: yes, that's true. However, when adding the GPL and LGPL to the MPL, it was\nin some ways less contentious because we were not reducing the amount of\ncopyleft protection on the files. Using an MIT-based license would be reducing\nthe copyleft, which some contributors may not like. Therefore, you should\nprobably make sure you have support among major Rhino contributors before making\nthis move (you may already have this.)\n\nThe final say probably officially comes from Mitchell but if the module owners\nare all in agreement, you have a broad base of support, and given comment 12,\nyou should just go ahead with an MIT-like license.\n\nhttp://www.opensource.org/licenses/mit-license.php\n\nGerv",
            "date": "20040807T17:53:28",
            "id": 22
        },
        {
            "author": "igor@mir2.org",
            "body": "(In reply to comment #23)\n> Igor: yes, that's true. However, when adding the GPL and LGPL to the MPL, it was\n> in some ways less contentious because we were not reducing the amount of\n> copyleft protection on the files. Using an MIT-based license would be reducing\n> the copyleft, which some contributors may not like. Therefore, you should\n> probably make sure you have support among major Rhino contributors before making\n> this move (you may already have this.)\n\nI guess I was not clear in my last comment: I simply suggest to replace NPL/GPL\nby MPL/LGPL/GPL tripple in all Rhino sources that carry one and fix license info\nin Rhino documentation. \n\nAt this point I simply do not care about MIT license switch: if somebody is\nwilling to do that, it is very welcome, but for me the ability to redestribute\nRhino under LGPL is useful for some particular reasons.\n\nSo I repeat the question:\n\nIs it OK to replace NPL/GPL by MPL/LGPL/GPL tripple in all Rhino sources that\ncarry such notice in the same way as it was done for the browser code base???\n\nAFAICS it could not hamper the switch to MIT licsense later since all files with\nNPL/GPL duo are copyrighted by Netscape so after the switch mozilla.org IMO can\nstill change the license at will.",
            "date": "20040807T18:53:22",
            "id": 23
        },
        {
            "author": "gerv@mozilla.org",
            "body": "> AFAICS it could not hamper the switch to MIT licsense later since all files \n> with NPL/GPL duo are copyrighted by Netscape so after the switch mozilla.org \n> IMO can still change the license at will.\n\nmozilla.org has not, as far as I am aware, had Netscape's copyrights assigned to\nit, so this doesn't work. Even if it had, Netscape only retains copyright on the\nparts of the code it wrote - if I insert ten lines into a file that says \"(C)\nNetscape\" at the top, the copyright on those ten lines is still mine, not\nNetscape's.\n\nSo, switching Rhino to an MPL-based tri-license would in effect fork it, because\nif we wanted to MIT-license it, we could only do so for the last version that\nwas NPLed, and not for the latest version. Either that, or request permission\nfrom every contributor who contributed after the change to the tri-license.\n\nThe correct thing to do is for the Rhino module owners to choose a license\n(which I believe they have; the MIT one), make sure (in this case) that the\nmajor players are onside, and then relicense the code once and for all.\n\nIgor: does your urgency translate into being able to provide manpower for this\nprocess?\n\nGerv\n",
            "date": "20040808T13:23:34",
            "id": 24
        },
        {
            "author": "igor@mir2.org",
            "body": "(In reply to comment #25)\n> > AFAICS it could not hamper the switch to MIT licsense later since all files \n> > with NPL/GPL duo are copyrighted by Netscape so after the switch mozilla.org \n> > IMO can still change the license at will.\n> \n> mozilla.org has not, as far as I am aware, had Netscape's copyrights assigned to\n> it, so this doesn't work. Even if it had, Netscape only retains copyright on the\n> parts of the code it wrote - if I insert ten lines into a file that says \"(C)\n> Netscape\" at the top, the copyright on those ten lines is still mine, not\n> Netscape's.\n> \n> So, switching Rhino to an MPL-based tri-license would in effect fork it, because\n> if we wanted to MIT-license it, we could only do so for the last version that\n> was NPLed, and not for the latest version. Either that, or request permission\n> from every contributor who contributed after the change to the tri-license.\n\nI see. But then here is my understanding of the situation.\n\n1. If a file contains NPL notice, then mozilla.org can at will change its\nlicense to anything. \n\n2. Using such power to change the license from NPL/GPL into MPL/GPL/LGPL trio is\nOK since it does not change the spirit of the license.\n\n3. It is not OK despite the legal possibility to change the license to MIT one\nunless ALL the contributors to a particular file agree about it since it does\nchange the essence of the license significantly.\n\nBut then I do not see how changing NPL/GPL into MPL/GPL/LGPL now would hamper\nthe the relicensing later under MIT license. If the intention is to get the\nagreement from all contributors in any case, then additional license step in\nbetween should not matter, right?\n\n> Igor: does your urgency translate into being able to provide manpower for this\n> process?\n\nNo: as I wrote I do not care about MIT license for Rhino. It is useful to have\nLGPL option for me since it would simplify packaging of Rhino together with LGPL\ncode in a comercial product. \n\nMIT license, of cause, would simplify the packaging even more but I do not see\nhow it would ever happen.",
            "date": "20040808T14:25:26",
            "id": 25
        },
        {
            "author": "gerv@mozilla.org",
            "body": "> 3. It is not OK despite the legal possibility to change the license to MIT one\n> unless ALL the contributors to a particular file agree about it since it does\n> change the essence of the license significantly.\n\nThat's not quite right. It's legally fine to change the license; my _advice_ to\nthe maintainers of Rhino would be, to avoid splitting their community and losing\ncontributions or getting damaging PR, to make sure all they key contributors are\nhappy first. \n\nHowever, if the Rhino module owner does not want to do that, we can go ahead and\nchange straight to MIT without it.\n\nGerv\n",
            "date": "20040808T14:51:51",
            "id": 26
        },
        {
            "author": "igor@mir2.org",
            "body": "I attach recent mails for records:\n\n-------- Original Message --------\nSubject: Re: [Fwd: Re: Licensing Question]\nDate: Fri, 27 Aug 2004 09:42:40 +0200\nFrom: Steven Noels <stevenn@outerthought.org>\nTo: Mitchell Baker <mitchell@mozilla.org>,\tBrendan Eich <brendan@meer.net>, Igor\nBukanov <igor@fastmail.fm>,\tshaver <shaver@mozilla.org>, Brian Behlendorf\n<brian@collab.net>,\tlegal@apache.org\nCC: Cocoon PMC List <pmc@cocoon.apache.org>\nReferences: <412E1318.6090404@meer.net> <412E45B5.9070900@mozilla.org>\n<412E5235.9080402@meer.net> <20040826145056.F30475@fez.hyperreal.org>\n<412E5EE3.9060900@mozilla.org>\n\nOn 27 Aug 2004, at 00:06, Gervase Markham wrote:\n\n> Brian Behlendorf wrote:\n>> ISTR the problem was that to relicense, we needed to track down all \n>> prior contributors and ask them to approve a relicense.\n>\n> That's not actually true. See the position outlined in the bug.\n> http://bugzilla.mozilla.org/show_bug.cgi?id=236108\n>\n> I said:\n>\n> \"That's not quite right. It's legally fine [due to the code being \n> NPLed] to change the license; my _advice_ to the maintainers of Rhino \n> would be, to avoid splitting their community and losing contributions \n> or getting damaging PR, to make sure all they key contributors are \n> happy first.\n>\n> However, if the Rhino module owner does not want to do that, we can go \n> ahead and change straight to MIT without it.\"\n>\n> So as far as I'm concerned, we're awaiting a decision from the Rhino \n> module owner (I'm not actually sure who that is) on this question. If \n> they say they have all the people they care about on-side, we can go \n> ahead and relicense. I can provide tools for that, and it's a mostly \n> automated job.\n\nThis change of plans has been added a few weeks ago, and I figure this \ncould be helpful, *if* the reintegration issue is tackled as well - \nwhich is still to be doubted upon.\n\nFrankly, the reason why I didn't pursue further efforts wrt. contacting \noriginal contributors (and their eventual employers) was partly because \nof a serious lack of time on my behalf, even though I did produce a \nlist of all email addresses to be contacted from Rhino's CVS log \nhistory \n(http://bugzilla.mozilla.org/attachment.cgi?id=144038&action=view).\n\nAlso, even though Gerv repeatedly offered his kind assistance with the \nprocess of contacting the original copyright owners, comments like \nhttp://bugzilla.mozilla.org/show_bug.cgi?id=236108#c26 left me wary on \nthe eventual success of such an effort.\n\nOn the issue of reintegration, I think I can safely state that no such \neffort is currently underway, and that this isn't likely to happen any \ntime soon - due to the complexity of the effort, the effect that Rhino \nitself has moved on since then, and that a few alternatives for the \nlibrary's functions are starting to appear in other venues \n(non-JavaScript-based continuations). However, the Rhino fork is still \nin heavy use by many Cocoon users - not all of them interested in doing \npure Java-based continuations nor in pursuing Groovy-based \ncontinuations ATM.\n\nWhile the issue of having a fork around is not to be applauded upon, \nhaving a MIT-licensed Rhino would at the very least still legalize the \nsituation, in the sense that we might then be able to safely import our \nfork into ASF CVS and work from there. However, I assume the \nrelicensing would happen for the current version of Rhino, which is not \nthe version the fork has been based upon, and I'm pretty sure \nrelicensing can't go back in time.\n\n<off-topic>Optimistically thinking, and proposing something which has \nbeen commented upon already earlier, the chances for more people \nworking on Rhino, and perhaps offering continuations support in the \nofficial version so that our fork becomes obsolete, might increase if, \nfacilitated partly through the MIT-relicensing, Rhino would become part \nof the bigger and more Java-centric development community of \nApache.</off-topic>\n\nAh: I see Norris isn't on the recipients list - shouldn't he be made \naware of what we are conversing about?\n\n</Steven>\n-- \nSteven Noels                            http://outerthought.org/\nOuterthought - Open Source Java & XML            An Orixo Member\nRead my weblog at            http://blogs.cocoondev.org/stevenn/\nstevenn at outerthought.org                stevenn at apache.org\n",
            "date": "20040827T10:03:55",
            "id": 27
        },
        {
            "author": "igor@mir2.org",
            "body": "For the records:\n\n-------- Original Message --------\nSubject: Re: Rhino Licensing Question\nDate: Fri, 27 Aug 2004 08:49:18 -0400\nFrom: Norris Boyd <nboyd@atg.com>\nTo: Igor Bukanov <igor@fastmail.fm>\nCC: Steven Noels <stevenn@outerthought.org>,\tMitchell Baker\n<mitchell@mozilla.org>,\tBrendan Eich <brendan@meer.net>, shaver\n<shaver@mozilla.org>,\tBrian Behlendorf <brian@collab.net>, legal@apache.org,\nCocoon PMC List <pmc@cocoon.apache.org>\nReferences: <412E1318.6090404@meer.net> <412E45B5.9070900@mozilla.org>\n<412E5235.9080402@meer.net> <20040826145056.F30475@fez.hyperreal.org>\n<412E5EE3.9060900@mozilla.org>\n<AC9D07BF-F7FC-11D8-9CEA-000A958B684A@outerthought.org>\n<412F0925.2070608@fastmail.fm>\n\nYes, I'd agree to change the license of Rhino source files with NPL/GPL \nlicense header to MIT-style license without contracting all the \ncontributors.\n\nI don't know the legal ins and outs, but seems like we'd need the \napproval of someone from the Mozilla foundation who presumably inherited \nthe legal rights associated with being the \"Initial Developer\" from \nNetscape/AOL/Time Warner.\n\n--N\n\nIgor Bukanov wrote:\n\n> Hi, Norris!\n>\n> The issue about Rhino license \n> (http://bugzilla.mozilla.org/show_bug.cgi?id=236108) was resurrected \n> once again so I include you on on the list.\n>\n> Now the question is would you agree to change license of Rhino source \n> files that have NPL/GPL license header to MIT-style license without \n> contacting all the contributors?\n>\n> But I will ask John Schneider from AgileDelta if he would accept that \n> for E4X contribution.\n>\n> Regards, Igor\n>\n>\n> Steven Noels wrote:\n>\n>> On 27 Aug 2004, at 00:06, Gervase Markham wrote:\n>>\n>>> Brian Behlendorf wrote:\n>>>\n>>>> ISTR the problem was that to relicense, we needed to track down all \n>>>> prior contributors and ask them to approve a relicense.\n>>>\n>>>\n>>>\n>>> That's not actually true. See the position outlined in the bug.\n>>> http://bugzilla.mozilla.org/show_bug.cgi?id=236108\n>>>\n>>> I said:\n>>>\n>>> \"That's not quite right. It's legally fine [due to the code being \n>>> NPLed] to change the license; my _advice_ to the maintainers of \n>>> Rhino would be, to avoid splitting their community and losing \n>>> contributions or getting damaging PR, to make sure all they key \n>>> contributors are happy first.\n>>>\n>>> However, if the Rhino module owner does not want to do that, we can \n>>> go ahead and change straight to MIT without it.\"\n>>>\n>>> So as far as I'm concerned, we're awaiting a decision from the Rhino \n>>> module owner (I'm not actually sure who that is) on this question. \n>>> If they say they have all the people they care about on-side, we can \n>>> go ahead and relicense. I can provide tools for that, and it's a \n>>> mostly automated job.\n>>\n>>\n>>\n>> This change of plans has been added a few weeks ago, and I figure \n>> this could be helpful, *if* the reintegration issue is tackled as \n>> well - which is still to be doubted upon.\n>>\n>> Frankly, the reason why I didn't pursue further efforts wrt. \n>> contacting original contributors (and their eventual employers) was \n>> partly because of a serious lack of time on my behalf, even though I \n>> did produce a list of all email addresses to be contacted from \n>> Rhino's CVS log history \n>> (http://bugzilla.mozilla.org/attachment.cgi?id=144038&action=view).\n>>\n>> Also, even though Gerv repeatedly offered his kind assistance with \n>> the process of contacting the original copyright owners, comments \n>> like http://bugzilla.mozilla.org/show_bug.cgi?id=236108#c26 left me \n>> wary on the eventual success of such an effort.\n>>\n>> On the issue of reintegration, I think I can safely state that no \n>> such effort is currently underway, and that this isn't likely to \n>> happen any time soon - due to the complexity of the effort, the \n>> effect that Rhino itself has moved on since then, and that a few \n>> alternatives for the library's functions are starting to appear in \n>> other venues (non-JavaScript-based continuations). However, the Rhino \n>> fork is still in heavy use by many Cocoon users - not all of them \n>> interested in doing pure Java-based continuations nor in pursuing \n>> Groovy-based continuations ATM.\n>>\n>> While the issue of having a fork around is not to be applauded upon, \n>> having a MIT-licensed Rhino would at the very least still legalize \n>> the situation, in the sense that we might then be able to safely \n>> import our fork into ASF CVS and work from there. However, I assume \n>> the relicensing would happen for the current version of Rhino, which \n>> is not the version the fork has been based upon, and I'm pretty sure \n>> relicensing can't go back in time.\n>>\n>> <off-topic>Optimistically thinking, and proposing something which has \n>> been commented upon already earlier, the chances for more people \n>> working on Rhino, and perhaps offering continuations support in the \n>> official version so that our fork becomes obsolete, might increase \n>> if, facilitated partly through the MIT-relicensing, Rhino would \n>> become part of the bigger and more Java-centric development community \n>> of Apache.</off-topic>\n>>\n>> Ah: I see Norris isn't on the recipients list - shouldn't he be made \n>> aware of what we are conversing about?\n>>\n>> </Steven>\n>\n>\n",
            "date": "20040827T12:53:55",
            "id": 28
        },
        {
            "author": "gerv@mozilla.org",
            "body": "Replying to Norris' email (which, for some reason, I didn't get as an email):\n\nIt's not about who is the Initial Developer, it's about who has a right to\narbitrarily relicense NPLed code. The Foundation inherited this right from\nNetscape, and we are happy to use it in this case to relicense Rhino under the\nMIT license.\n\nIf your statement \"I'd agree to change the license.. to MIT-style license\nwithout contracting all the contributors\" is the voice of all the Rhino module\nowners (still, no-one has told me who they are and how many), then we can go ahead.\n\nThe person who wishes to do the work should contact me by email for\ninstructions, tips and scripts.\n\nGerv\n",
            "date": "20040827T21:47:32",
            "id": 29
        },
        {
            "author": "mitchell@mozilla.org",
            "body": "I'm not sure Gerv is right about this.  I want to look at the actual language\nabout what we can do with code.  I'm just back from vacaton this evening and\ndon't have the documents in front of me.  My recollection is that the Mozilla\nFoundation has the right to use the previously NPL'd code under the MPL and of\ncourse to change the terms of the MPL.  But I don't recall anything that says\nthat Netscape's special rights under the NPL are somehow transferred to the\nMozilla Foundation.  \n\nI think this is what Gerv is saying.  Gerv, please correct me if you are saying\nsomething else.  \n\nMitchell ",
            "date": "20040828T07:27:46",
            "id": 30
        },
        {
            "author": "gerv@mozilla.org",
            "body": "I've emailed Mitchell to clarify the situation.\n\nGerv",
            "date": "20040829T12:31:44",
            "id": 31
        },
        {
            "author": "igor@mir2.org",
            "body": "(In reply to comment #32)\n> I've emailed Mitchell to clarify the situation.\n> \n> Gerv\n\nGrev, did you get any information regarding the license issues?",
            "date": "20040912T15:59:18",
            "id": 32
        },
        {
            "author": "igor@mir2.org",
            "body": "(In reply to comment #32)\n> I've emailed Mitchell to clarify the situation.\n> \n> Gerv\n\nGerv, did you get any information regarding the license issues?",
            "date": "20040912T15:59:56",
            "id": 33
        },
        {
            "author": "gerv@mozilla.org",
            "body": "Mitchell is of the view that the special NPL relicensing ability remains with\nNetscape. Netscape started a relicensing project for the Mozilla code - the\nquestion is whether that included Rhino or not. It's rather hard to say, as\nMitchell doesn't have all her old records any more. \n\nOn 29/08 she said she'd have a look; I haven't heard back since. I'm not\nsurprised - it's one of those open-ended jobs that never reaches the top of the\nlist ;-)\n\nPerhaps it would be best to assume that we need to seek permission from\neveryone. That's not necessarily as arduous as task as you might think. If\nsomeone still has the cycles to take this forward, they should email me to\ndiscuss it. We can at least work out the size of the problem.\n\nGerv",
            "date": "20040912T21:36:26",
            "id": 34
        },
        {
            "author": "igor@mir2.org",
            "body": "(In reply to comment #35)\n\n> Perhaps it would be best to assume that we need to seek permission from\n> everyone. That's not necessarily as arduous as task as you might think. If\n> someone still has the cycles to take this forward, they should email me to\n> discuss it. We can at least work out the size of the problem.\n\nBut before any such process can start I think it is necessary to reach the\nconclusion on the following issues:\n\n1. Should the license change happen once for all files or is it OK to have a\nmixture? \n\n2. Exact license policy for the new source files and how the future\ncontributions to them has to be handled.\n\n3. License policy for contributions to the current sources with NPL/GPL headers.\nI.e. how exactly that has to be marked and documented?\n\nIf there is a conclusion on these issue I can add that to Rhino documentation\nand refer interested folks to it. \n\n",
            "date": "20040913T14:40:47",
            "id": 35
        },
        {
            "author": "gerv@mozilla.org",
            "body": "IMO:\n\n> 1. Should the license change happen once for all files or is it OK to have a\n> mixture? \n\nOnce for all. A mixture will just confuse.\n\n> 2. Exact license policy for the new source files and how the future\n> contributions to them has to be handled.\n\nFuture contributions under the same licence. What else needs deciding?\n\n> 3. License policy for contributions to the current sources with NPL/GPL \n> headers. I.e. how exactly that has to be marked and documented?\n\nI don't understand the question.\n\nGerv",
            "date": "20040918T11:27:21",
            "id": 36
        },
        {
            "author": "igor@mir2.org",
            "body": "(In reply to comment #37)\n> IMO:\n> \n> > 1. Should the license change happen once for all files or is it OK to have a\n> > mixture? \n> \n> Once for all. A mixture will just confuse.\n\nBut what if it would take many months to contact all contributors? And what if\nsomeone just say no for a small patch? \n\n> \n> > 2. Exact license policy for the new source files and how the future\n> > contributions to them has to be handled.\n> \n> Future contributions under the same licence. What else needs deciding?\n\nMPL pages at mozilla.org describe the procedure how the contribution should be\nmarked like \"Conributors\" section in the license header etc.. I guess MIT\nlicense instructions can follow the same rules, right?\n\n> \n> > 3. License policy for contributions to the current sources with NPL/GPL \n> > headers. I.e. how exactly that has to be marked and documented?\n> \n> I don't understand the question.\n\nThe question is what should happen if during process of contacting contribors\nfor some file someone submit a patch against the file? Should a separated MIT\nsection be added to the file or is it enough top state in a documentation that\nall contributions from the moment X are under MIT license?\n\nIgor",
            "date": "20040920T21:42:24",
            "id": 37
        },
        {
            "author": "gerv@mozilla.org",
            "body": "> But what if it would take many months to contact all contributors? And what if\n> someone just say no for a small patch? \n\nThe trick here is to change your checkin policy to say \"people contributing code\nmust consent to a future relicensing.\" This freezes the problem at its current size.\n\n> > Future contributions under the same licence. What else needs deciding?\n> \n> MPL pages at mozilla.org describe the procedure how the contribution should be\n> marked like \"Conributors\" section in the license header etc.. I guess MIT\n> license instructions can follow the same rules, right?\n\nActually, the MIT license header doesn't have a Contributors section.\n\n> The question is what should happen if during process of contacting contribors\n> for some file someone submit a patch against the file?\n\nSee above :-)\n\nGerv",
            "date": "20040920T22:59:25",
            "id": 38
        },
        {
            "author": "zac@zacbowling.com",
            "body": "What came of this? its been over a year or two since this was a topic?",
            "date": "20060609T18:13:14",
            "id": 39
        },
        {
            "author": "gerv@mozilla.org",
            "body": "From a practical point of view, the situation is that someone needs to step up and volunteer to take the time to do the work. I'd be happy to advise them as how to proceed.\n\nGerv\n",
            "date": "20060619T12:19:57",
            "id": 40
        },
        {
            "author": "antonio@apache.org",
            "body": "Perhaps we should close this issue. Rhino 1.6R5 was released on 2006-11-19 under MPL 1.1 which is compatible with Apache License. See:\n\nhttp://www.mozilla.org/rhino/download.html",
            "date": "20070118T05:54:06",
            "id": 41
        },
        {
            "author": "norrisboyd@gmail.com",
            "body": "Agreed. ",
            "date": "20070118T12:38:17",
            "id": 42
        },
        {
            "author": "norrisboyd@gmail.com",
            "body": "Adding target milestone of 1.6R6 based on the date this bug was resolved FIXED.",
            "date": "20070518T15:09:27",
            "id": 43
        },
        {
            "author": "norrisboyd@gmail.com",
            "body": "This should be marked 1.6R5.",
            "date": "20070518T15:13:20",
            "id": 44
        }
    ],
    "component": "Core",
    "description": "I think this should be resolved once and for all.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "236108",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "-- normal",
    "product": "Rhino",
    "project": "RHINO",
    "summary": "Relicensing Rhino under the MIT license",
    "systemSpecification": false,
    "version": "other"
}