{
    "comments": [
        {
            "author": "igor@mir2.org",
            "body": "You can not change the status of bugs you do not reported or own in bugzilla\nunless you have special priviliges. But it is strange that you could not attach\nanything. \n\n",
            "date": "20040525T07:57:07",
            "id": 0
        },
        {
            "author": "igor@mir2.org",
            "body": "To John:\n\nI reassigned the bug to you so you can change its status.",
            "date": "20040525T08:00:35",
            "id": 1
        },
        {
            "author": "igor@mir2.org",
            "body": "John Schneider wrote:\n> Hi Igor,\n> \n> Thanks again. Attached is the final draft of the E4X specification. Sorry,\n> you didn't get a copy of this earlier. I sent one right after the final\n> draft went to ECMA for approval, but I think I only sent it to Norris at the\n> time. ECMA will post the final version on their web site once it is\n> approved. Please let me know if there's anything else I can do to help. \n\nI assume that until the uproval the draft can not be made public, right? \n\n> Do you know approximately when you might have time to start the E4X review\n> now that you have the spec? We were hoping to get any issues resolved and\n> have a version people could download and try out before the standard is\n> finalized in late June. \n\nWell, I can spend some time in June but would like to reiterate my suggesting\nabout splitting the changes in at least 2 parts, that is the parser changes and\nthe runtime. AFAICS the parser part is quite reasonable and can be included into\nRhino with simple exception throwing during code generation for e4x parse nodes. \n\nThen the runtime can be done added by parts together with the class compiler\nsupport. \n",
            "date": "20040525T09:17:35",
            "id": 2
        },
        {
            "author": "john.schneider@agiledelta.com",
            "body": "Created attachment 152953\nA patch that adds the full E4X feature set to Rhino",
            "date": "20040712T15:56:02",
            "id": 3
        },
        {
            "author": "john.schneider@agiledelta.com",
            "body": "Hi Igor,\n\nI'm pleased to inform you that the patch adding the E4X feature set to Mozilla \nRhino is complete! The attached patch contains the recursive diffs of the \nsource code. Also, the full source code, object code and some examples may be \nfound at ftp://ftp.mozilla.org/pub/mozilla.org/js/e4x_preview.zip. \n\nThanks for all your assistance! You're comments and feedback have been very \nhelpful and have improved the quality of the submission substantially. I'm \nanxious to see E4X included in Rhino 1.6! Please let me know if there's \nanything else I can do to assist.\n\n  Thanks!,\n\n  John",
            "date": "20040712T16:04:43",
            "id": 4
        },
        {
            "author": "igor@mir2.org",
            "body": "Reopening to have the bug open until the code end up in Rhino CVS",
            "date": "20040717T18:27:01",
            "id": 5
        },
        {
            "author": "igor@mir2.org",
            "body": "Created attachment 153531\nThe version of the previous patch against Rhino tip plus fixes\n\nThis is the version of E4X patch against Rhino tip. During porting I made the\nfollowing changes:\n\n1. There are no more static variables to hold prototypes for XML objects. This\nis rather verbose change since it introduces omj.xml.XMLLib and passes its\ninstances to XMLObject, Namespace and QName constructors. XMLLib holds the\ncurrent XML settings and initialization scope allowing to setup prototype\nchains for XML objects properly. \n\n2. New class omj.xml.XMLCtor implements all properties and methods of XML\nconstructor object which made unnecessary modifications in omj.IdFunction and\nsimplified XML code itself.\n\n3. New class omj.xml.XMLWithScope subclasses omj.NativeWith with XML-specific\nstuff which made changes to NativeWith unnecessary. \n\n4. Allow to pass the current test suite under JDK 1.1 without Apache classes\navailable. Previously JVM would try to access Apache classes on the first\nattempt to check for XML class instance. Under JDK 1.1 it leads to class\ninitialization. That in turn would initialize static variables which required\nto have XML classes. \n\n\nTo apply the patch pull Rhino sources from CVS, go to mozilla/js/rhino and run \n\n\npatch -p1 -i ....e4x_against_rhino_tip.diff",
            "date": "20040717T19:10:25",
            "id": 6
        },
        {
            "author": "igor@mir2.org",
            "body": "Created attachment 153932\nE4X patch without compilation dependencies on xbean.jar for core classes\n\nThis is the re-factored version of the previous patch that moves all code that\ndepends on xbean.jar classes into the separated top-level source dir\nxmlimplsrc.\n\nThe patch assumes that xbean.jar should be placed into jaralib/xbean.jar and\nnot into external/xbean.jar .\n\nThe attached file is gzipped diff so to apply it pull Rhino sources from CVS,\ngo to mozilla/js/rhino, and run \n\ngunzip ...e4x_against_rhino_tip.diff.gz | patch -p1",
            "date": "20040721T21:18:08",
            "id": 7
        },
        {
            "author": "igor@mir2.org",
            "body": "I put Rhino sources with the last patch applied and compiled distribution at\nhttp://www.mir2.org/igor/e4x/ for now.\n\n\n",
            "date": "20040721T21:32:01",
            "id": 8
        },
        {
            "author": "igor@mir2.org",
            "body": "Created attachment 153951\nFixing missing xmlimplsrc/build.xml\n\nThe previous version of the patch did not include xmlimplsrc/build.xml which\nthis version fixes. In addition it will automatically download xbean.jar if it\nis not available during compilation with ant.\n\nAll the previous comments applies including the note that this is gzipped\nunified diff due to bugzilla restrictions on the patch size.",
            "date": "20040721T23:57:37",
            "id": 9
        },
        {
            "author": "igor@mir2.org",
            "body": "I updated http://www.mir2.org/igor/e4x/ to reflect the last version of the patch",
            "date": "20040722T00:13:35",
            "id": 10
        },
        {
            "author": "igor@mir2.org",
            "body": "Created attachment 154234\nResolving compatibility issues\n\nThis version of the patch makes E4X-specific code compatible with Scriptable\nsemantic leading to less surprises in applications. It also include various\noptimizations to minimize number of created objects during XML property access.\n\n\nhttp://www.mir2.org/igor/e4x/ is updated with the rebuilt distribution of Rhino\nwith the patch applied.",
            "date": "20040724T23:05:08",
            "id": 11
        },
        {
            "author": "igor@mir2.org",
            "body": "Created attachment 154394\nUsing Context to look for default namespace\n\n\nThe default xml statement in E4X associates the namespace with the current\nactivation scope. In the previous versions of the patch the current execution\nscope was used to set namespace objects. But it does not correspond to the\nactivation scope due to presence of with/catch statements. The patch addresses\nand passes Context instead of Scriptable to many functions expecting to search\nfor default namespace declaration.\n\nThe patch also renames get/put/has/delete methods in XMLScriptable into\ngetXMLProperty/putXMLProperty/hasXMLProperty/deleteXMLProperty to emphasis\nsemantical separation from Scriptable method.\n\nAs usual the attachment is gzippped diff and http://www.mir2.org/igor/e4x/\ncontains uncopressed version and prebuilt distributions.",
            "date": "20040726T20:09:30",
            "id": 12
        },
        {
            "author": "igor@mir2.org",
            "body": "I think the last patch addresses all compatibility issues with the older Rhino\nand I will start merging it tomorrow, 2004-07-27 with Rhino tip.",
            "date": "20040726T20:11:44",
            "id": 13
        },
        {
            "author": "igor@mir2.org",
            "body": "Created attachment 154570\nThe final patches: E4X syntax and runtime proxies\n\nThe previous drop was not the final story after all. I have already merged few\nnon-E4X-specific changes to Rhino CVS already and tag that version with\nBEFORE_E4X. \n\nThe version of the patch contains clear separation between E4X parsing and\nruntime support. The patch effectively contains all the necessary parser and\ncode generation changes plus proxies for E4X runtime support. The proxies are\nrepresented by only 2 classes, XMLLib and XMLObject in\norg.mozilla.javascript.xml and contain all the necessary hooks that E4X runtime\nhas to implement.  Patch touches quite a few runtime places to make efficient\nE4X support possible, mostly in the form of passing Context instances to most\nruntime methods and properly maintaining activation records.\n\nThe XML implementation itself is provided in the separated patch (see the next\nattachment).\n\nNote that the patch is a normal uncompressed diff.",
            "date": "20040728T16:15:21",
            "id": 14
        },
        {
            "author": "igor@mir2.org",
            "body": "Created attachment 154571\nThe final patches: E4X runtime",
            "date": "20040728T16:17:35",
            "id": 15
        },
        {
            "author": "igor@mir2.org",
            "body": "I committed the last 2 patches: now Rhino CVS tip supports E4X!\n\nI keep the bug open for now since CVS does not include yet examples and\ndocumentation about E4X.\n",
            "date": "20040729T00:00:27",
            "id": 16
        },
        {
            "author": "igor@mir2.org",
            "body": "I added the example demostrating E4X features from the initial E4X drop to Rhino\nCVS as  examples/E4X/e4x_example.js .\n\nBut it would be nice to populate the directory with more code.",
            "date": "20040729T16:00:59",
            "id": 17
        },
        {
            "author": "igor@mir2.org",
            "body": "I added the example demostrating E4X features from the initial E4X drop to Rhino\nCVS as  examples/E4X/e4x_example.js .\n\nBut it would be nice to populate the directory with more samples.",
            "date": "20040729T16:01:17",
            "id": 18
        },
        {
            "author": "igor@mir2.org",
            "body": "E4X test cases is now a part of js test suite that allows to mark the bug as fixed",
            "date": "20041119T10:34:08",
            "id": 19
        }
    ],
    "component": "E4X",
    "description": "Rhino shoould support E4X extensions to ECMAScript standard.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "242805",
    "issuetypeClassified": "RFE",
    "issuetypeTracker": "RFE",
    "priority": "-- enhancement",
    "product": "Rhino",
    "project": "RHINO",
    "summary": "Implementation of E4X",
    "systemSpecification": true,
    "version": "head"
}