{
    "comments": [
        {
            "author": "igor@mir2.org",
            "body": "Created attachment 156608\nReport about invalid references during parsing",
            "date": "20040820T17:39:55",
            "id": 0
        },
        {
            "author": "igor@mir2.org",
            "body": "I committed the patch.",
            "date": "20040820T17:44:27",
            "id": 1
        }
    ],
    "component": "Core",
    "description": "While working on code to implement function calls as reference to adress bug\n243057 I got impression that ECMAScript requires that all reference errors\nshould be runtime errors. So I added special parser/code generation support so\n++0 or 1 = 0 would only generate errors at runtime.\n\nBut as Brendan pointed out it is not so:\n\nBrendan Eich wrote:\n> Igor Bukanov wrote:\n> \n>> Hi!\n>>\n>> As far as I can see ECMAScript requires that ++0 should produce \n>> RuntimeError, not SyntaxError. So, for example, the following should \n>> be OK:\n>>\n>> var f = Function('++0')\n>>\n>> and only during call to f RuntimeError should be generated. Microsoft \n>> JScript and KDE JavaScript implementation follows this while \n>> SpiderMonkey behaves much saner IMO and report SyntaxError during \n>> parsing. But does ECMA-267 allow this early error reporting?\n>>\n>> Regards, Igor\n> \n> \n> \n> Yes, explicitly so, per Section 16 of ECMA-262 Edition 3:\n> \n> An implementation may treat any instance of the following kinds of \n> runtime errors as a syntax error and therefore report it early:\n> \n> * Improper uses of return, break, and continue.\n> * Using the eval property other than via a direct call.\n> * Errors in regular expression literals.\n> * Attempts to call PutValue on a value that is not a reference (for \n> example, executing the assignment statement 3=4).\n> \n> The last is the one of interest here.\n> \n> /be\n\nFor this reason to make Rhino-as-syntax checker to detect more errors and to\nmatch saner SpiderMonkey behavior I suggest to report about invalid references\nduring parsing, not runtime.",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "256317",
    "issuetypeClassified": "IMPROVEMENT",
    "issuetypeTracker": "BUG",
    "priority": "-- normal",
    "product": "Rhino",
    "project": "RHINO",
    "summary": "Bad references as syntax errors",
    "systemSpecification": true,
    "version": "head"
}