{
    "comments": [
        {
            "author": "cam@mcc.id.au",
            "body": "Created attachment 214130\nPatch to expose debugger classes' useful fields as protected.\n\nThis patch does the following:\n\n  * exposes 'dim' and 'debugGui' in omj.tools.debugger.Main (as well as many\n    other things in the debugger package) as protected, thereby making the\n    debugger classes more useful outside their package.\n  * adds the ability to detach the debugger from a ContextFactory and later\n    attach it to a different one.\n  * cleans up and comments the debugger classes.\n\nPlease let me know your thoughts.",
            "date": "20060306T00:08:44",
            "id": 0
        },
        {
            "author": "cam@mcc.id.au",
            "body": "Created attachment 214133\nPatch to expose debugger classes' useful fields as protected.\n\nSlightly updated.",
            "date": "20060306T00:23:05",
            "id": 1
        },
        {
            "author": "cam@mcc.id.au",
            "body": "Since it's not so clear what the important changes are from the patch, they are:\n\n  * Package protected fields/methods made protected.\n  * Non-trivial methods modified: Dim.attachTo\n  * Non-trivial methods added: Main.detach, Dim.detach, Dim.dispose",
            "date": "20060306T03:05:00",
            "id": 2
        },
        {
            "author": "igor@mir2.org",
            "body": "Reassigning to the reporter as I have neither interest nor time for Rhino.\n\nSee also bug 288433.\n\n",
            "date": "20060331T16:18:02",
            "id": 3
        },
        {
            "author": "jwatt@jwatt.org",
            "body": "Igor: so who can review this? CC'ing all the Rhino peers mentioned on mozilla.org/owners.html but I have no idea if any of them are active.\n\nCameron: you probably want to keep an eye on bug 288433.",
            "date": "20060331T16:41:26",
            "id": 4
        },
        {
            "author": "igor@mir2.org",
            "body": "(In reply to comment #5)\n> Igor: so who can review this? \n\nSorry, but I do not know.\n\n",
            "date": "20060401T12:36:21",
            "id": 5
        },
        {
            "author": "szegedia@freemail.hu",
            "body": "I have roughly reviewed this patch, and it looks okay to me. The only modifications I'd ask you to do would be to change protected fields to private fields, and provide public getter/setter methods for them. I'm aware that this likely also means modifying existing debugger implementation sources as they probably conveniently relied on the fact that they can access those fields directly, but I'd say that if we want to touch this, then let's do it the right way, all the way. Would you be comfortable with doing this additional requirement?",
            "date": "20060528T15:53:08",
            "id": 6
        },
        {
            "author": "szegedia@freemail.hu",
            "body": "And while you're at it, add your name to the \"contributors\" section of each file you modified.",
            "date": "20060528T15:53:49",
            "id": 7
        },
        {
            "author": "cam@mcc.id.au",
            "body": "Created attachment 223640\nPatch that cleans up the debugger.\n\nOk, the patch is now updated to make all of the protected things private, and getters added where appropriate, except for some fields in SwingGui.java that I have reverted to being package protected, since there are a number of mutually dependent classes in that file and I don't think it would hurt to leave them accessing each others' innards.",
            "date": "20060529T01:14:46",
            "id": 8
        },
        {
            "author": "szegedia@freemail.hu",
            "body": "(In reply to comment #9)\n> Ok, the patch is now updated to make all of the protected things private, and\n> getters added where appropriate, except for some fields in SwingGui.java\n\nOkay, that's SwingGui. On the other hand, I noticed that the majority of fields in Dim.java are still protected instead of private. Is there a justification for that?",
            "date": "20060529T05:03:50",
            "id": 9
        },
        {
            "author": "cam@mcc.id.au",
            "body": "Created attachment 223654\nPatch that cleans up the debugger.\n\nMy mistake, new patch with all protected members cleared out.",
            "date": "20060529T05:18:42",
            "id": 10
        },
        {
            "author": "szegedia@freemail.hu",
            "body": "Last patch committed to CVS",
            "date": "20060622T16:12:57",
            "id": 11
        }
    ],
    "component": "Core",
    "description": "User-Agent:       Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.8) Gecko/20051224 Debian/1.5.dfsg-3 Firefox/1.5\nBuild Identifier: \n\nMany classes/methods from the omj.tools.debugger package are either package protected or private, resulting in it being impossible to usefully use the debugger outside of the Main class.\n\nI am currently trying to migrate Batik from using Rhino 1.5R4.1 to 1.6R2.  Batik's SVG browser program Squiggle uses the debugger, and to integrate it nicely it would modify the debugger's menu bar slightly.  In 1.6R2 the Main class is separated from the debugger frame class (now SwingGui), and since the debugGui field in Main is package protected, it cannot be accessed from my class that extends the Main so that it can modify the menu.\n\nI would create my own, separate debugger class that used a Dim and a SwingGui object, but these two classes are also package protected and thus can't be reused.  To work around this, I would need to duplicate all of the classes in\nomj.tools.debugger, which is obviously sub-optimal.\n\nI request that 'dim' and 'debugGui' be made protected in omj.tools.debugger.Main.\n\nThanks,\n\nCameron\n\nReproducible: Always\n\nSteps to Reproduce:",
    "hasPatch": true,
    "hasScreenshot": false,
    "id": "328924",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "-- minor",
    "product": "Rhino",
    "project": "RHINO",
    "summary": "Impossible to use the debugger from outside the omj.tools.debugger package",
    "systemSpecification": false,
    "version": "other"
}