{
    "comments": [
        {
            "author": "gerv@mozilla.org",
            "body": "If these files aren't vital for Rhino proper, the easiest fix is indeed to make their inclusion require a specific build option. In the long term, it would be good to get these files, if they are still needed, relicensed under something compatible with Rhino. Sun may well be happy to do that, given their current stance on free Java.\n\nBut for that, I'd need a clear statement from a Rhino lead saying that the files are still used and useful, and that they'd like me to investigate that possibility.\n\nGerv",
            "date": "20080225T20:37:36",
            "id": 0
        },
        {
            "author": "szegedia@freemail.hu",
            "body": "It is my understanding these are required for the debugger GUI. Their inclusion in the project predates my involvement, so I'm not 100% clear about their status. I know that we aren't hosting the source files, but that our build process is pulling them from Sun's website automatically for compilation. It might be the case that we aren't allowed to redistribute their sources (which we don't), but we can redistribute the binary compiled classfiles.\n\nIt would indeed be preferred to get an explicit permission from Sun, so we're in the clear. Especially since lacking it, we'd need to either separate the debugger GUI into a different package, or distribute it in source code only and have people who need it run the build task for it themselves.  ",
            "date": "20080226T10:31:27",
            "id": 1
        },
        {
            "author": "mozilla@kaply.com",
            "body": "I definitely think you should split out the debugger UI. There are many use cases for Rhino that do not include the debugger UI.\n\nAlso, My bet is that the redistribution of binary files separate from the original distribution is not allowed either.\n\nI'd like to know if there was ever an agreement with Sun to do this.",
            "date": "20080226T15:26:19",
            "id": 2
        },
        {
            "author": "pombredanne@nexb.com",
            "body": "(In reply to comment #2)\nAttila:\nI think that the GuI and build code that pulls those sources should be excluded from the default js.jar .\nand only a manual build option (with a detailed readme) should allow inluding those bits.\nwhat do you think?\nwould you are for a patch?",
            "date": "20080226T16:43:26",
            "id": 3
        },
        {
            "author": "szegedia@freemail.hu",
            "body": "(In reply to comment #4)\n\nAs I said, these files were first included before I got involved with the project, so I don't know if we have some sort of a separate agreement/permission from Sun. I've notified Norris; he'll hopefully have some additional information from him soon.",
            "date": "20080226T17:32:34",
            "id": 4
        },
        {
            "author": "mozilla@kaply.com",
            "body": "The odd part is that these are just code samples from an article:\n\nhttp://java.sun.com/products/jfc/tsc/articles/treetable2/ \n\nBut the code is marked proprietary/confidential.\n\nUnfortunately neither of the two people involved in writing the article work for Sun anymore.",
            "date": "20080226T17:57:44",
            "id": 5
        },
        {
            "author": "gerv@mozilla.org",
            "body": "I'll let you guys work on a technical fix; I've sent an email to Sun to ask them if they would be kind enough to solve the problem from the legal end.\n\nGerv\n",
            "date": "20080227T10:35:00",
            "id": 6
        },
        {
            "author": "pombredanne@nexb.com",
            "body": "Thanks: is there anything I could help with?",
            "date": "20080227T17:06:59",
            "id": 7
        },
        {
            "author": "norrisboyd@gmail.com",
            "body": "I've refactored the build so we no longer ship binaries built from those files. ",
            "date": "20080307T02:01:25",
            "id": 8
        },
        {
            "author": "gerv@mozilla.org",
            "body": "Norris: that's great, thanks :-) Would it be possible to push a Rhino point release, perhaps just with that change, so the latest stable code we are distributing doesn't have this problem?\n\nGerv",
            "date": "20080307T15:59:14",
            "id": 9
        },
        {
            "author": "pombredanne@nexb.com",
            "body": "Norris:\nThanks! yes, that would be great to push a point release!",
            "date": "20080307T16:37:53",
            "id": 10
        },
        {
            "author": "gerv@mozilla.org",
            "body": "Gentlemen,\nI'm told all the code in question has now been republished under  \nsuitable licenses at:\n\nhttp://java.sun.com/products/jfc/tsc/articles/treetable2/src/JTreeTable1.java\nhttp://java.sun.com/products/jfc/tsc/articles/treetable2/src/AbstractCellEditor.java\nhttp://java.sun.com/products/jfc/tsc/articles/treetable2/src/TreeTableModel.java\nhttp://java.sun.com/products/jfc/tsc/articles/treetable2/src/TreeTableModelAdapter.java\n\nPerhaps oneone would care to download these copies of the code and restore Rhino to its former form?\n\nGerv",
            "date": "20080609T14:26:44",
            "id": 11
        }
    ],
    "component": "Core",
    "description": "Rhino currently downloads and packages four Sun files as part of its build process:\n\nAbstractCellEditor.java\nJTreeTable.java\nTreeTableModel.java\nTreeTableModelAdapter.java\n\nThis invalidates the Rhino licensing.\n\nApparently these files are used for some debugger UI or something?\n\nThere should be an option to build a Rhino package that doesn't include these proprietary files.",
    "hasPatch": false,
    "hasScreenshot": false,
    "id": "419491",
    "issuetypeClassified": "OTHER",
    "issuetypeTracker": "BUG",
    "priority": "-- major",
    "product": "Rhino",
    "project": "RHINO",
    "summary": "Rhino downloads and packages proprietary Sun files as part of its build process",
    "systemSpecification": false,
    "version": "head"
}